export default [
  {
    "id": "idiom-6c6e6bb75d31",
    "word": "가가대소",
    "hanja": "呵呵大笑",
    "meaning": "우스워서 소리를 크게 내어 웃음"
  },
  {
    "id": "idiom-a0fa46a70480",
    "word": "가가호호",
    "hanja": "家家戶戶",
    "meaning": "한 집도 빠짐없이 집집마다."
  },
  {
    "id": "idiom-47add2aee332",
    "word": "가계야치",
    "hanja": "家鷄野雉",
    "meaning": "집안에서 기르는 닭과 산의 꿩이란 뜻 자기 것은 하찮게 여기고 남의 것만 좋게 여김을 비유"
  },
  {
    "id": "idiom-43b99868753a",
    "word": "가고가하",
    "hanja": "可高可下",
    "meaning": "어진 사람은 지위의 상하를 가리지 않음을 이름"
  },
  {
    "id": "idiom-ce3aa6b2db44",
    "word": "가고문적",
    "hanja": "可考文籍",
    "meaning": "후일에 참고가 될만한 서류"
  },
  {
    "id": "idiom-61e6d2d22072",
    "word": "가급인족",
    "hanja": "家給人足",
    "meaning": "집집마다 살림이 넉넉하고, 사람마다 의식에 부족함이 없이 넉넉함"
  },
  {
    "id": "idiom-62ac7180333b",
    "word": "가기이방",
    "hanja": "可欺以方",
    "meaning": "그럴듯한 말로 속일 수 있음"
  },
  {
    "id": "idiom-957a45f2a1b5",
    "word": "가농성진",
    "hanja": "假弄成眞",
    "meaning": "처음에 장난삼아 한 일이 나중에 정말이 됨. (=弄假成眞)"
  },
  {
    "id": "idiom-7c454c686900",
    "word": "가담항설",
    "hanja": "街談巷說",
    "meaning": "길거리에 떠도는 소문"
  },
  {
    "id": "idiom-e2aaa6537901",
    "word": "가도멸괵",
    "hanja": "假途滅虢",
    "meaning": "길을 빌려서 괵을 멸한다는 뜻. 이는 옛날 고사에서 비롯되었다"
  },
  {
    "id": "idiom-999a0c5a3bf8",
    "word": "가도벽립",
    "hanja": "家徒壁立",
    "meaning": "집안에 세간이라고는 하나도 없고 다만 사면에 벽만이 둘려있을 뿐이라 는 뜻. 집안이 가난함"
  },
  {
    "id": "idiom-ac976cd1f86e",
    "word": "가동가서",
    "hanja": "可東可西",
    "meaning": "동쪽이라도 좋고 서쪽이라도 좋다. 이러나저러나 상관없다. (=可以東可以西)"
  },
  {
    "id": "idiom-9c9c41877684",
    "word": "가동주졸",
    "hanja": "街童走卒",
    "meaning": "길거리에서 노는 철없는 아이. 일정한 주견이 없이 길거리를 떠돌아다니는 하류배"
  },
  {
    "id": "idiom-fe3531a2479c",
    "word": "가렴주구",
    "hanja": "苛斂誅求",
    "meaning": "세금이나 재물을 가혹하게 거두어들임."
  },
  {
    "id": "idiom-3ece20374d05",
    "word": "가릉빈가",
    "hanja": "迦陵頻伽",
    "meaning": "상상의 새 이름. 사람얼굴과 새의 몸이며, 미인이고 소리가 아름다워 싫증이 나지 않는다 함"
  },
  {
    "id": "idiom-b3ec8d198367",
    "word": "가무담석",
    "hanja": "家無擔石",
    "meaning": "석 (石)은 한 항아리, 담 (擔)은 두 항아리라는 뜻으로 집에 모아 놓은 재산이 조금도 없음을 말한다"
  },
  {
    "id": "idiom-1ad1b292f48c",
    "word": "가부지친",
    "hanja": "葭莩之親",
    "meaning": "가부는 갈대의 줄 기속에 있는 엷은 종이와 같은 것으로 아주 먼 친척을 이름"
  },
  {
    "id": "idiom-e02f168455f8",
    "word": "가빈친로",
    "hanja": "家貧親老",
    "meaning": "집이 가난하고 어버이가 늙었을 때는 그 봉양을 위해 마땅치 않은 벼슬자리라도 가 한다는 말"
  },
  {
    "id": "idiom-513b30e2dcbf",
    "word": "가서만금",
    "hanja": "家書萬金",
    "meaning": "여행 중에 가인으로부터 서신을 받으면 그 기쁨이 만금을 얻는 데 해당 한다"
  },
  {
    "id": "idiom-14dffacab2ef",
    "word": "가여낙성",
    "hanja": "可與樂成",
    "meaning": "함께 일의 성공을 즐길 수 있다는 말"
  },
  {
    "id": "idiom-3b10b3194b24",
    "word": "가유호세",
    "hanja": "家諭戶說",
    "meaning": "집집마다 깨우쳐 알아듣게 말함"
  },
  {
    "id": "idiom-ae00720ad051",
    "word": "가인박명",
    "hanja": "佳人薄命",
    "meaning": "아름다운 사람은 운명이 기박함"
  },
  {
    "id": "idiom-e4e1b86a3c5c",
    "word": "가장집물",
    "hanja": "家藏什物",
    "meaning": "집안의 모든 세간"
  },
  {
    "id": "idiom-47b83e6c4581",
    "word": "가호위호",
    "hanja": "假虎威狐",
    "meaning": "호랑이의 위엄을 여우가 빌린다는 뜻으로 호가호위와 같은 말"
  },
  {
    "id": "idiom-c7cf0f85d7d1",
    "word": "각고면려",
    "hanja": "刻苦勉勵",
    "meaning": "심신의 고생을 이겨내면서 오직 한 가지 일에만 노력을 기울임"
  },
  {
    "id": "idiom-89c59de781c1",
    "word": "각곡유목",
    "hanja": "刻鵠類鶩",
    "meaning": "따오기를 그리려다 비슷한 집오리를 그린다. (남을 본받아 배워서 다소 나마 보람이 있다.)"
  },
  {
    "id": "idiom-d09e39d2c101",
    "word": "각골난망",
    "hanja": "刻骨難忘",
    "meaning": "입은 은혜를 뼈에 새길 만큼 잊지 못함."
  },
  {
    "id": "idiom-86e57496508c",
    "word": "각골명심",
    "hanja": "刻骨銘心",
    "meaning": "뼈에 새기고 마음에 새긴다. 어떤 것을 마음 속 깊이 새겨둠"
  },
  {
    "id": "idiom-d9c2e3bad7cd",
    "word": "각골통한",
    "hanja": "刻骨痛恨",
    "meaning": "원한이 뼈에 사무쳐 잊히지 않고 깊이 한탄한다"
  },
  {
    "id": "idiom-5abf458de65f",
    "word": "각득기소",
    "hanja": "各得其所",
    "meaning": "모든 것이 그 있어야 할 곳에 있게 됨. (능력과 적성에 맞게 적절한 배치를 받게 됨을 말함.)"
  },
  {
    "id": "idiom-308dab5a812a",
    "word": "각로청수",
    "hanja": "刻露淸秀",
    "meaning": "가을의 맑고 아름다운 경치를 이름"
  },
  {
    "id": "idiom-2b78e6dc180c",
    "word": "각립손하",
    "hanja": "恪粒飡霞",
    "meaning": "곡식을 피하고 노을을 먹는다는 뜻으로 선인을 이름"
  },
  {
    "id": "idiom-49c23371257f",
    "word": "각인각색",
    "hanja": "各人各色",
    "meaning": "각 사람이 제각기 다름"
  },
  {
    "id": "idiom-fcaea20d376e",
    "word": "각자도생",
    "hanja": "各自圖生",
    "meaning": "제각기 살길을 도모함"
  },
  {
    "id": "idiom-bd5feeeb7ffa",
    "word": "각자무치",
    "hanja": "角者無齒",
    "meaning": "사람은 제각기 살아갈 방법을 모색한다"
  },
  {
    "id": "idiom-be2857ccd65f",
    "word": "각자위정",
    "hanja": "各自爲政",
    "meaning": "각각의 사람들이 자기 마음대로 한다면 전체와의 조화나 타인과의 협력을 생각하기 어렵다"
  },
  {
    "id": "idiom-ac688f8afb42",
    "word": "각주구검",
    "hanja": "刻舟求劍",
    "meaning": "상황이 바뀌었는데도 낡은 방법만 고집함."
  },
  {
    "id": "idiom-feb52657b4eb",
    "word": "각질천리",
    "hanja": "覺蛭千里",
    "meaning": "큰일을 그르치는 자를 깨닫게 하는 뜻"
  },
  {
    "id": "idiom-983db38a2b01",
    "word": "각촉위시",
    "hanja": "刻燭爲詩",
    "meaning": "촛불이 한 치 (寸) 타는 동안에 詩를 지음"
  },
  {
    "id": "idiom-5564cfbc26b1",
    "word": "간난신고",
    "hanja": "艱難辛苦",
    "meaning": "갖은 고초를 다 겪으며 고생함"
  },
  {
    "id": "idiom-ccff9aea6b2d",
    "word": "간뇌도지",
    "hanja": "肝腦塗地",
    "meaning": "창살을 당해 간과 뇌가 땅에 으깨어졌다는 뜻으로 여지없이 패함을 이르는 말"
  },
  {
    "id": "idiom-d72329f8a948",
    "word": "간담상조",
    "hanja": "肝膽相照",
    "meaning": "서로의 마음을 터놓고 사귐"
  },
  {
    "id": "idiom-9ab37ced48a5",
    "word": "간담초월",
    "hanja": "肝膽楚越",
    "meaning": "간담처럼 가까운 사이에도 서로 멀리 떨어져 관계가 없을 을 일컬음"
  },
  {
    "id": "idiom-52ffbc11913c",
    "word": "간두지세",
    "hanja": "竿頭之勢",
    "meaning": "대나무 가지 꼭대기에 서 있게 된 형세. 어려움이 극도에 달하여 아주 위태로운 상황을 말한다"
  },
  {
    "id": "idiom-80a3e5a1677f",
    "word": "간목수생",
    "hanja": "乾木水生",
    "meaning": "마른나무에서 물을 달라는 격으로 아무 것도 없는 사람에게 무리한 요구를 함"
  },
  {
    "id": "idiom-0c5f7694e80a",
    "word": "간불용발",
    "hanja": "間不容髮",
    "meaning": "머리털 하나 들어갈 틈이 없다는 뜻으로 조그마한 여유 또는 빈틈도 없음을 비유한 말"
  },
  {
    "id": "idiom-f187d1288e61",
    "word": "간성난색",
    "hanja": "姦聲亂色",
    "meaning": "간사한 소리는 귀를 어지럽게 하고, 좋지 못한 색은 눈을 어지럽게 함"
  },
  {
    "id": "idiom-b06d32350703",
    "word": "간성지재",
    "hanja": "干城之材",
    "meaning": "방패와 성의 구실을 하는 인재란 뜻으로, 나라를 지키는 믿음직한 인재를 이르는 말"
  },
  {
    "id": "idiom-8bd4013b3405",
    "word": "간세지재",
    "hanja": "間世之材",
    "meaning": "썩 뛰어난 인물"
  },
  {
    "id": "idiom-af28282007aa",
    "word": "간신적자",
    "hanja": "奸臣賊子",
    "meaning": "간사한 신하와 불효한 자식. (=亂臣賊子)"
  },
  {
    "id": "idiom-6c69fe7b40b2",
    "word": "간악무도",
    "hanja": "奸惡無道",
    "meaning": "간사하고 악독하며 도리에 어긋남"
  },
  {
    "id": "idiom-fffd988c7955",
    "word": "간어제초",
    "hanja": "間於齊楚",
    "meaning": "중국 주나라 말엽에 약소국 등나라가 제·초의 두 큰 나라 사이에 끼여 괴로움을 당함"
  },
  {
    "id": "idiom-20c83029c11f",
    "word": "간운보월",
    "hanja": "看雲步月",
    "meaning": "객지에서 잡생각을 하고 달밤에 멀리 구름을 바라보며 거님"
  },
  {
    "id": "idiom-361045587f19",
    "word": "간장막야",
    "hanja": "干將莫耶",
    "meaning": "명검도 사람의 손길이 가야 빛난다 (사람의 성품도 원래는 악하므로 노력을 기울여야 선하게 된다)"
  },
  {
    "id": "idiom-2369c9681358",
    "word": "갈력진능",
    "hanja": "竭力盡能",
    "meaning": "체력을 다하고 능력을 다함"
  },
  {
    "id": "idiom-42213bc8ffac",
    "word": "갈이천정",
    "hanja": "渴而穿井",
    "meaning": "목이 말라서야 우물을 판다. (미리 준비하여 두지 않고 임박하여 급히 하면 이미 때가 늦는다.)"
  },
  {
    "id": "idiom-e80883043ee5",
    "word": "갈자이음",
    "hanja": "渴者易飮",
    "meaning": "목이 마른 자는 탁한 물이라도 만족한다"
  },
  {
    "id": "idiom-315df9951b10",
    "word": "갈택이어",
    "hanja": "竭澤而魚",
    "meaning": "연못을 말려 고기를 얻는다는 말. (눈앞의 이익만을 추구하여 먼 장래는 생각하지 않음을 가르침)"
  },
  {
    "id": "idiom-483f246ea67b",
    "word": "감개무량",
    "hanja": "感慨無量",
    "meaning": "아무 말도 못할 정도로 가슴 가득히 절실히 느끼는 것. (사물에 대한 회포의 느낌이 한이 없음)"
  },
  {
    "id": "idiom-c21fe3cc9b15",
    "word": "감구지회",
    "hanja": "感舊之懷",
    "meaning": "지난 일을 생각하는 마음"
  },
  {
    "id": "idiom-43abe8a84e1d",
    "word": "감불생심",
    "hanja": "敢不生心",
    "meaning": "감히 엄두를 내지 못함"
  },
  {
    "id": "idiom-fd99f3c2b763",
    "word": "감언이설",
    "hanja": "甘言利說",
    "meaning": "상대의 마음을 홀리는 달콤하고 그럴듯한 말."
  },
  {
    "id": "idiom-383d29c7a761",
    "word": "감언지지",
    "hanja": "敢言之地",
    "meaning": "맛이 좋은 우물물은 길어가는 사람이 많으므로 빨리 마른다"
  },
  {
    "id": "idiom-892f8f14458e",
    "word": "감정선갈",
    "hanja": "甘井先竭",
    "meaning": "물이 좋은 샘은 이용하는 사람이 많아서 빨리 마름, (유능한 사람은 많이 쓰이어 빨리 쇠퇴한다)"
  },
  {
    "id": "idiom-8194cdc1c3db",
    "word": "감지덕지",
    "hanja": "感之德之",
    "meaning": "감사합니다, 덕분입니다. 몹시 고맙게 여기는 말"
  },
  {
    "id": "idiom-d64fbac01ccf",
    "word": "감탄고토",
    "hanja": "甘呑苦吐",
    "meaning": "달면 삼키고 쓰면 뱉듯 자기 이익만 따짐."
  },
  {
    "id": "idiom-d7800b790696",
    "word": "갑남을녀",
    "hanja": "甲男乙女",
    "meaning": "갑이라는 남자와 을이라는 여자 보통사람들"
  },
  {
    "id": "idiom-bf89b4d2971e",
    "word": "갑론을박",
    "hanja": "甲論乙駁",
    "meaning": "자기의 주장을 세우고 남의 주장을 반박함"
  },
  {
    "id": "idiom-59908d5b0097",
    "word": "강간약지",
    "hanja": "强幹弱枝",
    "meaning": "줄기를 강하게 하고 가지 (지엽)를 약하게 함"
  },
  {
    "id": "idiom-88655e2844c1",
    "word": "강개지심",
    "hanja": "慷慨之心",
    "meaning": "충성을 맹세하나 받아들여지지 않자 고독을 한탄하며 지조를 변치 않겠다는 마음"
  },
  {
    "id": "idiom-9e85aafa0421",
    "word": "강구연월",
    "hanja": "康衢煙月",
    "meaning": "태평한 시대의 평화로운 풍경"
  },
  {
    "id": "idiom-1ce851baf9d2",
    "word": "강근지친",
    "hanja": "强近之親",
    "meaning": "도와 줄만한 가까운 친척"
  },
  {
    "id": "idiom-7f64ace0588d",
    "word": "강노지말",
    "hanja": "强弩之末",
    "meaning": "강대한 힘일지라도 최후의 쇠약해짐에는 어쩔 수 없다"
  },
  {
    "id": "idiom-9f3d454e681c",
    "word": "강랑재진",
    "hanja": "江郞才盡",
    "meaning": "강랑의 재주가 다했다는 말로, 학문상에 있어 한 차례 두각을 나타낸 후퇴 보하는 것을 뜻한다"
  },
  {
    "id": "idiom-67eb83720889",
    "word": "강목수생",
    "hanja": "剛木水生",
    "meaning": "마른 나무에서 물을 내게 한다. 어려운 사람에게 없는 것을 내라고 강요하는 것을 비유한다"
  },
  {
    "id": "idiom-e705b0e22705",
    "word": "강산일변",
    "hanja": "江山一變",
    "meaning": "강과 산이 아주 바뀜. 곧, 오랜 세월이 흘렀음"
  },
  {
    "id": "idiom-9e3bfbeb65ee",
    "word": "강산지조",
    "hanja": "江山之助",
    "meaning": "강산 (산수)의 풍경이 사람의 시정 (詩情)을 도와 좋은 작품을 만들게 함"
  },
  {
    "id": "idiom-5047ada9ad1d",
    "word": "강안여자",
    "hanja": "强顔女子",
    "meaning": "얼굴이 강한 여자라는 말로, 수치심을 모르는 여자라는 뜻이다. 强顔은 鐵面皮 와 같은 말이다"
  },
  {
    "id": "idiom-0f161c619274",
    "word": "강약부동",
    "hanja": "强弱不同",
    "meaning": "강자와 약자는 상대가 되지 않음"
  },
  {
    "id": "idiom-6fd2746d44d2",
    "word": "강호연파",
    "hanja": "江湖煙波",
    "meaning": "강이나 호수 위에 안개처럼 뽀얗게 이는 잔물결"
  },
  {
    "id": "idiom-c385176528b7",
    "word": "개과불린",
    "hanja": "改過不吝",
    "meaning": "잘못을 고치는 데는 조금도 인색하지 말라는 말"
  },
  {
    "id": "idiom-619309b64e7b",
    "word": "개과천선",
    "hanja": "改過遷善",
    "meaning": "지나간 허물을 고치고 착하게 됨"
  },
  {
    "id": "idiom-f202e511f9a7",
    "word": "개관사정",
    "hanja": "蓋棺事定",
    "meaning": "관의 뚜껑을 덮고 난 뒤에야 안다는 것으로 死後에 그 사람에 대한 올바른 평가를 할 수 있다"
  },
  {
    "id": "idiom-493ffdc873aa",
    "word": "개권유익",
    "hanja": "開卷有益",
    "meaning": "책을 펴서 읽으면 반드시 이로움이 있다. 開卷은 책을 펴서 읽는 것을 말한다"
  },
  {
    "id": "idiom-ec4bda4aa478",
    "word": "개두환면",
    "hanja": "改頭換面",
    "meaning": "머리를 고치고 얼굴을 바꿈. 마음은 그대로 두고 표면만을 고침"
  },
  {
    "id": "idiom-bd7f90eeb40f",
    "word": "개문납적",
    "hanja": "開門納賊",
    "meaning": "문을 열고 도적에게 바친다. 스스로 재화 (災禍)를 끌어 들이는 것을 말함. (=開門而揖盜)"
  },
  {
    "id": "idiom-33a0e7f8ac50",
    "word": "개문읍도",
    "hanja": "開門揖盜",
    "meaning": "일부러 문을 열어 놓고 도둑을 청한다는 뜻으로 스스로 화를 불러들인다는 말"
  },
  {
    "id": "idiom-ae618421c50d",
    "word": "개물성무",
    "hanja": "開物成務",
    "meaning": "사물을 열고, 일을 성사시킨다. 아직 모르는 곳을 개발하고 사람이 하고자 하는 바를 성취시킴"
  },
  {
    "id": "idiom-b9bff761f04e",
    "word": "개선광정",
    "hanja": "改善匡正",
    "meaning": "좋도록 고치고 바로잡음"
  },
  {
    "id": "idiom-9de2041da09b",
    "word": "개세지재",
    "hanja": "蓋世之才",
    "meaning": "세상을 덮을 만한 재주"
  },
  {
    "id": "idiom-6c72e0ae2fd2",
    "word": "개옥개행",
    "hanja": "改玉改行",
    "meaning": "차고 다닐 옥의 종류를 바꾸면 걸음걸이도 바꾸어야 한다"
  },
  {
    "id": "idiom-a0eaabc14278",
    "word": "개자불배",
    "hanja": "介者不拜",
    "meaning": "갑주 (甲胄-갑옷과 투구)를 몸에 한 자는 배례 (큰절)를 하지 않음"
  },
  {
    "id": "idiom-ba01399ad93e",
    "word": "객반위주",
    "hanja": "客反爲主",
    "meaning": "객이 도리어 주인 행세를 함"
  },
  {
    "id": "idiom-f8cfc204c0aa",
    "word": "객지면식",
    "hanja": "客地眠食",
    "meaning": "객지에서 자고 먹는 일 (곧 객지생활을 하는 상태)"
  },
  {
    "id": "idiom-e181f964cf4a",
    "word": "객창한등",
    "hanja": "客窓寒燈",
    "meaning": "나그네의 숙소 창가에 비치는 싸늘한 등불 즉 나그네의 외로운 신세를 비유한 말"
  },
  {
    "id": "idiom-151a19a21510",
    "word": "갱무도리",
    "hanja": "更無道理",
    "meaning": "다시는 어쩔 도리가 없음"
  },
  {
    "id": "idiom-74c10f2eba82",
    "word": "거경지신",
    "hanja": "巨卿之信",
    "meaning": "거경의 신의라는 말로, 굳은 약속을 의미한다"
  },
  {
    "id": "idiom-418bf781fefe",
    "word": "거기부정",
    "hanja": "擧棋不定",
    "meaning": "바둑을 두는데 포석 (布石)할 자리를 결정하지 않고 둔다면 한 집도 이기기 어렵다"
  },
  {
    "id": "idiom-dc1cb686a562",
    "word": "거두절미",
    "hanja": "去頭截尾",
    "meaning": "머리와 꼬리를 자른다는 뜻으로, 앞뒤의 잔사설을 빼고 요점만을 말함"
  },
  {
    "id": "idiom-259c99d85e7d",
    "word": "거세개탁",
    "hanja": "擧世皆濁",
    "meaning": "세상이 다 흐리다는 말"
  },
  {
    "id": "idiom-ea8213f56e36",
    "word": "거수마룡",
    "hanja": "車水馬龍",
    "meaning": "거마의 왕래가 흐르는 물이나 길게 늘어진 용처럼 끊임없이 많음. 즉, 행렬이 성대한 모양"
  },
  {
    "id": "idiom-ce8b00b3ea00",
    "word": "거안사위",
    "hanja": "居安思危",
    "meaning": "편안히 살 때 닥쳐올 위태로움을 생각함"
  },
  {
    "id": "idiom-76af0cde6d6f",
    "word": "거안제미",
    "hanja": "擧案齊眉",
    "meaning": "밥상을 눈 위로 들어올린다. 즉 아내가 남편을 공경하여 받는다는 뜻"
  },
  {
    "id": "idiom-494ece83f1f9",
    "word": "거어지탄",
    "hanja": "車魚之歎",
    "meaning": "수레와 고기가 없음을 탄식함. 사람의 욕심에는 한이 없음을 이름"
  },
  {
    "id": "idiom-b12d62450b2a",
    "word": "거일반삼",
    "hanja": "擧日反三",
    "meaning": "한일을 미루어 모든 일을 헤아림"
  },
  {
    "id": "idiom-da670aff3c74",
    "word": "거자일소",
    "hanja": "去者日疎",
    "meaning": "죽은 사람에 대한 것은 날이 갈수록 잊어버리게 된다"
  },
  {
    "id": "idiom-8d14559cd248",
    "word": "거재두량",
    "hanja": "車載斗量",
    "meaning": "수레에 싣고 말 (斗)로 된다는 뜻으로, 물건이나 인재 등이 많아 귀하지 않음을 일컬음"
  },
  {
    "id": "idiom-1835177bc248",
    "word": "거족일치",
    "hanja": "擧族一致",
    "meaning": "온 겨레의 뜻과 힘이 함께 뭉쳐 한결같음"
  },
  {
    "id": "idiom-0b9a8afc3fea",
    "word": "거주양난",
    "hanja": "去住兩難",
    "meaning": "가야하는지 말아야하는지 결정하기 어렵다는 뜻"
  },
  {
    "id": "idiom-ebd04f485b62",
    "word": "거지중천",
    "hanja": "居之中天",
    "meaning": "텅 빈 공간"
  },
  {
    "id": "idiom-be21fc1d2c7b",
    "word": "거허박영",
    "hanja": "據虛博影",
    "meaning": "어찌할 수 없는 것 (=束手無策)"
  },
  {
    "id": "idiom-4748107bfd59",
    "word": "건곤일색",
    "hanja": "乾坤一色",
    "meaning": "겨울 온 천지에 눈이 내린 경치"
  },
  {
    "id": "idiom-8e0b72fb2e6f",
    "word": "건곤일척",
    "hanja": "乾坤一擲",
    "meaning": "흥망 성패를 걸고 단판 싸움을 함"
  },
  {
    "id": "idiom-e4ea7d002aab",
    "word": "걸견폐요",
    "hanja": "桀犬吠堯",
    "meaning": "아랫사람을 진심과 믿음으로 대하면 아랫사람은 자기 상관에게 충성을 다하게 된다"
  },
  {
    "id": "idiom-c0fdf95f3eee",
    "word": "걸불병행",
    "hanja": "乞不竝行",
    "meaning": "구걸하는 사람은 같이 다니지 않는다. (무엇을 요구하거나 청을 한때는 혼자서 가는 것이 이롭다는 뜻)"
  },
  {
    "id": "idiom-3b2aa216936d",
    "word": "검려지기",
    "hanja": "黔驢之技",
    "meaning": "당나귀의 뒷발질. 자기의 기술이 졸렬함을 모르고 함부로 행동하다 욕을 봄"
  },
  {
    "id": "idiom-3b642209c2d5",
    "word": "격기비심",
    "hanja": "格其非心",
    "meaning": "그 그릇된 마음을 바르게 고침"
  },
  {
    "id": "idiom-01fca3076b86",
    "word": "격물치지",
    "hanja": "格物致知",
    "meaning": "만물을 관찰하고 탐구하여 각각의 다름과 같음을 깨달아 밝게 하고 확고한 지식으로 이르게 함"
  },
  {
    "id": "idiom-3c863a9ec552",
    "word": "격세지감",
    "hanja": "隔世之感",
    "meaning": "세월이 많이 지난 것 같은 느낌. 중국 堯임금때 풍년이 들어 농부가 태평한 세월을 부른 노래"
  },
  {
    "id": "idiom-29593fc320cb",
    "word": "격양노인",
    "hanja": "擊壤老人",
    "meaning": "태평한 생활을 즐거워하여 노인이 땅을 치며 노래함"
  },
  {
    "id": "idiom-c376a84cf674",
    "word": "격탁양청",
    "hanja": "激濁揚淸",
    "meaning": "탁류를 몰아내고 청파를 끌어 들임. 惡을 미워하고 善을 좋아함"
  },
  {
    "id": "idiom-9642997a10fb",
    "word": "격화소양",
    "hanja": "隔靴搔痒",
    "meaning": "신을 신고 가려운 데를 긁는다 함이니 마음으로는 애써 하려하나 실제 효과는 얻지 못함"
  },
  {
    "id": "idiom-de990f79b295",
    "word": "격화파양",
    "hanja": "隔靴爬癢",
    "meaning": "신을 신은 채 가려운 발바닥을 긁는 것과 같이 일의 효과를 내긴 했어도 만족감을 얻기 어려움"
  },
  {
    "id": "idiom-20da5cda17f1",
    "word": "견강부회",
    "hanja": "牽强附會",
    "meaning": "이치에도 닿지 않는 것을 억지로 끌어다 붙임"
  },
  {
    "id": "idiom-137e9c01dc00",
    "word": "견금여석",
    "hanja": "見金如石",
    "meaning": "황금을 보기를 돌같이 하라'고 풀이되며 지나친 욕심을 절제함을 뜻함"
  },
  {
    "id": "idiom-8691f4f254dc",
    "word": "견리망의",
    "hanja": "見利忘義",
    "meaning": "이익을 보면 의리를 잊음"
  },
  {
    "id": "idiom-19034678e526",
    "word": "견리사의",
    "hanja": "見利思義",
    "meaning": "눈앞에 이익이 보일 때 의리를 생각함"
  },
  {
    "id": "idiom-11d824374d41",
    "word": "견마지년",
    "hanja": "犬馬之年",
    "meaning": "자기 나이를 낮추어 하는 말"
  },
  {
    "id": "idiom-0f5afe84728a",
    "word": "견마지로",
    "hanja": "犬馬之勞",
    "meaning": "개와 말의 노력, 임금이나 나라에 충성을 다하는 노력"
  },
  {
    "id": "idiom-769edf4fdfcb",
    "word": "견마지성",
    "hanja": "犬馬之誠",
    "meaning": "임금이나 나라에 정성으로 바치는 정성. 자기의 정성을 낮추어 일컫는 말"
  },
  {
    "id": "idiom-958736f18c75",
    "word": "견마지양",
    "hanja": "犬馬之養",
    "meaning": "개나 말을 기를 때에도 먹이기는 한다. 부모를 소홀히 대접하고 공경하지 않음을 뜻함"
  },
  {
    "id": "idiom-b538c718ffa5",
    "word": "견마지충",
    "hanja": "犬馬之忠",
    "meaning": "개나 말처럼 자기의 몸을 아끼지 않고 바치는 자기의 충성"
  },
  {
    "id": "idiom-82ae42527776",
    "word": "견마지치",
    "hanja": "犬馬之齒",
    "meaning": "자기 나이를 낮추어서 상대방에게 하는 말"
  },
  {
    "id": "idiom-b98c38207ad8",
    "word": "견모상마",
    "hanja": "見毛相馬",
    "meaning": "사람의 말만 듣고 채용하는 것은 말을 살 때 털 만보고 사는 것처럼 겉만 보고 오류를 범하기 쉽다"
  },
  {
    "id": "idiom-1128aab2e166",
    "word": "견문각지",
    "hanja": "見聞覺知",
    "meaning": "보고 듣고 깨달아서 앎. 곧 경험"
  },
  {
    "id": "idiom-21e79eda8807",
    "word": "견문발검",
    "hanja": "見蚊拔劍",
    "meaning": "모기를 보고 칼을 뺌. 조그만 일에도 성을 내는 소견 좁은 행동"
  },
  {
    "id": "idiom-8797040d8505",
    "word": "견물생심",
    "hanja": "見物生心",
    "meaning": "물건을 보고 갖고 싶은 욕심이 생김."
  },
  {
    "id": "idiom-ad2b99edbd0c",
    "word": "견백동이",
    "hanja": "堅白同異",
    "meaning": "是를 非라 하고 非를 是라 하며 同을 異라 하고 異를 同이라 하는 것과 같은 억지논리"
  },
  {
    "id": "idiom-7a48e2023141",
    "word": "견벽청야",
    "hanja": "堅壁淸野",
    "meaning": "堅壁은 성벽을 견고히 지키는 것. 淸野는 들의 작물을 거두어 쳐들어오는 적에게 양식이나 쉴 곳이 없음"
  },
  {
    "id": "idiom-0ceeb42aff0e",
    "word": "견선여갈",
    "hanja": "見善如渴",
    "meaning": "착한 일을 보기를 마치 목마른 것같이 하라"
  },
  {
    "id": "idiom-e58606e1bbe1",
    "word": "견선종지",
    "hanja": "見善從之",
    "meaning": "착한 일이나 착한 사람을 보면 그것을 따르라"
  },
  {
    "id": "idiom-8c93013df4a3",
    "word": "견설고골",
    "hanja": "犬齧枯骨",
    "meaning": "개가 말라빠진 뼈를 핥음. 아무 맛도 없는 것을 뜻한다"
  },
  {
    "id": "idiom-b922959a9e6f",
    "word": "견아상제",
    "hanja": "犬牙相制",
    "meaning": "개의 어금니가 서로 맞지 않음. 국경선이 볼록 나오고 오목 들어가 서로 견제하려는 형세를 말한다"
  },
  {
    "id": "idiom-7146a2142760",
    "word": "견여금석",
    "hanja": "堅如金石",
    "meaning": "굳기가 금이나 돌 같음"
  },
  {
    "id": "idiom-d9a8e8113ced",
    "word": "견원지간",
    "hanja": "犬猿之間",
    "meaning": "개와 원숭이 사이로 사이가 몹시 나쁨을 이르는 말"
  },
  {
    "id": "idiom-c48dc651efd0",
    "word": "견위수명",
    "hanja": "見危授命",
    "meaning": "나라가 위급할 때 목숨을 바침 (=見危致命)"
  },
  {
    "id": "idiom-a99c116efae8",
    "word": "견위치명",
    "hanja": "見危致命",
    "meaning": "나라의 위태로움을 보고 목숨을 버림"
  },
  {
    "id": "idiom-9911bf066465",
    "word": "견이불식",
    "hanja": "見而不食",
    "meaning": "보고도 먹지 못함. (=畵中之餠)"
  },
  {
    "id": "idiom-bcbcc977b59b",
    "word": "견인불발",
    "hanja": "堅忍不拔",
    "meaning": "굳게 참고 견디어 마음을 빼앗기지 아니함"
  },
  {
    "id": "idiom-f40af282018a",
    "word": "견토방구",
    "hanja": "見兎放狗",
    "meaning": "토끼를 발견한 후 사냥개를 놓아서 잡아도 늦지 않음"
  },
  {
    "id": "idiom-60699cba84d8",
    "word": "견토지쟁",
    "hanja": "犬兎之爭",
    "meaning": "개와 토끼가 쫓고 쫓기다가 둘이 다 지쳐 죽어 제삼자가 이익을 보게 됨. (=漁父之利)"
  },
  {
    "id": "idiom-ea557fe4e9b7",
    "word": "결가부좌",
    "hanja": "結跏趺坐",
    "meaning": "도사리고 앉음. 책상다리하고 앉음"
  },
  {
    "id": "idiom-4bdaf696e27b",
    "word": "결의형제",
    "hanja": "結義兄弟",
    "meaning": "남남끼리 형과 아우의 의를 맺음"
  },
  {
    "id": "idiom-e9a845754d70",
    "word": "결자해지",
    "hanja": "結者解之",
    "meaning": "일을 만든 사람이 그 일을 해결해야 함."
  },
  {
    "id": "idiom-9d62ac3db1a7",
    "word": "결초보은",
    "hanja": "結草報恩",
    "meaning": "죽어서라도 잊지 않고 은혜를 갚음."
  },
  {
    "id": "idiom-7785fe548c54",
    "word": "결효미수",
    "hanja": "缺效未遂",
    "meaning": "실행은 끝났으나 결과가 발생하지 아니함"
  },
  {
    "id": "idiom-fd1ded801e64",
    "word": "겸구고장",
    "hanja": "箝口枯腸",
    "meaning": "궁지에 몰리어 생각과 말이 막혀 대답을 못함"
  },
  {
    "id": "idiom-feee769b634f",
    "word": "겸노상전",
    "hanja": "兼奴上典",
    "meaning": "종이 할 일까지 손수 하는 가난한 양반"
  },
  {
    "id": "idiom-17815ceadbc5",
    "word": "겸양지덕",
    "hanja": "謙讓之德",
    "meaning": "겸손하고 사양하는 미덕"
  },
  {
    "id": "idiom-659ffcf88dbe",
    "word": "겸인지용",
    "hanja": "兼人之勇",
    "meaning": "몇 사람을 능히 당해낼 만한 용기"
  },
  {
    "id": "idiom-e25c6b3fa599",
    "word": "경거망동",
    "hanja": "輕擧妄動",
    "meaning": "깊이 생각하지 않고 가볍고 함부로 행동함."
  },
  {
    "id": "idiom-c9ac36ec02f9",
    "word": "경국제세",
    "hanja": "經國濟世",
    "meaning": "나라 일을 경륜하고 세상을 구제함 (經濟)"
  },
  {
    "id": "idiom-449d66734c78",
    "word": "경국지색",
    "hanja": "傾國之色",
    "meaning": "뛰어나게 아름다운 미인을 일컫는 말"
  },
  {
    "id": "idiom-a1dedb81ea05",
    "word": "경궁지조",
    "hanja": "驚弓之鳥",
    "meaning": "화살에 놀란 새라는 뜻으로 있던 자리에서 놀란 듯 후다닥 일어섬을 이르는 말"
  },
  {
    "id": "idiom-a571278e9016",
    "word": "경낙과신",
    "hanja": "輕諾寡信",
    "meaning": "무슨 일에나 승낙을 잘하는 사람은 믿음성이 적어 위약하기 쉽다는 말"
  },
  {
    "id": "idiom-9fc96f49d1e8",
    "word": "경당문노",
    "hanja": "耕當問奴",
    "meaning": "농사일은 머슴에게 물어야 한다. (일은 항상 그 부문의 전문가와 상의하여 행하여야 한다)"
  },
  {
    "id": "idiom-56b9cd282ad1",
    "word": "경로사상",
    "hanja": "敬老思想",
    "meaning": "노인을 공경하는 마음"
  },
  {
    "id": "idiom-3c66dd6e3d92",
    "word": "경묘탈쇄",
    "hanja": "輕妙脫灑",
    "meaning": "경쾌 미묘하여 범속의 기풍을 벗어난 용모"
  },
  {
    "id": "idiom-74cd48468712",
    "word": "경박재자",
    "hanja": "輕薄才子",
    "meaning": "재주는 있으나 경박한 사람"
  },
  {
    "id": "idiom-94b96d848d02",
    "word": "경산조수",
    "hanja": "耕山釣水",
    "meaning": "산에서 밭을 갈고 물에서 고기를 낚음. (속세를 떠나 산중에서 농사짓고 사는 것)"
  },
  {
    "id": "idiom-0756d98b3e60",
    "word": "경성지미",
    "hanja": "傾城之美",
    "meaning": "한 성을 기울어뜨릴 만한 미색"
  },
  {
    "id": "idiom-683f9dd7abf6",
    "word": "경세제민",
    "hanja": "經世濟民",
    "meaning": "세상을 다스리고 백성을 구제함"
  },
  {
    "id": "idiom-c84dfbb16748",
    "word": "경시호탈",
    "hanja": "輕施好奪",
    "meaning": "제 것을 남에게 가볍게 주는 사람은 무턱대고 남의 것을 탐낸다는 말"
  },
  {
    "id": "idiom-b8b09abf9bdd",
    "word": "경이원지",
    "hanja": "敬而遠之",
    "meaning": "겉으로는 공경하는 체 하면서 속으로는 멀리함"
  },
  {
    "id": "idiom-17b264dc7805",
    "word": "경이직내",
    "hanja": "敬以直內",
    "meaning": "공경으로써 마음을 바로잡음"
  },
  {
    "id": "idiom-55994fbf50a1",
    "word": "경자유전",
    "hanja": "耕者有田",
    "meaning": "경작자가 밭을 소유한다"
  },
  {
    "id": "idiom-e3385de9508e",
    "word": "경적필패",
    "hanja": "輕敵必敗",
    "meaning": "적을 가볍게 보면 반드시 패배함"
  },
  {
    "id": "idiom-0fc68819099e",
    "word": "경전하사",
    "hanja": "鯨戰蝦死",
    "meaning": "고래 싸움에 새우등 터진다. (=間於齊楚)"
  },
  {
    "id": "idiom-6f1f521c0d09",
    "word": "경조부박",
    "hanja": "輕佻浮薄",
    "meaning": "마음이 침착하지 못하고 행동이 신중하지 못함을 말한다"
  },
  {
    "id": "idiom-1607bcfeb712",
    "word": "경죽서난",
    "hanja": "罄竹書難",
    "meaning": "대나무가 종이 역할을 했는데 오나라와 월나라가 나쁜 일을 많이 해서 기록하는데 어려움이 많았다"
  },
  {
    "id": "idiom-102ddf89c866",
    "word": "경천근민",
    "hanja": "敬天勤民",
    "meaning": "하느님을 공경하고 백성을 다스리기에 부지런함"
  },
  {
    "id": "idiom-02dc32a67cff",
    "word": "경천동지",
    "hanja": "驚天動地",
    "meaning": "하늘이 놀라고 땅이 흔들린다는 뜻으로, 세상을 깜짝 놀라게 함"
  },
  {
    "id": "idiom-8225f8b16d86",
    "word": "경천애인",
    "hanja": "敬天愛人",
    "meaning": "하늘을 공경하고 사람을 사랑함"
  },
  {
    "id": "idiom-af3e0d73e5cb",
    "word": "경천위지",
    "hanja": "經天緯地",
    "meaning": "온 천하를 경륜하여 다스림"
  },
  {
    "id": "idiom-56fc233a5938",
    "word": "경호연역",
    "hanja": "更互演繹",
    "meaning": "갑을 쌍방의 이론을 듣고 대조하여 늘이고 넓히어 설명하는 것"
  },
  {
    "id": "idiom-01cf8b8fc3c0",
    "word": "경화수월",
    "hanja": "鏡花水月",
    "meaning": "거울에 비친 꽃과 물에 비친 달 (볼 수만 있고 가질 수 없는 것)"
  },
  {
    "id": "idiom-aad7509af1d7",
    "word": "계구우후",
    "hanja": "鷄口牛後",
    "meaning": "큰 집단의 말석보다 작은 집단의 우두머리가 나음"
  },
  {
    "id": "idiom-e5c8fd4a7ee9",
    "word": "계군일학",
    "hanja": "鷄群一鶴",
    "meaning": "범용한 사람 가운데 뛰어난 한 사람"
  },
  {
    "id": "idiom-c75783c2a6d9",
    "word": "계궁역진",
    "hanja": "計窮力盡",
    "meaning": "꾀와 힘이 다하여 더 이상 어찌할 방도가 없음"
  },
  {
    "id": "idiom-96f8529e5b6c",
    "word": "계돈동사",
    "hanja": "鷄豚同社",
    "meaning": "닭과 돼지가 함께 모인다는 뜻 (일향 사람이 계를 이룸.)"
  },
  {
    "id": "idiom-0b52bf75b489",
    "word": "계란유골",
    "hanja": "鷄卵有骨",
    "meaning": "달걀에도 뼈가 있다는 뜻 (일이 방해됨을 이르는 말)"
  },
  {
    "id": "idiom-180d3bbb449c",
    "word": "계명구도",
    "hanja": "鷄鳴狗盜",
    "meaning": "작은 재주가 뜻밖에 큰 구실을 함"
  },
  {
    "id": "idiom-35787cc1d12b",
    "word": "계명구폐",
    "hanja": "鷄鳴狗吠",
    "meaning": "닭이 울고 개가 짖는다. (=鷄鳴狗吠相聞)"
  },
  {
    "id": "idiom-ec8410518d42",
    "word": "계명지조",
    "hanja": "鷄鳴之助",
    "meaning": "임금을 받드는 현명한 후비의 내조를 이름"
  },
  {
    "id": "idiom-75bdacc0fc8f",
    "word": "계신공구",
    "hanja": "戒愼恐懼",
    "meaning": "경계하고 삼가하며 두려워함"
  },
  {
    "id": "idiom-45462f172c06",
    "word": "계옥지탄",
    "hanja": "桂玉之歎",
    "meaning": "식량 구하기가 계수나무 구하듯이 어렵다 (물가가 너무 비싼 것을 탄식한다는 뜻도 있음)"
  },
  {
    "id": "idiom-8e3e87a16df3",
    "word": "계주생면",
    "hanja": "契酒生面",
    "meaning": "남의 물건으로 자기가 생색을 냄"
  },
  {
    "id": "idiom-9f1841322ccf",
    "word": "계찰괘검",
    "hanja": "季札掛劍",
    "meaning": "신의를 중히 여김"
  },
  {
    "id": "idiom-2c7357de63e4",
    "word": "계총납모",
    "hanja": "啓寵納侮",
    "meaning": "사람 사랑하기를 본분에 지나치면 도리어 업신여김을 받음"
  },
  {
    "id": "idiom-4b1d47ac1456",
    "word": "계포일락",
    "hanja": "季布一諾",
    "meaning": "한번 한 약속은 지킴"
  },
  {
    "id": "idiom-3aa9ac135a95",
    "word": "계피학발",
    "hanja": "鷄皮鶴髮",
    "meaning": "사람이 늙어서 피부는 닭의 살갗과 같이 되고 머리는 세어 학의 날개처럼 희어졌다는 말"
  },
  {
    "id": "idiom-eb668abad7c6",
    "word": "고고지성",
    "hanja": "呱呱之聲",
    "meaning": "아이가 처음 나면서 우는 소리"
  },
  {
    "id": "idiom-978a099ce81f",
    "word": "고곡주랑",
    "hanja": "顧曲周郞",
    "meaning": "음악에 조예가 깊었던 주유의 관련 고사. 고곡이란 음악을 감상하는 것을 말한다"
  },
  {
    "id": "idiom-a572ce07bd96",
    "word": "고관대작",
    "hanja": "高官大爵",
    "meaning": "지위가 높은 큰 벼슬자리. 또는, 그 직위에 있는 사람"
  },
  {
    "id": "idiom-d11148bd3fbc",
    "word": "고굉지신",
    "hanja": "股肱之臣",
    "meaning": "임금이 가장 믿고 중히 여기는 신하"
  },
  {
    "id": "idiom-c5d8a7ecc414",
    "word": "고군분투",
    "hanja": "孤軍奮鬪",
    "meaning": "수가 적고 후원 없는 외로운 군대가 힘겨운 적과 싸움. 또는, 홀로 여럿을 상대로 싸움"
  },
  {
    "id": "idiom-5ee81c4a815b",
    "word": "고금독보",
    "hanja": "古今獨步",
    "meaning": "예나 현재를 통하여 그와 견줄 만한 사람이 없음"
  },
  {
    "id": "idiom-096fbf7734de",
    "word": "고금동서",
    "hanja": "古今東西",
    "meaning": "예와 지금, 동양과 서양. 때와 지역을 통틀어 일컫는 말"
  },
  {
    "id": "idiom-0dcd3df9e6df",
    "word": "고담준론",
    "hanja": "高談峻論",
    "meaning": "고상하고 준엄한 언론"
  },
  {
    "id": "idiom-427a144d9b85",
    "word": "고대광실",
    "hanja": "高臺廣室",
    "meaning": "굉장히 크고 좋은 집"
  },
  {
    "id": "idiom-47a310ee118f",
    "word": "고두사죄",
    "hanja": "叩頭謝罪",
    "meaning": "머리를 조아려 사죄함"
  },
  {
    "id": "idiom-4f5b22c0f508",
    "word": "고량진미",
    "hanja": "膏粱珍味",
    "meaning": "기름진 고기와 좋은 곡식으로 만든 맛있는 음식"
  },
  {
    "id": "idiom-ab50f377e426",
    "word": "고리정분",
    "hanja": "藁履丁粉",
    "meaning": "짚신에 분을 바르는 것처럼 일이 격식에 맞지 않음"
  },
  {
    "id": "idiom-02fd1eb039d4",
    "word": "고립무원",
    "hanja": "孤立無援",
    "meaning": "고립되어 도움을 받을 데가 없음"
  },
  {
    "id": "idiom-04df79cf1d37",
    "word": "고립무의",
    "hanja": "孤立無依",
    "meaning": "외롭고 의지할 때가 없음"
  },
  {
    "id": "idiom-ce474b7648d0",
    "word": "고망착호",
    "hanja": "藁網捉虎",
    "meaning": "새끼를 가지고 호랑이를 잡는다는 말. (어리석은 계책으로 뜻밖에 큰일을 이룸을 뜻함)"
  },
  {
    "id": "idiom-85ae52c60144",
    "word": "고목사회",
    "hanja": "枯木死灰",
    "meaning": "외형은 마른나무와 같고 마음은 죽은 재와 같이 되어 생기가 없음의 비유"
  },
  {
    "id": "idiom-ba7c393b7d15",
    "word": "고목생화",
    "hanja": "枯木生花",
    "meaning": "마른나무에서 꽃이 핀다는 뜻으로, 곤궁한 사람이 뜻밖의 행운을 만나게 됨의 비유"
  },
  {
    "id": "idiom-f066324b3ced",
    "word": "고복격양",
    "hanja": "鼓腹擊壤",
    "meaning": "태평세월임을 표현한 말. 배를 두들기면서 땅을 침"
  },
  {
    "id": "idiom-dbdf56211720",
    "word": "고분지통",
    "hanja": "叩盆之痛",
    "meaning": "분을 두들긴 쓰라림이라 함이니 아내가 죽은 슬픔을 말함"
  },
  {
    "id": "idiom-6e911f917883",
    "word": "고사성어",
    "hanja": "故事成語",
    "meaning": "옛날 있었던 일에서 만들어진 語句"
  },
  {
    "id": "idiom-4753f8f9c2d5",
    "word": "고산유수",
    "hanja": "高山流水",
    "meaning": "높은 산과 흐르는 물"
  },
  {
    "id": "idiom-e49209375cee",
    "word": "고색창연",
    "hanja": "古色蒼然",
    "meaning": "오래되어 옛날의 풍치가 저절로 들어나 보이는 모양"
  },
  {
    "id": "idiom-12c0cf5e1dc4",
    "word": "고성낙일",
    "hanja": "孤城落日",
    "meaning": "외로운 성에 지는 해란 뜻으로, 세력이 다하여 의지할 데가 없는 외로운 처지를 비유한 말"
  },
  {
    "id": "idiom-cf5860ebf7e9",
    "word": "고성방가",
    "hanja": "高聲放歌",
    "meaning": "큰소리로 떠들고 마구 노래 부름"
  },
  {
    "id": "idiom-e8065c6ef1f9",
    "word": "고식지계",
    "hanja": "姑息之計",
    "meaning": "당장의 편안함만을 꾀하는 일시적인 방편"
  },
  {
    "id": "idiom-5fbdb117ac79",
    "word": "고신원루",
    "hanja": "孤臣寃淚",
    "meaning": "외로운 신하의 원통한 눈물"
  },
  {
    "id": "idiom-0e96afae7579",
    "word": "고신척영",
    "hanja": "孤身隻影",
    "meaning": "외로운 몸과 그 몸의 그림자 하나뿐. 붙일 곳 없이 떠도는 외로운 신세라는 뜻이다"
  },
  {
    "id": "idiom-2189d79750a0",
    "word": "고어지사",
    "hanja": "枯魚之肆",
    "meaning": "목마른 고기의 어물전이라는 말로, 매우 곤궁한 처지를 비유한다"
  },
  {
    "id": "idiom-7501eaf6008f",
    "word": "고육지계",
    "hanja": "苦肉之計",
    "meaning": "어려운 사태를 벗어나기 위한 수단으로 제 몸을 괴롭혀 가면서까지 짜내는 계책"
  },
  {
    "id": "idiom-a2fe914e7eca",
    "word": "고장난명",
    "hanja": "孤掌難鳴",
    "meaning": "손뼉도 마주쳐야 된다. 혼자서 할 수 없고 협력해야 일이 이루어짐"
  },
  {
    "id": "idiom-328a29b195b9",
    "word": "고주일척",
    "hanja": "孤注一擲",
    "meaning": "노름꾼이 노름에 계속하여 잃을 때 최후에 나머지 돈을 다 걸고 모험을 하는 일"
  },
  {
    "id": "idiom-782d19dd20c9",
    "word": "고진감래",
    "hanja": "苦盡甘來",
    "meaning": "고생이 끝나면 즐거운 때가 옴."
  },
  {
    "id": "idiom-45851d22df54",
    "word": "고침안면",
    "hanja": "高枕安眠",
    "meaning": "근심 없이 편히 전잠, 안심할 수 있는 상태"
  },
  {
    "id": "idiom-10783c57583e",
    "word": "고침이와",
    "hanja": "高枕而臥",
    "meaning": "베개를 높이하고 잠. 마음 편안히 잠잘 수 있음"
  },
  {
    "id": "idiom-400e0902e213",
    "word": "고황지질",
    "hanja": "膏肓之疾",
    "meaning": "고칠 수 없이 깊이 든 병. (膏는心臟의 아래 肓은橫隔膜과 心臟의 사이)"
  },
  {
    "id": "idiom-9e9e8b7bdfb6",
    "word": "곡격견마",
    "hanja": "轂擊肩摩",
    "meaning": "수레의 바퀴통이 부딪치고 어깨가 스침. 곧 市街가 번화한 모습을 형용하는 말이다"
  },
  {
    "id": "idiom-d186aaa77456",
    "word": "곡고화과",
    "hanja": "曲高和寡",
    "meaning": "곡이 높으면 화답하는 사람이 적다는 뜻으로, 재능이 너무 높으면 따르는 무리들이 더욱 적다"
  },
  {
    "id": "idiom-feaacecd67b2",
    "word": "곡굉지락",
    "hanja": "曲肱之樂",
    "meaning": "팔을 베개 삼아 누워 사는 가난한 생활이라도 도에 살면 그 속에 즐거움이 있다는 말"
  },
  {
    "id": "idiom-becea4d3f16e",
    "word": "곡돌사신",
    "hanja": "曲突徙薪",
    "meaning": "火災를 예방하기 위하여 굴뚝을 꼬불꼬불하게 만들고 아궁이 근처의 나무를 딴 곳으로 옮긴다"
  },
  {
    "id": "idiom-807579a3ee4f",
    "word": "곡학아세",
    "hanja": "曲學阿世",
    "meaning": "학문을 왜곡하여 세속에 아부함"
  },
  {
    "id": "idiom-40f01b8ec7f4",
    "word": "곤궁이통",
    "hanja": "困窮而通",
    "meaning": "손 쓸 도리가 없는 지경에 이르게 되면 오히려 활로가 생긴다는 뜻"
  },
  {
    "id": "idiom-78bf30b5aa58",
    "word": "곤수유투",
    "hanja": "困獸猶鬪",
    "meaning": "위급한 경우에는 짐승일지라도 적을 향해 싸우려 덤빔. (=窮鼠囓猫)"
  },
  {
    "id": "idiom-bf4c3236fc18",
    "word": "골몰무가",
    "hanja": "汨沒無暇",
    "meaning": "일에 골몰하여 틈이 조금도 없음"
  },
  {
    "id": "idiom-655257052d12",
    "word": "골육상잔",
    "hanja": "骨肉相殘",
    "meaning": "부자나 형제 또는 같은 민족간에 서로 싸움"
  },
  {
    "id": "idiom-878a6f4cd653",
    "word": "골육상쟁",
    "hanja": "骨肉相爭",
    "meaning": "뼈와 살이 서로 싸운다는 말로, 동족끼리 서로 싸움을 비유함"
  },
  {
    "id": "idiom-9478adea0e37",
    "word": "골육지친",
    "hanja": "骨肉之親",
    "meaning": "부모·자식·형제·자매 등의 가까운 혈족"
  },
  {
    "id": "idiom-01af3edbfbe7",
    "word": "공경대부",
    "hanja": "公卿大夫",
    "meaning": "조선시대 삼공과 구경대부를 통틀어 일컬음 그 뒤 뜻이 바뀌어 벼슬이 높은 사람들을 지칭"
  },
  {
    "id": "idiom-3e9c34bac1b7",
    "word": "공곡공음",
    "hanja": "空谷跫音",
    "meaning": "빈 골짜기의 발자국 소리. 몹시 신기한 일, 뜻밖의 기쁨, 반가운 소식 등을 의미한다"
  },
  {
    "id": "idiom-63fd22077128",
    "word": "공리공론",
    "hanja": "空理空論",
    "meaning": "헛된 이치와 논의란 뜻으로, 사실에 맞지 않은 이론과 실제와 동떨어진 논의"
  },
  {
    "id": "idiom-5d0bd5ee984d",
    "word": "공명정대",
    "hanja": "公明正大",
    "meaning": "마음이 공평하고 사심이 없으며 밝고 큼"
  },
  {
    "id": "idiom-a9de557bafe5",
    "word": "공서양속",
    "hanja": "公序良俗",
    "meaning": "공공의 질서와 선량한 풍속"
  },
  {
    "id": "idiom-a0e6e777ab42",
    "word": "공언무시",
    "hanja": "空言無施",
    "meaning": "빈말만 하고 실천이 따르지 아니함"
  },
  {
    "id": "idiom-9321063fe560",
    "word": "공자천주",
    "hanja": "孔子穿珠",
    "meaning": "공자가 구슬을 꿴다. 즉 자기보다 못한 사람에게 모르는 것을 묻는 것이 부끄러운 일이 아님"
  },
  {
    "id": "idiom-adfbf96e3c07",
    "word": "공전절후",
    "hanja": "空前絶後",
    "meaning": "비교할 만한 것이 이전에도 없고 이후에도 없음"
  },
  {
    "id": "idiom-7fe542bf005a",
    "word": "공존공영",
    "hanja": "共存共榮",
    "meaning": "함께 살고 함께 번영함 함께 잘 살아감"
  },
  {
    "id": "idiom-c11e841e9c6e",
    "word": "공중누각",
    "hanja": "空中樓閣",
    "meaning": "내용이 없는 문장이나 쓸데없는 의론"
  },
  {
    "id": "idiom-07ce5bc45823",
    "word": "공평무사",
    "hanja": "公平無私",
    "meaning": "공변되고 평평하여 사사로움이 없음"
  },
  {
    "id": "idiom-e0e2e1292421",
    "word": "공휴일궤",
    "hanja": "功虧一簣",
    "meaning": "조금만 더 계속하면 목적을 달성 할 수 있는데 중단했기 때문에 지금까지 애쓴 것이 허사가 됨"
  },
  {
    "id": "idiom-befaa1a55ed1",
    "word": "과공비례",
    "hanja": "過恭非禮",
    "meaning": "지나친 공손은 오히려 예의에 벗어남"
  },
  {
    "id": "idiom-b96f0d92f997",
    "word": "과대망상",
    "hanja": "誇大妄想",
    "meaning": "턱없이 과장하여 그것을 믿는 망령된 생각"
  },
  {
    "id": "idiom-c1569fe91222",
    "word": "과여불급",
    "hanja": "過如不及",
    "meaning": "지나친 것은 미치지 못함과 같음"
  },
  {
    "id": "idiom-4ee7d3a3cc7e",
    "word": "과유불급",
    "hanja": "過猶不及",
    "meaning": "정도를 넘는 것은 모자란 것과 마찬가지임."
  },
  {
    "id": "idiom-f435ab48533d",
    "word": "과이불개",
    "hanja": "過而不改",
    "meaning": "잘못하고서 고치지 않는 것"
  },
  {
    "id": "idiom-84f4948371aa",
    "word": "과전이하",
    "hanja": "瓜田李下",
    "meaning": "의심받을 행동을 하지 말라 (=瓜田不納履)"
  },
  {
    "id": "idiom-337975920146",
    "word": "과혁지시",
    "hanja": "裹革之屍",
    "meaning": "말가죽에 싼 시체라는 뜻으로 전쟁에서 싸우다 죽은 시체를 말함"
  },
  {
    "id": "idiom-a3f25ec9c9f0",
    "word": "관공삼약",
    "hanja": "關公三約",
    "meaning": "관우가 하비에서 조조에게 포위되고는, 그의 투항 제의를 승낙하면서 내세운 세 가지 조건"
  },
  {
    "id": "idiom-1f00e42b2ba2",
    "word": "관인대도",
    "hanja": "寬仁大度",
    "meaning": "마음이 너그럽고 인자하며 도량이 넓음"
  },
  {
    "id": "idiom-8eca10fbd9f7",
    "word": "관존민비",
    "hanja": "官尊民卑",
    "meaning": "관리는 높고 귀하며, 백성은 낮고 천하다는 사고방식"
  },
  {
    "id": "idiom-84a06dd711cf",
    "word": "관중규표",
    "hanja": "管中窺豹",
    "meaning": "대롱 속으로 표범을 엿본다는 말로, 시야가 매우 좁음을 뜻한다"
  },
  {
    "id": "idiom-60e926fbaeaf",
    "word": "관중지천",
    "hanja": "管中之天",
    "meaning": "대롱 구멍으로 하늘을 보다. 소견이 좁은 것"
  },
  {
    "id": "idiom-762700806998",
    "word": "관포지교",
    "hanja": "管鮑之交",
    "meaning": "서로를 깊이 이해하고 믿는 두터운 우정."
  },
  {
    "id": "idiom-5e196c27cc30",
    "word": "관홍뇌락",
    "hanja": "寬弘磊落",
    "meaning": "마음이 너그럽고 활달하여 작은 일에 구애되지 아니함"
  },
  {
    "id": "idiom-8316f43fa36b",
    "word": "괄목상대",
    "hanja": "刮目相對",
    "meaning": "남의 학식이나 재주가 갑자기 느는 것을 보어 인식을 새롭게 함"
  },
  {
    "id": "idiom-12a2e020188e",
    "word": "광관지자",
    "hanja": "曠官知者",
    "meaning": "관리가 직무를 게을리 하여 받는 비난"
  },
  {
    "id": "idiom-1643c7a43257",
    "word": "광대무변",
    "hanja": "廣大無邊",
    "meaning": "한없이 넓고 커서 끝이 없음"
  },
  {
    "id": "idiom-e3724799ec3c",
    "word": "광음여류",
    "hanja": "光陰如流",
    "meaning": "세월이 흐르는 물과 같이 빠름"
  },
  {
    "id": "idiom-f88192a722b1",
    "word": "광일미구",
    "hanja": "曠日彌久",
    "meaning": "오랫동안 쓸데없이 세월만 보냄"
  },
  {
    "id": "idiom-1083337179b2",
    "word": "광일지구",
    "hanja": "曠日持久",
    "meaning": "세월을 헛되이 오랫동안 보낸다. (헛되이 세월만 지났다는 말로 쓰인다.)"
  },
  {
    "id": "idiom-776a020e8ba4",
    "word": "광풍제월",
    "hanja": "光風霽月",
    "meaning": "맑은 날의 바람과 갠 날의 달이라는 말로, 사람의 심성이 맑고 깨끗하거나 그런 사람을 비유"
  },
  {
    "id": "idiom-0f74e2bf3236",
    "word": "교각살우",
    "hanja": "矯角殺牛",
    "meaning": "작은 흠을 고치려다 중요한 것까지 망침."
  },
  {
    "id": "idiom-d12c7bf49da6",
    "word": "교룡득수",
    "hanja": "蛟龍得水",
    "meaning": "교룡이 물을 얻는다는 말로, 좋은 기회를 얻는 것을 비유한다"
  },
  {
    "id": "idiom-a239f10ec5e5",
    "word": "교발기중",
    "hanja": "巧發奇中",
    "meaning": "때에 따라 던진 말이 (교묘하게) 신기하게 들어맞는 것"
  },
  {
    "id": "idiom-8d0866029d5f",
    "word": "교병필패",
    "hanja": "驕兵必敗",
    "meaning": "자기 군대의 힘만 믿고 교만하여 적에게 위엄을 보이려는 병정은 적의 군대에게 반드시 패한다"
  },
  {
    "id": "idiom-c81173010791",
    "word": "교언영색",
    "hanja": "巧言令色",
    "meaning": "교묘한 말과 아첨하는 얼굴빛"
  },
  {
    "id": "idiom-2087e26e53c4",
    "word": "교왕과정",
    "hanja": "矯枉過正",
    "meaning": "잘못을 바로 고치려다 지나쳐 오히려 나쁜 결과를 가져옴을 의미한다. (=矯枉過直)"
  },
  {
    "id": "idiom-8077cfe3e8a4",
    "word": "교외별전",
    "hanja": "敎外別傳",
    "meaning": "마음에서 마음으로 전함. (=以心傳心)"
  },
  {
    "id": "idiom-61f99089663c",
    "word": "교우이신",
    "hanja": "交友以信",
    "meaning": "믿음으로써 벗을 사귐"
  },
  {
    "id": "idiom-444c273d0653",
    "word": "교자채신",
    "hanja": "敎子採薪",
    "meaning": "자식에게 나무 하는 법을 가르치라는 뜻으로 장기적인 안목을 갖고 근본적인 처방에 힘쓰라"
  },
  {
    "id": "idiom-9325b7c82eca",
    "word": "교주고슬",
    "hanja": "膠柱鼓瑟",
    "meaning": "거문고 기둥을 아교로 붙여놓고 거문고를 연주함. 즉 고지식하여 융통성이 없다는 뜻"
  },
  {
    "id": "idiom-50ee6e084436",
    "word": "교천언심",
    "hanja": "交淺言深",
    "meaning": "교제한지는 얼마 안 되지만 말은 깊음 (서로 심중을 털어 놓고 이야기 함.)"
  },
  {
    "id": "idiom-44cddf90e27e",
    "word": "교취호탈",
    "hanja": "巧取豪奪",
    "meaning": "교묘한 수단으로 빼앗음, 정당하지 않은 방법에 의해 남의 귀중한 물건을 가로채는 것을 비유"
  },
  {
    "id": "idiom-d0058c840920",
    "word": "교칠지교",
    "hanja": "膠漆之交",
    "meaning": "아교와 칠의 사귐이니 퍽 사이가 친하고 두터움. (=膠漆之心)"
  },
  {
    "id": "idiom-b8fb7d415ba0",
    "word": "교토삼굴",
    "hanja": "狡兎三窟",
    "meaning": "토끼가 살아남을 수 있는 것은 숨을 굴을 셋이나 가지고 있기 때문이다"
  },
  {
    "id": "idiom-870992d7da2e",
    "word": "교학상장",
    "hanja": "敎學相長",
    "meaning": "가르치고 배우면 서로가 성장한다"
  },
  {
    "id": "idiom-d7d15ba93acf",
    "word": "구거작소",
    "hanja": "鳩居鵲巢",
    "meaning": "비둘기가 까치집에 들어 산다. 아내가 남편의 집을 자기 집으로 삼는데 비유"
  },
  {
    "id": "idiom-5ab8a46337ee",
    "word": "구곡간장",
    "hanja": "九曲肝腸",
    "meaning": "굽이굽이 사무친 마음속"
  },
  {
    "id": "idiom-fe8c7df952fa",
    "word": "구관명관",
    "hanja": "舊官名官",
    "meaning": "먼저 있었던 관리가 더 훌륭한 관리라는 뜻 오랜 경험이 있는 구관이 일 처리를 잘 한다"
  },
  {
    "id": "idiom-815da3e5d518",
    "word": "구국간성",
    "hanja": "救國干城",
    "meaning": "나라를 구하여 지키는 믿음직한 군인이나 인물"
  },
  {
    "id": "idiom-bc435bbb35ec",
    "word": "구로지은",
    "hanja": "劬勞之恩",
    "meaning": "자기를 낳아 길러준 부모의 은혜"
  },
  {
    "id": "idiom-6195014ae864",
    "word": "구맹주산",
    "hanja": "狗猛酒酸",
    "meaning": "개가 사나우면 술이 시어진다. 한 나라에 간신배가 있으면 어진 신하가 모이지 않음"
  },
  {
    "id": "idiom-9294eaed3b71",
    "word": "구명도생",
    "hanja": "苟命徒生",
    "meaning": "구차스럽게 목숨만 보전함"
  },
  {
    "id": "idiom-cf7a15d68ed0",
    "word": "구미속초",
    "hanja": "狗尾續貂",
    "meaning": "담비의 꼬리가 모자라 개의 꼬리로 잇는다. 훌륭한 것 뒤에 보잘것없는 것이 잇따름"
  },
  {
    "id": "idiom-ed8d7c2c6b41",
    "word": "구밀복검",
    "hanja": "口蜜腹劍",
    "meaning": "입으로는 좋은 말을 하지만 속으로는 해칠 생각을 함"
  },
  {
    "id": "idiom-6a1004c71643",
    "word": "구반문촉",
    "hanja": "扣槃捫燭",
    "meaning": "어떤 사실을 정확히 파악하지 못하고 오해하는 것을 비유한다"
  },
  {
    "id": "idiom-0d4a500d8f3a",
    "word": "구복원수",
    "hanja": "口腹寃讐",
    "meaning": "목구멍이 포도청. 살아가기 위해서 아니꼬운, 괴로운 일을 당할 때"
  },
  {
    "id": "idiom-d03cbcd1119c",
    "word": "구복지루",
    "hanja": "口腹之累",
    "meaning": "먹고사는 데 대한 걱정"
  },
  {
    "id": "idiom-049c8c1c5b42",
    "word": "구부득고",
    "hanja": "求不得苦",
    "meaning": "불교에서 말하는 八苦의 하나로 구하려 해도 얻지 못하는 苦痛"
  },
  {
    "id": "idiom-04a171a78865",
    "word": "구사불첨",
    "hanja": "救死不瞻",
    "meaning": "곤란이 극심하여 다른 일을 돌볼 겨를이 없음"
  },
  {
    "id": "idiom-cbc02e9acee6",
    "word": "구사일생",
    "hanja": "九死一生",
    "meaning": "여러 차례 죽을 고비를 넘기고 겨우 살아남음."
  },
  {
    "id": "idiom-d5444aa422fb",
    "word": "구상유취",
    "hanja": "口尙乳臭",
    "meaning": "입에서 아직 젖내가 난다는 뜻으로, 언어와 행동이 매우 유치함을 일컬음"
  },
  {
    "id": "idiom-9443782c414a",
    "word": "구수회의",
    "hanja": "鳩首會議",
    "meaning": "비둘기 머리 내밀 듯 머리를 맞대고 하는 회의"
  },
  {
    "id": "idiom-e15601c187b5",
    "word": "구십춘광",
    "hanja": "九十春光",
    "meaning": "노인의 마음이 청년같이 젊음을 이름"
  },
  {
    "id": "idiom-cd30dc700ade",
    "word": "구안투생",
    "hanja": "苟安偸生",
    "meaning": "한때의 편안을 꾀하여 헛되이 살아감"
  },
  {
    "id": "idiom-658b6274c573",
    "word": "구약현하",
    "hanja": "口若懸河",
    "meaning": "입에서 나오는 말이 경사가 급하여 쏜살같이 흐르는 강과 같다는 말로, 말을 끊지 않음"
  },
  {
    "id": "idiom-9c81af721a44",
    "word": "구여현하",
    "hanja": "口如懸河",
    "meaning": "입이 급히 흐르는 물과 같다. 거침없이 말을 잘하는 것"
  },
  {
    "id": "idiom-f503ed9e3238",
    "word": "구우일모",
    "hanja": "九牛一毛",
    "meaning": "아주 큰 물건 속에 있는 아주 작은 물건"
  },
  {
    "id": "idiom-2e5af7a7f30a",
    "word": "구이지학",
    "hanja": "口耳之學",
    "meaning": "남에게 들은 것을 그대로 남에게 전할 정도밖에 되지 않는 천박한 학문"
  },
  {
    "id": "idiom-152176549452",
    "word": "구인득인",
    "hanja": "救仁得仁",
    "meaning": "인을 구하여 인을 얻었다는 말로, 자신이 원하거나 갈망하던 것을 얻었음을 뜻한다"
  },
  {
    "id": "idiom-180c091bb9ec",
    "word": "구전문사",
    "hanja": "求田問舍",
    "meaning": "국가 대사에는 뜻이 없고 자기 목전의 이익에만 마음을 씀"
  },
  {
    "id": "idiom-2d516229a288",
    "word": "구절양장",
    "hanja": "九折羊腸",
    "meaning": "아홉 번 꺾인 양의 창자, 꼬불꼬불하고 험한 산길"
  },
  {
    "id": "idiom-ba160a9593fc",
    "word": "구족제철",
    "hanja": "狗足啼鐵",
    "meaning": "개발에 편자라는 뜻으로 옷차림이나 소지품이 주제에 맞지 않게 과분함"
  },
  {
    "id": "idiom-72d4dcd8f13b",
    "word": "구중심처",
    "hanja": "九重深處",
    "meaning": "궁궐을 가리킴"
  },
  {
    "id": "idiom-a3b7bb82730f",
    "word": "구화지문",
    "hanja": "口禍之門",
    "meaning": "입은 재앙을 불러들이는 문이다"
  },
  {
    "id": "idiom-22a5f500028e",
    "word": "구화투신",
    "hanja": "救火投薪",
    "meaning": "불을 끄는 데 장작을 집어넣는다는 뜻 성급히 행동하다가 도리어 해를 크게 함을 비유"
  },
  {
    "id": "idiom-de0cb76e7f1a",
    "word": "국궁진췌",
    "hanja": "麴窮盡膵",
    "meaning": "몸이 부서질 때까지 노력함 (麴窮盡膵 死而後已원어)"
  },
  {
    "id": "idiom-9c0202370ac7",
    "word": "국리민복",
    "hanja": "國利民福",
    "meaning": "나라의 이익과 국민의 행복"
  },
  {
    "id": "idiom-8664f24c439d",
    "word": "국사무쌍",
    "hanja": "國士無雙",
    "meaning": "국내에서 가장 뛰어난 인물"
  },
  {
    "id": "idiom-389ba5a1a442",
    "word": "국태민안",
    "hanja": "國泰民安",
    "meaning": "나라가 태평하고 백성이 살기가 평안함"
  },
  {
    "id": "idiom-b2bdc1e8c975",
    "word": "군계일학",
    "hanja": "群鷄一鶴",
    "meaning": "많은 닭 가운데의 한 마리의 학. 곧 많은 사람들 중의 뛰어난 인물"
  },
  {
    "id": "idiom-d4476fe88b12",
    "word": "군령태산",
    "hanja": "軍令泰山",
    "meaning": "군대의 명령은 태산같이 무거움"
  },
  {
    "id": "idiom-d59f9586d83e",
    "word": "군맹무상",
    "hanja": "群盲撫象",
    "meaning": "보통사람의 식견이 좁음을 비유"
  },
  {
    "id": "idiom-47bc1f9177e5",
    "word": "군맹평상",
    "hanja": "群盲評象",
    "meaning": "여러 맹인이 코끼리를 평한다는 뜻으로 사물을 자신의 주관과 좋은 소견으로 그릇 판단을 함"
  },
  {
    "id": "idiom-6d81bd2e493f",
    "word": "군신유의",
    "hanja": "君臣有義",
    "meaning": "임금과 신하는 의가 있어야 한다"
  },
  {
    "id": "idiom-385fc7eb413c",
    "word": "군웅할거",
    "hanja": "群雄割據",
    "meaning": "많은 영웅들이 각지에 자리 잡고 서로 세력을 다툼"
  },
  {
    "id": "idiom-2b0869c765e8",
    "word": "군위신강",
    "hanja": "君爲臣綱",
    "meaning": "신하는 임금을 섬기는 것이 근본이다"
  },
  {
    "id": "idiom-442af1a10a80",
    "word": "군자무본",
    "hanja": "君子務本",
    "meaning": "군자는 근본에 힘쓴다"
  },
  {
    "id": "idiom-d5095208ec1e",
    "word": "군자불기",
    "hanja": "君子不器",
    "meaning": "군자는 일정한 용도로 쓰이는 그릇과 같은 것이 아니다, 군자는 두루 살피고 원만하다는 말"
  },
  {
    "id": "idiom-edd7915dacc4",
    "word": "군자삼락",
    "hanja": "君子三樂",
    "meaning": "부모 生存하고 형제가 무고한 것, 세상에 부끄러워 할 것이 없는 것, 영재를 얻어서 교육하는 것"
  },
  {
    "id": "idiom-e2b2b836d884",
    "word": "군자표변",
    "hanja": "君子豹變",
    "meaning": "군자의 언행은 표범의 무늬처럼 선명하게 변한다는 뜻 잘못을 깨달으면 곧바로 고침을 비유"
  },
  {
    "id": "idiom-dbb2b7e96e3a",
    "word": "굴묘편시",
    "hanja": "掘墓鞭屍",
    "meaning": "묘를 파헤쳐 시체에 매질을 한다는 뜻으로, 통쾌한 복수나 지나친 행동을 일컫는 말"
  },
  {
    "id": "idiom-4a1784b8b069",
    "word": "굴이불신",
    "hanja": "屈而不伸",
    "meaning": "굽히고는 펴지 아니함"
  },
  {
    "id": "idiom-9d612297bdba",
    "word": "궁구막추",
    "hanja": "窮寇莫追",
    "meaning": "궁한 도적을 쫓지 말라는 뜻. (歸師勿掩窮寇莫追원어)"
  },
  {
    "id": "idiom-b4d3303b14ff",
    "word": "궁년누세",
    "hanja": "窮年累世",
    "meaning": "궁년은 자기의 한 평생, 누세는 자손 대대, 즉 본인의 한 평생과 자손 대대란 말"
  },
  {
    "id": "idiom-126c831efa16",
    "word": "궁서설묘",
    "hanja": "窮鼠囓猫",
    "meaning": "궁지에 몰린 쥐가 고양이를 문다는 뜻 (=困獸猶鬪)"
  },
  {
    "id": "idiom-1d14629de162",
    "word": "궁여일책",
    "hanja": "窮餘一策",
    "meaning": "막다른 처지에서 짜내는 한 가지 계책"
  },
  {
    "id": "idiom-f81031784d78",
    "word": "궁여지책",
    "hanja": "窮餘之策",
    "meaning": "막다른 골목에서 그 국면을 타개하려고 생각다 못해 짜낸 꾀"
  },
  {
    "id": "idiom-f695c46eca5e",
    "word": "궁인모사",
    "hanja": "窮人謀事",
    "meaning": "운수가 궁한 사람이 꾸미는 일은 실패한다는 뜻으로 ‘일이 잘 이루어지지 않음’을 이르는 말"
  },
  {
    "id": "idiom-476f5f35f988",
    "word": "궁적상적",
    "hanja": "弓的相適",
    "meaning": "활과 과녁이 딱 들어맞듯이 하려는 일과 기회가 들어맞는다"
  },
  {
    "id": "idiom-1b3583caa5bf",
    "word": "궁절전진",
    "hanja": "弓折箭盡",
    "meaning": "활이 꺾이고 화살이 다 떨어지듯 더 이상 어떻게 해 볼 도리가 없다"
  },
  {
    "id": "idiom-f05567a5a42a",
    "word": "궁조입회",
    "hanja": "窮鳥入懷",
    "meaning": "쫓기던 새가 사람의 품안으로 날아든다는 뜻으로, 사람이 궁하면 적에게도 의지한다는 말"
  },
  {
    "id": "idiom-8c42b83f5bd9",
    "word": "권모술수",
    "hanja": "權謀術數",
    "meaning": "그때그때의 형편에 따라 변통성 있게 둘러대는 모략이나 수단"
  },
  {
    "id": "idiom-d398f63dbb52",
    "word": "권불십년",
    "hanja": "權不十年",
    "meaning": "권세는 십 년을 못 간다는 말. 권세가 오래 가지 못함을 이르는 말"
  },
  {
    "id": "idiom-283f32ce21ed",
    "word": "권상요목",
    "hanja": "勸上搖木",
    "meaning": "나무 위에 오르라 권하고는 오르자마자 아래서 흔들어 댐"
  },
  {
    "id": "idiom-9f867e3fc0dc",
    "word": "권선징악",
    "hanja": "勸善懲惡",
    "meaning": "착한 일은 권장하고 악한 일은 징계함"
  },
  {
    "id": "idiom-6b8716c514d0",
    "word": "권의지계",
    "hanja": "權宜之計",
    "meaning": "때와 장소에 맞는 대처 방법"
  },
  {
    "id": "idiom-5fd019805ce4",
    "word": "권토중래",
    "hanja": "捲土重來",
    "meaning": "한 번 패한 자가 힘을 돌이켜 전력을 다하여 다시 쳐들어옴"
  },
  {
    "id": "idiom-6fa9a710a8f7",
    "word": "귀곡천계",
    "hanja": "貴鵠賤鷄",
    "meaning": "먼 데 것을 귀하게 여기고 가까운 데 것을 천하게 여기는 것이人之常情임을 말함"
  },
  {
    "id": "idiom-ffb4c6da00b2",
    "word": "귀마방우",
    "hanja": "歸馬放牛",
    "meaning": "전쟁에 사용할 말과 소를 다시 쟁기나 수레를 끌게 함 전쟁이 끝나고 평화가 왔음을 의미함"
  },
  {
    "id": "idiom-1323e56136eb",
    "word": "귀배괄모",
    "hanja": "龜背刮毛",
    "meaning": "거북 등의 털을 벗겨 뜯는다. 없는 것을 애써 구하려고 하는 것을. 비유한다"
  },
  {
    "id": "idiom-75691a91b668",
    "word": "귀사물엄",
    "hanja": "歸師勿掩",
    "meaning": "물러나는 군사를 덮치지 말라 (歸師勿掩窮寇莫追원어)"
  },
  {
    "id": "idiom-eb7c8f9734d8",
    "word": "귀이천목",
    "hanja": "貴耳賤目",
    "meaning": "글자 그대로 귀를 귀하게 여기고 눈을 천하게 여긴다는 뜻"
  },
  {
    "id": "idiom-7bc47abbeaca",
    "word": "귤화위지",
    "hanja": "橘和爲枳",
    "meaning": "귤이 화수를 건너면 탱자가 된다"
  },
  {
    "id": "idiom-62d50078e419",
    "word": "극구광음",
    "hanja": "隙駒光陰",
    "meaning": "달리는 말을 문틈으로 보는 것과 같다는 뜻으로, 세월이 빨리 흐름을 뜻함"
  },
  {
    "id": "idiom-f8f4e4e24792",
    "word": "극기복례",
    "hanja": "克己復禮",
    "meaning": "자기의 욕심을 누르고 예의범절을 쫓음"
  },
  {
    "id": "idiom-365e4fb14cb8",
    "word": "극성즉패",
    "hanja": "極盛則敗",
    "meaning": "너무 성하면 얼마가지 못해 패망한다"
  },
  {
    "id": "idiom-9f4634df390d",
    "word": "근근득생",
    "hanja": "僅僅得生",
    "meaning": "겨우 살아감. 겨우겨우 삶을 이어 나감 (근근이 삶을 얻어 산다는 뜻)"
  },
  {
    "id": "idiom-f6f4c2eb942a",
    "word": "근근자자",
    "hanja": "勤勤孜孜",
    "meaning": "매우 부지런하고 정성스러움"
  },
  {
    "id": "idiom-7e779377cd0c",
    "word": "근묘화실",
    "hanja": "根苗花實",
    "meaning": "조상은 뿌리요, 자손은 그 열매라는 뜻"
  },
  {
    "id": "idiom-bb9a9ff4fbe4",
    "word": "근묵자흑",
    "hanja": "近墨者黑",
    "meaning": "악한 사람을 가까이 하면 그 버릇에 물들기 쉬움"
  },
  {
    "id": "idiom-9b8e64ab9311",
    "word": "근장보졸",
    "hanja": "勤將補拙",
    "meaning": "서투른 것을 보충하는 데에는 부지런함이 으뜸임을 뜻한다"
  },
  {
    "id": "idiom-b715ba0adcc3",
    "word": "금고일반",
    "hanja": "今古一般",
    "meaning": "지금이나 옛날이나 같다"
  },
  {
    "id": "idiom-6a270083a140",
    "word": "금과옥조",
    "hanja": "金科玉條",
    "meaning": "몹시 귀중한 법칙이나 규정"
  },
  {
    "id": "idiom-309603b3867b",
    "word": "금구무결",
    "hanja": "金甌無缺",
    "meaning": "금으로 만든 단지처럼 완전하고 결점이 없음"
  },
  {
    "id": "idiom-99c70d02247e",
    "word": "금란지계",
    "hanja": "金蘭之契",
    "meaning": "친구사이의 우의가 두터움"
  },
  {
    "id": "idiom-ef97df39b2db",
    "word": "금란지교",
    "hanja": "金蘭之交",
    "meaning": "금처럼 견고하고 난초처럼 향기로운 사귐. 견고한 벗 사이의 우정"
  },
  {
    "id": "idiom-aa419dc2e547",
    "word": "금미지취",
    "hanja": "金迷紙醉",
    "meaning": "지극히 사치스런 생활"
  },
  {
    "id": "idiom-ca804eaab60b",
    "word": "금상첨화",
    "hanja": "錦上添花",
    "meaning": "좋은 일에 또 좋은 일이 더해짐."
  },
  {
    "id": "idiom-bb27abfbd34b",
    "word": "금석뇌약",
    "hanja": "金石牢約",
    "meaning": "금과 돌 같은 굳은 언약. 서로 언약함이 매우 굳음을 비유"
  },
  {
    "id": "idiom-6d454e71a248",
    "word": "금석맹약",
    "hanja": "金石盟約",
    "meaning": "금과 돌같이 굳게 맹세해 맺은 약속"
  },
  {
    "id": "idiom-5b7688ab910c",
    "word": "금석지감",
    "hanja": "今昔之感",
    "meaning": "지금과 옛날을 비교할 때 차이가 매우 심하여 느껴지는 감정"
  },
  {
    "id": "idiom-19fe7fcda3cf",
    "word": "금석지교",
    "hanja": "金石之交",
    "meaning": "쇠와 돌처럼 변함없는 굳은 사귐"
  },
  {
    "id": "idiom-c229ebcce62b",
    "word": "금석지약",
    "hanja": "金石之約",
    "meaning": "쇠와 돌 같은 언약. 곧, 변함없고 굳은 언약"
  },
  {
    "id": "idiom-be8df627e95a",
    "word": "금석지전",
    "hanja": "金石之典",
    "meaning": "쇠나 돌처럼 굳고 변함없는 가치를 지닌 法典"
  },
  {
    "id": "idiom-f7b949dcc2e8",
    "word": "금설폐구",
    "hanja": "金舌蔽口",
    "meaning": "금으로 혀를 만들어 입을 가린다. 입을 꼭 다물고 말하지 아니함"
  },
  {
    "id": "idiom-602ab550d794",
    "word": "금성옥진",
    "hanja": "金聲玉振",
    "meaning": "사물을 집대성함. 지덕을 완비한 상태"
  },
  {
    "id": "idiom-0c1afbcc7d84",
    "word": "금성철벽",
    "hanja": "金城鐵壁",
    "meaning": "금으로 만든 성, 철로 된 벽. 매우 굳고 든든한 성"
  },
  {
    "id": "idiom-aa597743b0df",
    "word": "금성탕지",
    "hanja": "金城湯池",
    "meaning": "몹시 견고하고 끓는 물의 연못이 있어 가까이 가지 못하는 성. 즉 방비가 아주 견고한 성"
  },
  {
    "id": "idiom-ab0a19f743b8",
    "word": "금수지장",
    "hanja": "錦繡之腸",
    "meaning": "비단결같이 고운 마음씨를 이름. 아름다운 마음씨의 所有者"
  },
  {
    "id": "idiom-8420f13d8cce",
    "word": "금슬상화",
    "hanja": "琴瑟相和",
    "meaning": "거문고와 비파 소리가 조화를 잘 이룸을 비유한 말"
  },
  {
    "id": "idiom-6553cd3a7d01",
    "word": "금슬우지",
    "hanja": "琴瑟友之",
    "meaning": "부부간의 금슬이 좋아 마치 친구처럼 지내는 것"
  },
  {
    "id": "idiom-f2d74274bbbf",
    "word": "금슬지락",
    "hanja": "琴瑟之樂",
    "meaning": "부부사이가 좋은 것"
  },
  {
    "id": "idiom-b753aadb7368",
    "word": "금시발복",
    "hanja": "今時發福",
    "meaning": "어떤 일을 한 결과로 당장에 복이 트이어 부귀를 누리게 됨 (믿으면 금시발복 하지 않는다.)"
  },
  {
    "id": "idiom-485ca7857d15",
    "word": "금시초견",
    "hanja": "今時初見",
    "meaning": "보느니 처음. 이제야 비로소 처음 봄"
  },
  {
    "id": "idiom-d0cd2fdc4afe",
    "word": "금시초문",
    "hanja": "今時初聞",
    "meaning": "이제야 처음으로 들음"
  },
  {
    "id": "idiom-abc390303410",
    "word": "금오옥토",
    "hanja": "金烏玉兎",
    "meaning": "금 까마귀와 옥토끼란 뜻으로, 해와 달을 가리키는 말"
  },
  {
    "id": "idiom-5de1e0cba752",
    "word": "금의야행",
    "hanja": "錦衣夜行",
    "meaning": "비단옷을 입고 밤에 감. 아무 보람이 없는 행동"
  },
  {
    "id": "idiom-24d427888391",
    "word": "금의옥식",
    "hanja": "錦衣玉食",
    "meaning": "金은鍾, 聲은宣, 玉은磬, 振은收를 의미. 轉하여 智德이 갖추어 있음을 비유한다"
  },
  {
    "id": "idiom-e477631e4346",
    "word": "금의환향",
    "hanja": "錦衣還鄕",
    "meaning": "비단옷을 입고 고향에 돌아간다는 뜻으로, 객지에서 성공하여 고향에 돌아감을 이르는 말"
  },
  {
    "id": "idiom-119d2d8065d3",
    "word": "금지옥엽",
    "hanja": "金枝玉葉",
    "meaning": "임금의 일가 자손을 소중히 여겨 일컫는 말"
  },
  {
    "id": "idiom-cd49af3530b6",
    "word": "급수공덕",
    "hanja": "汲水功德",
    "meaning": "물을 떠남에게 주는 공덕. 쉽고도 대단치 않으나, 남을 위하여 일하는 것은 선행이라는 의미"
  },
  {
    "id": "idiom-cf8634d51720",
    "word": "기고만장",
    "hanja": "氣高萬丈",
    "meaning": "기운이 굉장히 뻗치었다. 일이 뜻대로 되어 씩씩한 기운이 대단하게 뻗침"
  },
  {
    "id": "idiom-0d2b6ae72837",
    "word": "기구지업",
    "hanja": "箕裘之業",
    "meaning": "先代의 業을 완전히 이어받음을 뜻한다"
  },
  {
    "id": "idiom-d4248e39dfde",
    "word": "기리단금",
    "hanja": "其利斷金",
    "meaning": "절친한 친구사이"
  },
  {
    "id": "idiom-0537ac97d751",
    "word": "기복신앙",
    "hanja": "祈福信仰",
    "meaning": "복을 기원함을 목적으로 믿는 미신적인 신앙"
  },
  {
    "id": "idiom-910d7545266c",
    "word": "기복염거",
    "hanja": "驥服鹽車",
    "meaning": "천리마가 소금 수레를 끈다, 유능한 인재가 낮은 지위에 있거나 하찮은 일에 쓰임의 비유"
  },
  {
    "id": "idiom-5f7cb29ca0e7",
    "word": "기사회생",
    "hanja": "起死回生",
    "meaning": "다 죽게 되었다가 다시 살아남"
  },
  {
    "id": "idiom-515752e029f8",
    "word": "기산지절",
    "hanja": "箕山之節",
    "meaning": "기산의 절개라는 말로, 굳은 절개나 자신의 신념에 충실한 것을 비유한다"
  },
  {
    "id": "idiom-19f62646d855",
    "word": "기상천외",
    "hanja": "奇想天外",
    "meaning": "보통 사람이 쉽게 짐작할 수 없을 정도로 엉뚱하고 기발한 생각"
  },
  {
    "id": "idiom-e6c8cef57c46",
    "word": "기성안혼",
    "hanja": "技成眼昏",
    "meaning": "재주를 다 배우고 나니 눈이 어두워졌다. 늙어서 좋은 기술이 쓸모가 없게 됨"
  },
  {
    "id": "idiom-9ac8af7e2936",
    "word": "기수영창",
    "hanja": "旣壽永昌",
    "meaning": "오래 가고 멀리 뻗으리라는 뜻"
  },
  {
    "id": "idiom-891a9355103f",
    "word": "기승전결",
    "hanja": "起承轉結",
    "meaning": "시의를 일으키는 첫 번째 `起, 받아 주는 둘째 承, 변화를 주는 셋째 `轉, 마무리하는 넷째 `結을 말함"
  },
  {
    "id": "idiom-bac93b34fe67",
    "word": "기여보비",
    "hanja": "寄與補裨",
    "meaning": "이바지하여 돕고 부족함을 보태어 줌"
  },
  {
    "id": "idiom-51cab64a67a4",
    "word": "기인지우",
    "hanja": "杞人之優",
    "meaning": "杞나라 사람의 군걱정이란 뜻. 곧 쓸데없는 걱정이나 무익한 근심을 말함. (=杞憂)"
  },
  {
    "id": "idiom-73c872ffee78",
    "word": "기장지무",
    "hanja": "旣張之舞",
    "meaning": "이미 벌린 춤. 이미 시작한 일을 중간에서 그만 둘 수 없다"
  },
  {
    "id": "idiom-614925e9a8b5",
    "word": "기진맥진",
    "hanja": "氣盡脈盡",
    "meaning": "기운이 없어지고 맥이 풀렸다. 온몸의 힘이 다 빠져 버리다"
  },
  {
    "id": "idiom-5db8de379492",
    "word": "기취여란",
    "hanja": "其臭如蘭",
    "meaning": "절친한 친구사이"
  },
  {
    "id": "idiom-0de7ae07d08c",
    "word": "기호난하",
    "hanja": "騎虎難下",
    "meaning": "이미 시작된 일을 중도에서 그만 둘 수 없음을 비유한 말"
  },
  {
    "id": "idiom-62edf113e66d",
    "word": "기호지세",
    "hanja": "騎虎之勢",
    "meaning": "중도에서 그만둘 수 없는 형세"
  },
  {
    "id": "idiom-21956e631bf7",
    "word": "기화가거",
    "hanja": "奇貨可居",
    "meaning": "좋은 기회를 기다려 큰 이익을 봄"
  },
  {
    "id": "idiom-d04256322a8f",
    "word": "길상선사",
    "hanja": "吉祥善事",
    "meaning": "매우 기쁘고 좋은 일"
  },
  {
    "id": "idiom-9862e15221a2",
    "word": "길흉화복",
    "hanja": "吉凶禍福",
    "meaning": "길한 일, 흉한 일, 언짢은 일, 복된 일"
  },
  {
    "id": "idiom-d2ede66ed2ff",
    "word": "나작굴서",
    "hanja": "羅雀掘鼠",
    "meaning": "그물로 참새를 잡고 땅을 파서 쥐를 잡음. 최악의 상태에 이르러 어찌할 방법이 없음"
  },
  {
    "id": "idiom-162abdc6cf59",
    "word": "낙극애생",
    "hanja": "樂極哀生",
    "meaning": "즐거움이 극에 달하면 슬픔이 생김"
  },
  {
    "id": "idiom-99647d1c4075",
    "word": "낙담상혼",
    "hanja": "落膽喪魂",
    "meaning": "몹시 놀라 정신이 없음"
  },
  {
    "id": "idiom-823d64d5baee",
    "word": "낙락장송",
    "hanja": "落落長松",
    "meaning": "가지가 축축 길게 늘어지고 키가 큰 소나무"
  },
  {
    "id": "idiom-bdbe1aaab981",
    "word": "낙미지액",
    "hanja": "落眉之厄",
    "meaning": "눈썹에 떨어진 액 즉 갑자기 들이닥친 재앙이라는 뜻"
  },
  {
    "id": "idiom-989ed0b03666",
    "word": "낙불사촉",
    "hanja": "樂不思蜀",
    "meaning": "魏나라의 융숭한 접대에 蜀나라에 있었던 궂은일을 다 잊는다, (자기 본분을 망각한다)"
  },
  {
    "id": "idiom-327dcd9741c0",
    "word": "낙생어우",
    "hanja": "樂生於憂",
    "meaning": "즐거움은 근심하는 가운데에서 생긴다는 말"
  },
  {
    "id": "idiom-ac54cb15226b",
    "word": "낙양지가",
    "hanja": "洛陽紙價",
    "meaning": "책이 널리 세상에 퍼져 애독됨 (=洛陽紙貴)"
  },
  {
    "id": "idiom-f5cb19779256",
    "word": "낙양지귀",
    "hanja": "洛陽紙貴",
    "meaning": "낙양의 종이 값이 오른다는 뜻으로 저서가 호평을 받아 베스트셀러가 됨을 의미"
  },
  {
    "id": "idiom-c25312014f82",
    "word": "낙엽귀근",
    "hanja": "落葉歸根",
    "meaning": "떨어진 잎사귀는 뿌리로 돌아간다. (모든 생명체는 그 생명을 다하면 그 근본으로 돌아감)"
  },
  {
    "id": "idiom-83d56df60e53",
    "word": "낙이불음",
    "hanja": "樂而不淫",
    "meaning": "즐기기는 하나 음탕하지는 않게 한다. 즐거움의 도를 지나치지 않음을 뜻함"
  },
  {
    "id": "idiom-f20535e83c51",
    "word": "낙이사촉",
    "hanja": "樂而思蜀",
    "meaning": "他鄕의 생활이 즐거워 고향 생각을 하지 못함을 이르는 말. (눈앞의 즐거움에 근본을 잊음)"
  },
  {
    "id": "idiom-cb7b2dbd253b",
    "word": "낙정하석",
    "hanja": "落穽下石",
    "meaning": "우물에 빠진 자에게 돌을 던진다. 남의 환란 (患亂)에 다시 위해 (危害)를 준다는 말"
  },
  {
    "id": "idiom-e64292962d31",
    "word": "낙화유수",
    "hanja": "落花流水",
    "meaning": "떨어지는 꽃과 흐르는 물. 전하여, 가는 봄의 경치. 또는 널리 衰敗零落의 뜻으로도 쓰임"
  },
  {
    "id": "idiom-449a07a3bed4",
    "word": "난공불락",
    "hanja": "難攻不落",
    "meaning": "학소가 지키는 진창성이 쉽사리 빼앗기지 않자, 제갈량이 한 말"
  },
  {
    "id": "idiom-aa70a6c77fa4",
    "word": "난상가란",
    "hanja": "卵上加卵",
    "meaning": "알 위에 알을 포갠다 (정성이 지극하면 감천함)"
  },
  {
    "id": "idiom-48d5df617cc4",
    "word": "난상공론",
    "hanja": "爛商公論",
    "meaning": "여러 사람들이 잘 의논 함 (=爛商討論)"
  },
  {
    "id": "idiom-14959c626a94",
    "word": "난상토론",
    "hanja": "爛商討論",
    "meaning": "여러 사람이 모여 자세하게 충분히 토의함. (=爛商公論)"
  },
  {
    "id": "idiom-e73ab7ae0aa9",
    "word": "난상토의",
    "hanja": "爛商討議",
    "meaning": "낱낱이 들어 잘 토의함"
  },
  {
    "id": "idiom-c379bfc9f761",
    "word": "난신적자",
    "hanja": "亂臣賊子",
    "meaning": "나라를 어지럽게 하는 신하와 부모에게 불효하는 못된 자식"
  },
  {
    "id": "idiom-995a591ce4b1",
    "word": "난의포식",
    "hanja": "暖衣飽食",
    "meaning": "따뜻하게 입고, 배불리 식사하는 만족한 살림살이. 물질적인 욕구가 충족된 생활"
  },
  {
    "id": "idiom-e10f2c42323d",
    "word": "난익지은",
    "hanja": "卵翼之恩",
    "meaning": "알을 까서 날개로 품어 준 은혜란 뜻으로, 자기를 낳아 길러 준 어버이의 은혜를 일컫는 말"
  },
  {
    "id": "idiom-adde395b43bb",
    "word": "난형난제",
    "hanja": "難兄難弟",
    "meaning": "형인지 아우인지 분간하기 어려움"
  },
  {
    "id": "idiom-568c92961936",
    "word": "난화지민",
    "hanja": "難化之民",
    "meaning": "교화시키기 어려운 백성"
  },
  {
    "id": "idiom-92e427cbefc1",
    "word": "남가일몽",
    "hanja": "南柯一夢",
    "meaning": "한 때의 헛된 부귀"
  },
  {
    "id": "idiom-37d46e86cfbb",
    "word": "남곽남취",
    "hanja": "南郭濫吹",
    "meaning": "학문과 기예에 전문적 지식과 체계나 조리도 없이 함부로 날뛰는 사람을 비유하는 말이다"
  },
  {
    "id": "idiom-890330ef850a",
    "word": "남곽람우",
    "hanja": "南郭濫釪",
    "meaning": "남곽이 우 (대나무로 만든 악기)를 분다. 우매한 사람이 능력이 있는 것처럼 속여 높은 자리를 차지함"
  },
  {
    "id": "idiom-d8287654b2b4",
    "word": "남귤북지",
    "hanja": "南橘北枳",
    "meaning": "강남의 귤을 강북에 옮겨 심으면 탱자로 변한다는 뜻. (사람은 환경에 따라 변한다)"
  },
  {
    "id": "idiom-e9df2dceeabb",
    "word": "남녀노소",
    "hanja": "男女老少",
    "meaning": "남자와 여자, 늙은이와 젊은이. 모든 사람"
  },
  {
    "id": "idiom-f99d0575687a",
    "word": "남만격설",
    "hanja": "南蠻鴃舌",
    "meaning": "남방의 미개 민족들의 말은 때까치의 소리와 같다 (못 알아듣는 외국 사람의 말을 멸시함)"
  },
  {
    "id": "idiom-8fb08f4c19cc",
    "word": "남면지위",
    "hanja": "南面之位",
    "meaning": "임금이 앉는 자리의 방향이 남향이었다는 데서 유래한 것으로 임금의 자리를 가리키는 말"
  },
  {
    "id": "idiom-9c1def2cf011",
    "word": "남부녀대",
    "hanja": "男負女戴",
    "meaning": "남자는 짊어지고 여자는 임. 가난한 사람들이 떠돌아다니며 사는 것"
  },
  {
    "id": "idiom-bb7d36e8dd8c",
    "word": "남선북마",
    "hanja": "南船北馬",
    "meaning": "바쁘게 여기저기를 돌아다님"
  },
  {
    "id": "idiom-ff80fa1ea20a",
    "word": "남원북철",
    "hanja": "南轅北轍",
    "meaning": "수레의 긴 채는 남쪽으로 가고 바퀴는 북쪽으로 간다. (행동이 마음과 일치하지 않음.)"
  },
  {
    "id": "idiom-0cf620b1c260",
    "word": "남전북답",
    "hanja": "南田北畓",
    "meaning": "여기저기 흩어져 있는 모든 논밭"
  },
  {
    "id": "idiom-dc30036f67e2",
    "word": "남전생옥",
    "hanja": "藍田生玉",
    "meaning": "남전은 예로부터 아름다운 옥이 산출하듯이 명문에서 훌륭한 인물이 나온다는 뜻"
  },
  {
    "id": "idiom-17cc9d03119e",
    "word": "남존여비",
    "hanja": "男尊女卑",
    "meaning": "남성을 존중하고 여성을 비천하게 여기는 생각"
  },
  {
    "id": "idiom-16718ecfdfab",
    "word": "남풍불경",
    "hanja": "南風不競",
    "meaning": "남방지역의 풍악은 미약하고 생기가 없다는 뜻 (일반적으로 힘 또는 세력을 떨치지 못함을 비유)"
  },
  {
    "id": "idiom-bf8282c10e02",
    "word": "낭자야심",
    "hanja": "狼子野心",
    "meaning": "이리 새끼는 아무리 길들여 기르려 해도 야수의 성질을 벗어나지 못한다"
  },
  {
    "id": "idiom-60a28f62995a",
    "word": "낭중지추",
    "hanja": "囊中之錐",
    "meaning": "뛰어난 재주는 숨기려 해도 저절로 드러남"
  },
  {
    "id": "idiom-22fe107a1685",
    "word": "낭중취물",
    "hanja": "囊中取物",
    "meaning": "주머니 속의 물건을 꺼내는 일. 매우 쉬운 일"
  },
  {
    "id": "idiom-b67ad70800c8",
    "word": "내강외유",
    "hanja": "內剛外柔",
    "meaning": "겉으로 보기에는 유순하지만 속마음은 단단하고 굳셈"
  },
  {
    "id": "idiom-75267f4d38aa",
    "word": "내성불구",
    "hanja": "內省不疚",
    "meaning": "마음속에 조금도 부끄러울 것이 없음. 즉 마음이 결백함을 뜻한다"
  },
  {
    "id": "idiom-862f7f3bf14a",
    "word": "내우외환",
    "hanja": "內憂外患",
    "meaning": "나라 안팎의 근심 걱정"
  },
  {
    "id": "idiom-e110a0ccba96",
    "word": "내유외강",
    "hanja": "內柔外剛",
    "meaning": "사실은 마음이 약한데도, 외부에는 강하게 나타남"
  },
  {
    "id": "idiom-077fc89b4694",
    "word": "내윤외랑",
    "hanja": "內潤外朗",
    "meaning": "옥의 광택이 안에 함축된 것을 內潤, 밖으로 나타난 것을 外朗이라 함. 재주와 덕망을 겸비함"
  },
  {
    "id": "idiom-bb0261e28eb1",
    "word": "내조지공",
    "hanja": "內助之功",
    "meaning": "안에서 돕는 공. 아내가 집안일을 잘 다스려 남편을 돕는 일을 말한다"
  },
  {
    "id": "idiom-00e5c96edc09",
    "word": "내청외탁",
    "hanja": "內淸外濁",
    "meaning": "마음은 깨끗하나 행동은 흐린 것처럼 함. (어지러운 세상 속에 어울려 살아감)"
  },
  {
    "id": "idiom-03ba022b9cd0",
    "word": "노갑이을",
    "hanja": "怒甲移乙",
    "meaning": "어떤 사람에게서 당한 노여움을 다른 사람에게 화풀이 하다"
  },
  {
    "id": "idiom-95b9b60542e3",
    "word": "노기충천",
    "hanja": "怒氣衝天",
    "meaning": "화난 기색이 하늘을 찌를 듯이 극도로 달한 것"
  },
  {
    "id": "idiom-742db75056e7",
    "word": "노당익장",
    "hanja": "老當益壯",
    "meaning": "사람은 늙을수록 더욱 기운을 내어야 하고 뜻을 굳게 해야 한다. (=老益壯)"
  },
  {
    "id": "idiom-0bad759930a5",
    "word": "노래지희",
    "hanja": "老萊之戱",
    "meaning": "周나라의 老萊子가 칠십의 나이에 재롱을 부려 부모에게 자식의 늙음을 잊게 해드린 일"
  },
  {
    "id": "idiom-cdf70ab4d520",
    "word": "노력이전",
    "hanja": "勞力移轉",
    "meaning": "나이가 많고 품삯이 높은 일꾼을 해고하고 대신 품삯이 낮은 일꾼을 써서 지불을 경감하는 일"
  },
  {
    "id": "idiom-846c4e95ff5a",
    "word": "노류장화",
    "hanja": "路柳墻花",
    "meaning": "길 가의 버들과 담 밑의 꽃은 누구든지 쉽게 만지고 꺾을 수 있다. 妓生을 의미한다"
  },
  {
    "id": "idiom-63f718cf0cb1",
    "word": "노마십가",
    "hanja": "駑馬十駕",
    "meaning": "둔한 말이 열흘 동안 수레를 끌고 다닌다. 는 뜻으로 열심히 하면 된다"
  },
  {
    "id": "idiom-f35dfe55f250",
    "word": "노마지지",
    "hanja": "老馬之智",
    "meaning": "늙은 말의 지혜 아무리 하찮은 것도 장기나 장점을 가지고 있음"
  },
  {
    "id": "idiom-1661584d52fe",
    "word": "노발대발",
    "hanja": "怒發大發",
    "meaning": "몹시 크게 성을 냄"
  },
  {
    "id": "idiom-db6fb3ae7d6b",
    "word": "노생상담",
    "hanja": "老生常譚",
    "meaning": "늙은 서생이 하는 이야기. 언제나 똑같은 상투적인 이야기를 할 때 사용함"
  },
  {
    "id": "idiom-9e509dc29b7e",
    "word": "노생지몽",
    "hanja": "盧生之夢",
    "meaning": "한때의 헛된 부귀영화 (南柯一夢, 一場春夢)"
  },
  {
    "id": "idiom-b69f053f2d8f",
    "word": "노소부정",
    "hanja": "老少不定",
    "meaning": "사람의 수명은 정해져 있지 않아 언제 죽을지 알 수 없다고 하는 것"
  },
  {
    "id": "idiom-180402960286",
    "word": "노승발검",
    "hanja": "怒蠅拔劍",
    "meaning": "파리 때문에 성질이 난다고 칼을 뽑아 듦. 작은 일을 갖고 수선스럽게 화내는 것을 비유한다"
  },
  {
    "id": "idiom-a02321fd6775",
    "word": "노심초사",
    "hanja": "勞心焦思",
    "meaning": "애를 써 속을 태움"
  },
  {
    "id": "idiom-ae85166da307",
    "word": "노우지독",
    "hanja": "老牛䑛犢",
    "meaning": "늙은 소가 어린 송아지를 핥는다는 뜻"
  },
  {
    "id": "idiom-dd3fd28d6261",
    "word": "노이무공",
    "hanja": "勞而無功",
    "meaning": "온갖 애를 썼으나 아무런 보람이 없음"
  },
  {
    "id": "idiom-419a0fce6207",
    "word": "노이불사",
    "hanja": "老而不死",
    "meaning": "몸은 늙고 어지러운 일이 자꾸 닥쳐, 죽고 싶어도 죽지 못함을 한탄하는 말"
  },
  {
    "id": "idiom-7821afa7e8a8",
    "word": "녹불첩수",
    "hanja": "祿不疊受",
    "meaning": "두 벼슬을 겸한 사람이 한 벼슬의 녹만 받음"
  },
  {
    "id": "idiom-1d36a173d9ce",
    "word": "녹엽성음",
    "hanja": "綠葉成陰",
    "meaning": "초록빛 잎이 그늘을 만든다는 말로, 여자가 결혼하여 자녀가 많은 것을 비유적으로 나타낸다"
  },
  {
    "id": "idiom-606bd69425a4",
    "word": "녹음방초",
    "hanja": "綠陰芳草",
    "meaning": "푸른 나무 그늘과 꽃다운 풀, 곧 여름의 아름다운 자연 경치"
  },
  {
    "id": "idiom-6a8aeaaa0357",
    "word": "녹의사자",
    "hanja": "綠衣使者",
    "meaning": "푸른 옷을 입은 사자라는 말로, 앵무새의 다른 명칭이다"
  },
  {
    "id": "idiom-1c2210c9887f",
    "word": "녹의홍상",
    "hanja": "綠衣紅裳",
    "meaning": "연두저고리에 다홍치마. 곱게 차려 입은 젊은 아가씨의 복색"
  },
  {
    "id": "idiom-d6c474e25fcf",
    "word": "논공행상",
    "hanja": "論功行賞",
    "meaning": "세운 공을 논하여 상을 줌"
  },
  {
    "id": "idiom-057d62f392e3",
    "word": "논점일탈",
    "hanja": "論點逸脫",
    "meaning": "논설의 요점을 벗어남"
  },
  {
    "id": "idiom-899570a9e880",
    "word": "농가성진",
    "hanja": "弄假成眞",
    "meaning": "장난삼아 한 말이 참말이 됨"
  },
  {
    "id": "idiom-dee1a139ee84",
    "word": "농교성졸",
    "hanja": "弄巧成拙",
    "meaning": "지나치게 기교를 부리다 오히려 서툴게 됨을 이름"
  },
  {
    "id": "idiom-05ca4d22f681",
    "word": "농와지경",
    "hanja": "弄瓦之慶",
    "meaning": "딸을 낳은 기쁨"
  },
  {
    "id": "idiom-da4222afaace",
    "word": "농장지경",
    "hanja": "弄璋之慶",
    "meaning": "아들을 낳은 경사"
  },
  {
    "id": "idiom-d41ec13576b1",
    "word": "농장지희",
    "hanja": "弄璋之喜",
    "meaning": "아들을 낳은 기쁨"
  },
  {
    "id": "idiom-cc49f96886b1",
    "word": "농조연운",
    "hanja": "籠鳥戀雲",
    "meaning": "속박을 당한 몸이 자유를 그리워하는 마음"
  },
  {
    "id": "idiom-e9ad0c2ffd9a",
    "word": "누란지세",
    "hanja": "累卵之勢",
    "meaning": "몹시 위태로운 형세"
  },
  {
    "id": "idiom-fca14af74649",
    "word": "누란지위",
    "hanja": "累卵之危",
    "meaning": "알을 쌓아 놓은 것처럼 아주 위태로운 형세"
  },
  {
    "id": "idiom-5d3608bf8bcf",
    "word": "누세통가",
    "hanja": "累世通家",
    "meaning": "공융이 이응에게 한 말로, 수 세대에 걸쳐서 집안끼리 알았던 사이라는 뜻"
  },
  {
    "id": "idiom-1ec4ba968db9",
    "word": "눌언민행",
    "hanja": "訥言敏行",
    "meaning": "말은 둔하게 하고 행동은 민첩해야 한다"
  },
  {
    "id": "idiom-d6a5d483f3e9",
    "word": "능견난사",
    "hanja": "能見難思",
    "meaning": "보통 이치로는 아무리 생각해도 모를 일이라는 뜻"
  },
  {
    "id": "idiom-d943e4d95a56",
    "word": "능대능소",
    "hanja": "能大能小",
    "meaning": "재주와 주변이 좋아 모든 일에 두루 능함"
  },
  {
    "id": "idiom-eb7e2b692d07",
    "word": "능언앵무",
    "hanja": "能言鸚鵡",
    "meaning": "말은 잘하나 실제 학문은 없는 사람을 이르는 말"
  },
  {
    "id": "idiom-baca3c24e3bb",
    "word": "능지처참",
    "hanja": "陵遲處斬",
    "meaning": "머리, 손, 발 그리고 몸을 도막 치던 극형"
  },
  {
    "id": "idiom-bca79a191b68",
    "word": "다기망양",
    "hanja": "多岐亡羊",
    "meaning": "여러 갈래의 길에서 양을 잃음 (학문의 길이 여러 갈래라 진리를 찾기 어려움.)"
  },
  {
    "id": "idiom-e32491f9267d",
    "word": "다다익선",
    "hanja": "多多益善",
    "meaning": "수가 많으면 많을수록 더욱 좋음."
  },
  {
    "id": "idiom-1b7c48ff7ae9",
    "word": "다문박식",
    "hanja": "多聞博識",
    "meaning": "견문이 넓고 학식이 많음"
  },
  {
    "id": "idiom-bd64d2f68ad1",
    "word": "다사다난",
    "hanja": "多事多難",
    "meaning": "여러 가지 일이 많은데다 어려운 일도 많음. 비-내우외환 (內憂外患)"
  },
  {
    "id": "idiom-69a67c3447d4",
    "word": "다사다망",
    "hanja": "多事多忙",
    "meaning": "일이 많아 매우 바쁨"
  },
  {
    "id": "idiom-4aeac18288a6",
    "word": "다수가결",
    "hanja": "多數可決",
    "meaning": "다수에 의하여 가부를 정함"
  },
  {
    "id": "idiom-3c4ab1a24888",
    "word": "다언혹중",
    "hanja": "多言或中",
    "meaning": "말이 많으면 혹 맞는 말이 있음"
  },
  {
    "id": "idiom-d734f357f246",
    "word": "다재다병",
    "hanja": "多才多病",
    "meaning": "재주가 많은 사람은 흔히 몸이 약하며 잔병이 많음"
  },
  {
    "id": "idiom-e6882f3090bb",
    "word": "다전선고",
    "hanja": "多錢善賈",
    "meaning": "재물이 많으면 장사를 잘 한다는 뜻으로 조건이 좋은 사람이 성공하기도 쉽다는 말의 비유"
  },
  {
    "id": "idiom-6d2fdc251473",
    "word": "다정다감",
    "hanja": "多情多感",
    "meaning": "애틋한 정도 많고, 느낌이나 생각이 많음"
  },
  {
    "id": "idiom-3cb2242cbfe6",
    "word": "다정불심",
    "hanja": "多情佛心",
    "meaning": "다정다감하고 착한마음. 자비스러운 마음"
  },
  {
    "id": "idiom-0bb7b96fa404",
    "word": "단금지계",
    "hanja": "斷金之契",
    "meaning": "무쇠를 자를 수 있을 정도의 굳은 사귐"
  },
  {
    "id": "idiom-31f153371165",
    "word": "단금지교",
    "hanja": "斷金之交",
    "meaning": "쇠를 자를 정도로 절친한 친구사이를 말함"
  },
  {
    "id": "idiom-6e2d7ef855e3",
    "word": "단기지계",
    "hanja": "斷機之戒",
    "meaning": "학문을 중도에서 그만 둠에 대한 훈계의 뜻"
  },
  {
    "id": "idiom-b4d9becd257d",
    "word": "단기지교",
    "hanja": "斷機之交",
    "meaning": "학문을 중도에 그만 둠은 짜던 베를 끊는 것이라는 맹자 어머니의 교훈"
  },
  {
    "id": "idiom-a1b116675aa9",
    "word": "단기천리",
    "hanja": "單騎千里",
    "meaning": "조조를 떠나 유비를 찾아가는 관우의 모습을 묘사한 고사. 말 하나를 타고 천리를 내달린다는 뜻"
  },
  {
    "id": "idiom-7632dbf005a8",
    "word": "단도부회",
    "hanja": "單刀赴會",
    "meaning": "칼 한 자루를 들고 모임에 나간다는 뜻으로, 여기서 모임이 란 위험한 자리를 뜻한다"
  },
  {
    "id": "idiom-0478750c1ef7",
    "word": "단도직입",
    "hanja": "單刀直入",
    "meaning": "요점을 바로 말하여 들어감"
  },
  {
    "id": "idiom-2e930ab4f915",
    "word": "단두장군",
    "hanja": "斷頭將軍",
    "meaning": "파서 관에서 장비에게 패한 엄안이 장비 앞에서 죽어도 항복할 수 없다. 어서 목을 쳐라 에서유래"
  },
  {
    "id": "idiom-ba88c817c616",
    "word": "단사두갱",
    "hanja": "簞食豆羹",
    "meaning": "簞은 밥을 담는 그릇. 豆는 국을 담는 椀같은 것으로 음식의 분량이 적은 것을 말한다"
  },
  {
    "id": "idiom-32f6395215b4",
    "word": "단사표음",
    "hanja": "簞食瓢飮",
    "meaning": "도시락밥과 표주박 물. 변변치 못한 살림을 가리키는 뜻으로 청빈한 생활을 말함"
  },
  {
    "id": "idiom-3af0b0ae84f9",
    "word": "단사호장",
    "hanja": "簞食壺漿",
    "meaning": "도시락에 담은 밥과 병에 넣은 마실 것 (백성들이 소박한 정성으로 군대를 환영함을 이르는 말)"
  },
  {
    "id": "idiom-057873354625",
    "word": "단순호치",
    "hanja": "丹脣皓齒",
    "meaning": "붉은 입술과 하얀 이란 뜻에서 여자의 아름다운 얼굴을 이르는 말"
  },
  {
    "id": "idiom-95468fd84d5f",
    "word": "단식호장",
    "hanja": "簞食壺裝",
    "meaning": "도시락밥과 단지에 넣은 음료수의 뜻으로 적은 분량의 음식물의 비유, 길 갈 때 휴대하는 음식물"
  },
  {
    "id": "idiom-ca562dc17cf4",
    "word": "단의절친",
    "hanja": "斷義絶親",
    "meaning": "가족관계와 의리를 끊는 것"
  },
  {
    "id": "idiom-82c80170885d",
    "word": "단장보단",
    "hanja": "斷長補短",
    "meaning": "긴 곳을 잘라 짧은 곳을 메워 들쭉날쭉한 것을 곧게 한다"
  },
  {
    "id": "idiom-8fe66caca898",
    "word": "단표누항",
    "hanja": "簞瓢陋巷",
    "meaning": "누추한 거리라는 뜻으로 소박한 시골 살림살이를 가리킴"
  },
  {
    "id": "idiom-957c609bc21e",
    "word": "달다어요",
    "hanja": "獺多魚擾",
    "meaning": "수달이 많으면 물고기가 두려워서 혼란에 빠지듯 관리가 많으면 백성이 핍박을 받는다"
  },
  {
    "id": "idiom-19da1294b5ac",
    "word": "달인대관",
    "hanja": "達人大觀",
    "meaning": "달인은 사물의 전 국면을 관찰하여 공명정대한 판단을 한다는 말"
  },
  {
    "id": "idiom-65287d08089b",
    "word": "담대심소",
    "hanja": "膽大心小",
    "meaning": "담력은 커야 하지만 마음을 쓰는데 는 조심해야 한다는 말"
  },
  {
    "id": "idiom-f5339158fc47",
    "word": "담소자약",
    "hanja": "談笑自若",
    "meaning": "위험이나 곤란에 직면해 걱정과 근심이 있을 때라도 변함없이 평상시와 같은 태도를 가짐. (=泰然自若)"
  },
  {
    "id": "idiom-47571b8e4d07",
    "word": "담인인지",
    "hanja": "談人人至",
    "meaning": "자리에 없는 사람의 말을 하면 공교롭게도 그 사람이 옴"
  },
  {
    "id": "idiom-90591eb112a1",
    "word": "담하용이",
    "hanja": "談何容易",
    "meaning": "입으로 말하는 것은 쉽지만, 실제로 해보면 쉽지 않으므로 쉽게 입을 여는 짓은 삼가라"
  },
  {
    "id": "idiom-057147406d57",
    "word": "당구풍월",
    "hanja": "堂狗風月",
    "meaning": "사당 개가 풍월을 읊음. 무식한 자도 유식한 자와 같이 있으면 다소 유식해진다는 뜻"
  },
  {
    "id": "idiom-cf48b8ec7467",
    "word": "당돌서시",
    "hanja": "唐突西施",
    "meaning": "당돌한 서시라는 뜻으로, 꺼리거나 어려워함이 없이 올차고 다부진 서시라는 의미이다"
  },
  {
    "id": "idiom-3b4eadfc2bb7",
    "word": "당동벌이",
    "hanja": "黨同伐異",
    "meaning": "옳고 그름을 가리지 않고 뜻이 맞는 사람들끼리는 한패가 되고 그렇지 않은 사람은 배척함"
  },
  {
    "id": "idiom-a41a57a824a3",
    "word": "당랑거철",
    "hanja": "螳螂拒轍",
    "meaning": "제 분수도 모르고 강적에게 반항함"
  },
  {
    "id": "idiom-77e4c68380eb",
    "word": "당랑재후",
    "hanja": "螳螂在後",
    "meaning": "사마귀가 화를 내며 발로 수레의 가는 길을 막음. 제 분수도 모르고 강적에게 대항하는 것을 말한다"
  },
  {
    "id": "idiom-73e123142557",
    "word": "당랑지부",
    "hanja": "螳螂之斧",
    "meaning": "사마귀가 앞발을 들어 수레를 막는다 (분수도 모르고 강한 적에 반항하여 덤벼듦을 비유한 말)"
  },
  {
    "id": "idiom-49d5fbc1d77d",
    "word": "당랑포선",
    "hanja": "螳螂捕蟬",
    "meaning": "눈앞의욕심에만눈이어두워덤비면결국큰해를입게된다는뜻"
  },
  {
    "id": "idiom-628f02298545",
    "word": "당비당차",
    "hanja": "螳臂當車",
    "meaning": "사마귀가 발을 벌리고 수레를 막듯 어처구니없는 일을 벌임"
  },
  {
    "id": "idiom-badf4e7df88e",
    "word": "대간사충",
    "hanja": "大姦似忠",
    "meaning": "악한 사람이 본성을 숨기고 충신처럼 보임"
  },
  {
    "id": "idiom-7aaa3efab4f1",
    "word": "대갈일성",
    "hanja": "大喝一聲",
    "meaning": "분별이 없음을 주위하기위해 큰소리로 한방 꾸짖는 것"
  },
  {
    "id": "idiom-cfb60b1196e7",
    "word": "대경대법",
    "hanja": "大經大法",
    "meaning": "공명정대한 원리와 법칙"
  },
  {
    "id": "idiom-43990cd8f1fc",
    "word": "대경실색",
    "hanja": "大驚失色",
    "meaning": "크게 놀라서 얼굴색이 변함"
  },
  {
    "id": "idiom-70db307c339d",
    "word": "대공무사",
    "hanja": "大公無私",
    "meaning": "매우 공평하여 사사로움이 없다는 뜻이다"
  },
  {
    "id": "idiom-e9d2faf9e553",
    "word": "대교약졸",
    "hanja": "大巧若拙",
    "meaning": "훌륭한 기교는 도리어 졸렬한 듯함"
  },
  {
    "id": "idiom-68f393fbce09",
    "word": "대기만성",
    "hanja": "大器晩成",
    "meaning": "큰 인물이 되기까지 오랜 시간과 노력이 필요함."
  },
  {
    "id": "idiom-50fc817292dd",
    "word": "대답양단",
    "hanja": "對踏兩端",
    "meaning": "상반되는 양끝을 밟는다고 뜻으로, 서로 다른 길을 감"
  },
  {
    "id": "idiom-e8b2cafeb87e",
    "word": "대대손손",
    "hanja": "代代孫孫",
    "meaning": "대대로 내려오는 자손"
  },
  {
    "id": "idiom-425ff37e5230",
    "word": "대도무문",
    "hanja": "大道舞門",
    "meaning": "사람으로서 마땅히 지켜야 할 큰 道理나 정도正道에는 거칠 것이 없다는 뜻"
  },
  {
    "id": "idiom-90fc8751e82f",
    "word": "대동단결",
    "hanja": "大同團結",
    "meaning": "많은 사람. 여러 갈래의 당파가 큰 덩어리로 한 데 뭉치다"
  },
  {
    "id": "idiom-b9a7a22d3a74",
    "word": "대동소이",
    "hanja": "大同小異",
    "meaning": "조금 차이는 있지만 대개는 같은 것"
  },
  {
    "id": "idiom-8ae46f3cfa54",
    "word": "대명천지",
    "hanja": "大明天地",
    "meaning": "매우 밝은 세상. 크게 밝은 하늘과 땅"
  },
  {
    "id": "idiom-db806344f2d4",
    "word": "대복재천",
    "hanja": "大福在天",
    "meaning": "큰 복은 하늘에 달려있고"
  },
  {
    "id": "idiom-8fec24afb57f",
    "word": "대분망천",
    "hanja": "戴盆望天",
    "meaning": "머리에 동이를 이면 하늘을 볼 수 없는데 보려고 한다. (두 가지 일을 하고자 하나 할 수 없음)"
  },
  {
    "id": "idiom-c996ef72569e",
    "word": "대서특필",
    "hanja": "大書特筆",
    "meaning": "특히 드러나게 큰 글자로 적어 표시함"
  },
  {
    "id": "idiom-e331774f629c",
    "word": "대언장어",
    "hanja": "大言壯語",
    "meaning": "제 주제에 당치 아니한 말을 희떱게 지껄임. 또는 그러한 말"
  },
  {
    "id": "idiom-cb73ad585997",
    "word": "대역무도",
    "hanja": "大逆無道",
    "meaning": "심히 人倫에 거역하는 惡逆한 행위"
  },
  {
    "id": "idiom-39112ff47bfe",
    "word": "대오대비",
    "hanja": "大奧大秘",
    "meaning": "매우 깊고 큰 비밀"
  },
  {
    "id": "idiom-2739bf2130d4",
    "word": "대우탄금",
    "hanja": "對牛彈琴",
    "meaning": "소를 대하고 거문고를 뜯는다. (어리석은 사람에게 깊은 이치를 말해 주어도 소용이 없다)"
  },
  {
    "id": "idiom-ced35d2fa503",
    "word": "대원성취",
    "hanja": "大願成就",
    "meaning": "큰 소원을 이룸"
  },
  {
    "id": "idiom-fbef36e7cdec",
    "word": "대의멸친",
    "hanja": "大義滅親",
    "meaning": "국가의 대의를 위해서는 사적인 감정은 돌보지 않음"
  },
  {
    "id": "idiom-f9453b03c0fa",
    "word": "대의명분",
    "hanja": "大義名分",
    "meaning": "인간으로서 지켜야 할 절의 와 분수. 방침으로서 표면상 내건 목적이나 이유"
  },
  {
    "id": "idiom-e7a23b24a9ab",
    "word": "대자대비",
    "hanja": "大慈大悲",
    "meaning": "넓고 커서 가없는 자비. 부처의 광대무변한 자비. (慈悲는 불쌍히 여김.)"
  },
  {
    "id": "idiom-fd064c193a80",
    "word": "대재소용",
    "hanja": "大材小用",
    "meaning": "큰 材木이 작게 쓰이고 있다. 사람을 쓰는데 있어서 제 능력을 다 발휘할 수 있는 조건이 안 됨"
  },
  {
    "id": "idiom-aa0c25627c07",
    "word": "대천지수",
    "hanja": "戴天之讐",
    "meaning": "함께 하늘을 이고 살수 없는 원수. 임금이나 어버이에 대한 원수는 하늘을 함께 하고 살지 않음"
  },
  {
    "id": "idiom-6c57e372b77a",
    "word": "덕무상사",
    "hanja": "德無常師",
    "meaning": "德을 닦는 데는 일정한 스승이 없다"
  },
  {
    "id": "idiom-4f20f2c2d2cb",
    "word": "덕본재말",
    "hanja": "德本財末",
    "meaning": "사람이 살아가는 데 德이 뿌리가 되고 財物은 사소한 부분이다"
  },
  {
    "id": "idiom-ec1e05be30cf",
    "word": "도견상부",
    "hanja": "道見桑婦",
    "meaning": "길에서 뽕나무를 보고 여자의 말을 한다는 뜻으로, (기존에 갖고 있던 것까지 모두 잃게 됨)"
  },
  {
    "id": "idiom-b8cc94293bb7",
    "word": "도광양회",
    "hanja": "韜光養晦",
    "meaning": "빛을 감추고, 어둠을 기른다. 劉備가 曹操의 식객일 때 조조를 기만하기 위해 썼던 술책"
  },
  {
    "id": "idiom-afc7541a403b",
    "word": "도로무공",
    "hanja": "徒勞無功",
    "meaning": "노력에도 불구하고 아무런 보람이나 이익이 없음"
  },
  {
    "id": "idiom-bc89a55f60b4",
    "word": "도로무익",
    "hanja": "徒勞無益",
    "meaning": "애만 쓰고 이로움이 없음"
  },
  {
    "id": "idiom-8c41b4ec6016",
    "word": "도리상영",
    "hanja": "倒履相迎",
    "meaning": "신을 거꾸로 신고 손님을 맞이하는 것을 말한다"
  },
  {
    "id": "idiom-7b28073c2638",
    "word": "도모시용",
    "hanja": "道謀是用",
    "meaning": "집을 짓는 데 길가는 사람들에게 의견을 물으면 모두 달라 집을 지을 수 없다"
  },
  {
    "id": "idiom-28a877c5e93a",
    "word": "도방고리",
    "hanja": "道傍苦李",
    "meaning": "사람들에게 시달림을 받으며 길가에 서 있는 오얏나무. 사람에게 버림 받는 것을 비유한다"
  },
  {
    "id": "idiom-02875e5513f1",
    "word": "도불습유",
    "hanja": "道不拾遺",
    "meaning": "길에 물건이 떨어져 있어도 주워가지 않는다. 나라가 잘 다스려져 태평하고 풍부한 세상을 형용하는 말"
  },
  {
    "id": "idiom-44e145d50be5",
    "word": "도역유도",
    "hanja": "盜亦有道",
    "meaning": "도둑들에게도 나름대로의 도덕이 있다"
  },
  {
    "id": "idiom-b682471e2457",
    "word": "도원결의",
    "hanja": "桃園結義",
    "meaning": "삼국지에서 나온 말로, 유비, 관우, 장비가 복숭아나무 밑에서 의형제를 맺었다는 데서 나온 말"
  },
  {
    "id": "idiom-f54049f0234e",
    "word": "도절시진",
    "hanja": "刀折矢盡",
    "meaning": "칼이 부러지고 화살이 바닥났다는 뜻으로, 더 이상 싸울 힘이 없음의 비유"
  },
  {
    "id": "idiom-24010f783451",
    "word": "도주지부",
    "hanja": "陶朱之富",
    "meaning": "도주공의 부란 뜻으로 큰 부를 일컫는 말"
  },
  {
    "id": "idiom-791987a6bd80",
    "word": "도중예미",
    "hanja": "途中曳尾",
    "meaning": "거북이 진흙에서 꼬리를 끌며 오래 산다 (선비가 벼슬하지 않고 고향에서 가난하게 지냄)"
  },
  {
    "id": "idiom-fa1dedc174da",
    "word": "도증주인",
    "hanja": "盜憎主人",
    "meaning": "도둑은 주인이 밉게 마련이다. 즉 자기와 반대되는 입장에 있는 사람이 미워지는 것"
  },
  {
    "id": "idiom-58c59bbf2005",
    "word": "도처낭패",
    "hanja": "到處狼狽",
    "meaning": "하는 일마다 다 실패함"
  },
  {
    "id": "idiom-d195f5caf278",
    "word": "도처춘풍",
    "hanja": "到處春風",
    "meaning": "이르는 곳마다 봄바람. 즉 좋은 얼굴로 남을 대하여 사람들에게 호감을 사려고 처신하는 사람"
  },
  {
    "id": "idiom-4c3b7a14bbe8",
    "word": "도천지수",
    "hanja": "盜泉之水",
    "meaning": "아무리 목이 말라도 盜가 들어있는 이름의 샘물은 마시지 않음. 부정한 짓은 할 수 없다는 뜻"
  },
  {
    "id": "idiom-efb5a052b1b4",
    "word": "도청도설",
    "hanja": "道聽塗說",
    "meaning": "길거리에 떠돌아다니는 뜬소문"
  },
  {
    "id": "idiom-a2599d98190b",
    "word": "도탄지고",
    "hanja": "塗炭之苦",
    "meaning": "백성들이 매우 고생함"
  },
  {
    "id": "idiom-bef9ee0afeab",
    "word": "도학선생",
    "hanja": "道學先生",
    "meaning": "도덕의 이론만 캐고 실사회의 일에 어두운 사람을 조롱하는 말"
  },
  {
    "id": "idiom-db1a0508c46a",
    "word": "도행역시",
    "hanja": "倒行逆施",
    "meaning": "거꾸로 행하고 거슬러 시행함. 곧 道理에 순종하지 않고 일을 행하며 常道를 벗어나서 일을 억지로 함"
  },
  {
    "id": "idiom-95a19d3c910f",
    "word": "독불장군",
    "hanja": "獨不將軍",
    "meaning": "혼자서 장군이 될 수 없다. 혼자 잘 난체 하다가 남에게 핀잔을 받고 고립된 처지에 있는 사람"
  },
  {
    "id": "idiom-e359b0d6123f",
    "word": "독서망양",
    "hanja": "讀書亡羊",
    "meaning": "책을 읽다가 양을 잃어버림. 즉, 다른 일에 정신이 팔림"
  },
  {
    "id": "idiom-b384f549f985",
    "word": "독서삼도",
    "hanja": "讀書三到",
    "meaning": "독서하는데 는 눈으로 보고, 입으로 읽고, 마음으로 깨우쳐야 한다는 뜻"
  },
  {
    "id": "idiom-02b3113cd313",
    "word": "독서삼매",
    "hanja": "讀書三昧",
    "meaning": "아무 생각 없이 오직 책읽기에만 골몰하고 있는 상태. 한 곳에 정신을 집중하는 것"
  },
  {
    "id": "idiom-d73a58a381eb",
    "word": "독서삼여",
    "hanja": "讀書三餘",
    "meaning": "책읽기 좋은 세 가지 시기. (겨울철, 밤, 비 오는 날)"
  },
  {
    "id": "idiom-da140125b3b9",
    "word": "독서상우",
    "hanja": "讀書尙友",
    "meaning": "책을 읽어서 옛날의 현인을 벗 삼는다는 말"
  },
  {
    "id": "idiom-a4ca36776fde",
    "word": "독서종자",
    "hanja": "讀書種子",
    "meaning": "독서를 좋아하는 자손을 일컫는 말"
  },
  {
    "id": "idiom-96ddaa807cae",
    "word": "독수공방",
    "hanja": "獨守空房",
    "meaning": "부부가 서로 사별이나, 별거하여 여자가 남편 없이 혼자 지내는 것을 말함"
  },
  {
    "id": "idiom-181d89bd46c1",
    "word": "독야청청",
    "hanja": "獨也靑靑",
    "meaning": "홀로 푸르다는 마로, 홀로 높은 절개를 드러내고 있음을"
  },
  {
    "id": "idiom-5d0a4da2973e",
    "word": "독양불생",
    "hanja": "獨陽不生",
    "meaning": "홀로서는 아이를 날 수 없듯이 반드시 상대가 있어야 한다는 뜻"
  },
  {
    "id": "idiom-75c41b612095",
    "word": "독장불명",
    "hanja": "獨掌不鳴",
    "meaning": "한 손바닥으로는 소리가 나지 않는 않음. 혼자서는 일하기도 어렵고 둘이 협력하여야 함"
  },
  {
    "id": "idiom-7305d1562c1b",
    "word": "독책지술",
    "hanja": "督責之術",
    "meaning": "조정에서 백성들을 구박하여 심하게 부리는 술책"
  },
  {
    "id": "idiom-f8f50f2e081c",
    "word": "독학고루",
    "hanja": "獨學孤陋",
    "meaning": "혼자 공부한 사람은 견문이 좁아서 정도 (正道〕에 들어가기 어렵다는 말"
  },
  {
    "id": "idiom-74d511284365",
    "word": "독행우우",
    "hanja": "獨行踽踽",
    "meaning": "세상 사람에게 구애됨이 없이 홀로 자기의 뜻을 행함"
  },
  {
    "id": "idiom-fd1d8473e93b",
    "word": "돈수재배",
    "hanja": "頓首再拜",
    "meaning": "머리가 땅에 닿도록 두 번 절함"
  },
  {
    "id": "idiom-2e98aee0d0c1",
    "word": "돈제우주",
    "hanja": "豚蹄盂酒",
    "meaning": "돼지발톱과 술 한 잔이라는 뜻으로 변변치 못한 음식 또는 물건"
  },
  {
    "id": "idiom-1263d2fe9d86",
    "word": "돈제일주",
    "hanja": "豚蹄一酒",
    "meaning": "돼지 발굽과 술 한 잔이라는 말로, 작은 물건으로도 많은 물건을 구하려고 하는 것을 비유한다"
  },
  {
    "id": "idiom-2a890b2a8103",
    "word": "돈책계서",
    "hanja": "豚柵鷄栖",
    "meaning": "돼지우리와 닭의 홰. 즉 촌락의 풍경을 이름"
  },
  {
    "id": "idiom-188312f93e08",
    "word": "돌돌괴사",
    "hanja": "咄咄怪事",
    "meaning": "놀랍고 괴상한 일"
  },
  {
    "id": "idiom-0c697182f28f",
    "word": "돌돌핍인",
    "hanja": "咄咄逼人",
    "meaning": "돌돌은 놀라서 이상히 여기는 소리 또는 모양. 기예 등이 뛰어난 것을 보고 경탄함을 이름"
  },
  {
    "id": "idiom-408541b40bc7",
    "word": "동가지구",
    "hanja": "東家之丘",
    "meaning": "남의 진가를 알지 못함, 사람 보는 눈이 없음"
  },
  {
    "id": "idiom-871ec72e2a70",
    "word": "동가홍상",
    "hanja": "同價紅裳",
    "meaning": "같은 값이면 다홍치마"
  },
  {
    "id": "idiom-fc7c77bcb619",
    "word": "동고동락",
    "hanja": "同苦同樂",
    "meaning": "괴로움과 즐거움을 함께 함"
  },
  {
    "id": "idiom-e6a46fb86278",
    "word": "동공이곡",
    "hanja": "同工異曲",
    "meaning": "표면은 다른데 내용이 똑같다는 뜻으로, 경멸하여 사용하는 경우가 많다"
  },
  {
    "id": "idiom-2cbafaf6be5a",
    "word": "동귀수도",
    "hanja": "同歸殊塗",
    "meaning": "천하의 이치는 귀착이 같으나 도에 따라 다를 수 있음"
  },
  {
    "id": "idiom-c45899314864",
    "word": "동근연지",
    "hanja": "同根連枝",
    "meaning": "같은 뿌리와 잇닿은 나뭇가지. 즉, 兄弟姉妹를 일컫는 말이다"
  },
  {
    "id": "idiom-ad8660ac8cf7",
    "word": "동기상구",
    "hanja": "同氣相求",
    "meaning": "기풍과 뜻을 같이하는 사람은 서로 동류를 찾아 모인다"
  },
  {
    "id": "idiom-e24039f0658e",
    "word": "동기일신",
    "hanja": "同氣一身",
    "meaning": "형제자매는 한 몸과 같음"
  },
  {
    "id": "idiom-65fd2d4b6ac6",
    "word": "동남동녀",
    "hanja": "童男童女",
    "meaning": "사내아이와 계집아이"
  },
  {
    "id": "idiom-2e7f302d4f25",
    "word": "동동촉촉",
    "hanja": "洞洞燭燭",
    "meaning": "매우 공경하고 삼가 조심스러운 모양"
  },
  {
    "id": "idiom-6ea47ba1cfb5",
    "word": "동량지재",
    "hanja": "棟梁之材",
    "meaning": "집의 들보가 될 나무와 같이 한 사회, 한 나라의 중심인물이 될 사람"
  },
  {
    "id": "idiom-0c9a5ef8c484",
    "word": "동문동궤",
    "hanja": "同文同軌",
    "meaning": "천하를 통일하는 것을 뜻함. 同文은 문자를 통일하게 하는 것이고, 同軌는 법을 같게 하는 것"
  },
  {
    "id": "idiom-1fc2aa690814",
    "word": "동문서답",
    "hanja": "東問西答",
    "meaning": "물음과 관계없는 엉뚱한 대답을 함."
  },
  {
    "id": "idiom-f2ad1d2b04cd",
    "word": "동문수학",
    "hanja": "同門修學",
    "meaning": "같은 스승 밑에서 같이 학문을 닦고 배움"
  },
  {
    "id": "idiom-74c9ec17d617",
    "word": "동방화촉",
    "hanja": "洞房華燭",
    "meaning": "혼례를 치른 뒤에 신랑이 신부 방에서 자는 일"
  },
  {
    "id": "idiom-4d39fef86d4e",
    "word": "동병상련",
    "hanja": "同病相憐",
    "meaning": "같은 어려움을 겪는 사람끼리 서로 이해하고 가엾게 여김."
  },
  {
    "id": "idiom-8ff516406e58",
    "word": "동분서주",
    "hanja": "東奔西走",
    "meaning": "부산하게 이리저리 돌아다님"
  },
  {
    "id": "idiom-f5de359e7f69",
    "word": "동빙한설",
    "hanja": "凍氷寒雪",
    "meaning": "얼음이 얼고 눈보라가 치는 추위"
  },
  {
    "id": "idiom-f2de9a31205f",
    "word": "동산고와",
    "hanja": "東山高臥",
    "meaning": "동산의 높은 곳에 누워 있다는 말로, 동산에 은거하며 자유로운 생활을 하는 것을 비유한다"
  },
  {
    "id": "idiom-91534ff12fa1",
    "word": "동상이몽",
    "hanja": "同床異夢",
    "meaning": "같은 잠자리에서 다른 꿈을 꿈. 곧 겉으로는 같이 행동하면서 속으로는 딴생각을 가짐"
  },
  {
    "id": "idiom-b3538539a808",
    "word": "동서불변",
    "hanja": "東西不辨",
    "meaning": "동과 서를 분별하지 못할 정도로 아무것도 모름"
  },
  {
    "id": "idiom-c78c0dc765e8",
    "word": "동선하로",
    "hanja": "冬扇夏爐",
    "meaning": "겨울의 부채와 여름의 화로. 아무 소용없는 물건을 말한다"
  },
  {
    "id": "idiom-b158ae7fd49c",
    "word": "동성상응",
    "hanja": "同聲相應",
    "meaning": "같은 소리는 서로 응하여 어울린다. 의견을 같이 하면 자연히 서로 합치게 된다는 의미"
  },
  {
    "id": "idiom-ba5de4a3995d",
    "word": "동성이속",
    "hanja": "同性異俗",
    "meaning": "사람의 성질은 본래는 같으나 습관에 따라 변함을 뜻함"
  },
  {
    "id": "idiom-8e05067db00e",
    "word": "동심동덕",
    "hanja": "同心同德",
    "meaning": "일치단결된 마음을 뜻함"
  },
  {
    "id": "idiom-1736b6d387a4",
    "word": "동심지언",
    "hanja": "同心之言",
    "meaning": "절친한 친구사이"
  },
  {
    "id": "idiom-989db5a2b6e4",
    "word": "동악상조",
    "hanja": "同惡相助",
    "meaning": "악인은 악을 이루기 위하여 서로 돕는다는 뜻으로 동류끼리의 도움을 이름"
  },
  {
    "id": "idiom-241a040e3d71",
    "word": "동업상구",
    "hanja": "同業相仇",
    "meaning": "같은 업을 경영하는 사람은 서로 배척함을 이름"
  },
  {
    "id": "idiom-70c6efd5694a",
    "word": "동엽봉제",
    "hanja": "桐葉封弟",
    "meaning": "장난삼아 오동나무 잎으로 동생을 諸侯에 封한다는 뜻으로, 제후를 봉하는 일을 말함"
  },
  {
    "id": "idiom-cb9d2c9fed9d",
    "word": "동온하청",
    "hanja": "冬溫夏淸",
    "meaning": "부모를 섬김에 있어, 겨울에는 따뜻하게 여름에는 시원하게 해 드린다는 뜻"
  },
  {
    "id": "idiom-417ccaca287f",
    "word": "동우각마",
    "hanja": "童牛角馬",
    "meaning": "뿔이 없는 송아지와 뿔이 있는 말이라는 뜻으로 도리에 어긋남을 비유한말"
  },
  {
    "id": "idiom-d84439d4a37d",
    "word": "동이불화",
    "hanja": "同而不和",
    "meaning": "겉으로는 동의를 표시하면서도 내심은 그렇지 않음"
  },
  {
    "id": "idiom-196121b5980e",
    "word": "동절최붕",
    "hanja": "棟折催崩",
    "meaning": "대들보가 무너지면 서까래도 무너지듯이 상하관계에서 윗사람이 망하면 아랫사람도 온전치 못하다"
  },
  {
    "id": "idiom-f7f750bf1b1c",
    "word": "동정서벌",
    "hanja": "東征西伐",
    "meaning": "여러 나라를 이리 저리로 쳐서 없앰"
  },
  {
    "id": "idiom-5168916e9419",
    "word": "동족방뇨",
    "hanja": "凍足放尿",
    "meaning": "언 발에 오줌 누기. 그 효력은 없어지고 마침내는 더 나쁘게 될 일을 한다"
  },
  {
    "id": "idiom-df11c65588aa",
    "word": "동주상구",
    "hanja": "同舟相救",
    "meaning": "사람은 알건 모르건 친하건 미워하건 상관없이 위급한 경우를 함께 만나면 서로 도와주게 된다는 의미"
  },
  {
    "id": "idiom-3f604a7938fb",
    "word": "동주제강",
    "hanja": "同舟濟江",
    "meaning": "원수끼리도 한 가지 일을 위해서는 같은 배를 타고 서로 구한다 (=吳越同舟)"
  },
  {
    "id": "idiom-232023e09ecf",
    "word": "동패서상",
    "hanja": "東敗西喪",
    "meaning": "이르는 곳마다 패망하고 실패함"
  },
  {
    "id": "idiom-16d28a1343ea",
    "word": "동호지필",
    "hanja": "董狐之筆",
    "meaning": "권세를 두려워하지 않는 정직한 기록"
  },
  {
    "id": "idiom-190e94bae59c",
    "word": "두남일인",
    "hanja": "斗南一人",
    "meaning": "두남은 북두칠성의 남쪽. 즉, 온 천하에서 제일가는 賢才를 의미한다"
  },
  {
    "id": "idiom-74d61712cbee",
    "word": "두동치활",
    "hanja": "頭童齒豁",
    "meaning": "산에 초목이 없음을 동이라고 하고, 활은 이가 빠져서 구멍이 보임을 이른다. 즉 노인을 형용함"
  },
  {
    "id": "idiom-4614579d5ed1",
    "word": "두문불출",
    "hanja": "杜門不出",
    "meaning": "세상과 인연을 끊고 나가지 않음"
  },
  {
    "id": "idiom-a58cbee7bb08",
    "word": "두소지인",
    "hanja": "斗筲之人",
    "meaning": "한 말 두 되 들이의 대그릇 같은 사람. 즉, 사람의 식견이나 그릇이 좁은 것을 비유"
  },
  {
    "id": "idiom-8e3b160e3a99",
    "word": "두시언해",
    "hanja": "杜詩諺解",
    "meaning": "중국 唐나라 杜甫의 시 전편을 52部로 분류하여 한글로 번역한 詩集"
  },
  {
    "id": "idiom-fa84806181a7",
    "word": "두점방맹",
    "hanja": "杜漸防萌",
    "meaning": "漸은 사물의 처음, 萌은 싹, 애당초 싹이 나오지 못하도록 막아 더 큰 害가 되지 않는다는 의미"
  },
  {
    "id": "idiom-af2de4f1806e",
    "word": "두주불사",
    "hanja": "斗酒不辭",
    "meaning": "말술도 사양하지 않는다는 뜻으로 주량이 대단한 것을 일컫는 말"
  },
  {
    "id": "idiom-f8d91fb1f3bb",
    "word": "득롱망촉",
    "hanja": "得隴望蜀",
    "meaning": "인간의 욕심은 끝이 없음"
  },
  {
    "id": "idiom-83f187eb96b2",
    "word": "득부상부",
    "hanja": "得斧喪斧",
    "meaning": "얻은 도끼나 잃은 도끼나 같다. 득실이 같아서 손해 본 것이 없다"
  },
  {
    "id": "idiom-5de7bfd37863",
    "word": "득어망전",
    "hanja": "得魚忘筌",
    "meaning": "물고기를 잡고 통발을 잊어먹는다"
  },
  {
    "id": "idiom-eb2fb43656c6",
    "word": "득의만면",
    "hanja": "得意滿面",
    "meaning": "뜻한 바를 이루어 기쁜 표정이 얼굴에 가득함"
  },
  {
    "id": "idiom-93b8df19b96b",
    "word": "득의양양",
    "hanja": "得意洋洋",
    "meaning": "만족스런 듯 기뻐하는 모습"
  },
  {
    "id": "idiom-19c9609a41b1",
    "word": "득일망십",
    "hanja": "得一忘十",
    "meaning": "한 가지를 얻고 열 가지를 잃어버림. 기억력이 좋지 못함을 뜻한다"
  },
  {
    "id": "idiom-aa7703589cd5",
    "word": "등고자비",
    "hanja": "登高自卑",
    "meaning": "무슨 일이든 순서가 있음"
  },
  {
    "id": "idiom-44e22b0222e8",
    "word": "등루거제",
    "hanja": "登樓去梯",
    "meaning": "樓上에 오르게 하여 놓고 오르고 나면 사다리를 치운다. 즉, 처음엔 남을 기쁘게 해놓고 뒤에 괴롭게 한다"
  },
  {
    "id": "idiom-0d2a17d175c6",
    "word": "등하불명",
    "hanja": "燈下不明",
    "meaning": "가까이에 있는 일을 오히려 알아차리지 못함."
  },
  {
    "id": "idiom-7cb4f523a8fc",
    "word": "등화가친",
    "hanja": "燈火可親",
    "meaning": "가을밤은 서늘하여 등불을 가까이 두고 글 읽기에 좋다는 말"
  },
  {
    "id": "idiom-1a76d3766172",
    "word": "마각노출",
    "hanja": "馬脚露出",
    "meaning": "간사하게 숨기고 있던 일을 드러내다"
  },
  {
    "id": "idiom-d32d4ce7a9bc",
    "word": "마고소양",
    "hanja": "麻姑搔痒",
    "meaning": "'마고'라는 손톱 긴 선녀가 가려운 데를 긁어 준다는 말로, 일이 뜻대로 됨을 비유한다"
  },
  {
    "id": "idiom-fdf81a311fdc",
    "word": "마고파양",
    "hanja": "麻姑爬痒",
    "meaning": "일이 뜻대로 됨을 의미 (=麻姑搔痒)"
  },
  {
    "id": "idiom-a07d9b8971bc",
    "word": "마부위침",
    "hanja": "磨斧爲針",
    "meaning": "도끼를 갈아 침을 만듦. 꾸준히 노력함 (=磨斧作針)"
  },
  {
    "id": "idiom-b3e1a443b339",
    "word": "마부작침",
    "hanja": "磨斧作針",
    "meaning": "어려운 일이라도 꾸준히 계속하면 언젠가는 이룰 수 있음"
  },
  {
    "id": "idiom-c75783e0506c",
    "word": "마이동풍",
    "hanja": "馬耳東風",
    "meaning": "남의 말이나 충고를 귀담아듣지 않음."
  },
  {
    "id": "idiom-bf74d55d2e68",
    "word": "마중지봉",
    "hanja": "麻中之蓬",
    "meaning": "삼 가운데 자라는 쑥. 좋은 환경의 감화를 받아 자연히 품행이 바르고 곧게 된다는 비유"
  },
  {
    "id": "idiom-415e31ecde9e",
    "word": "마혁과시",
    "hanja": "馬革裹屍",
    "meaning": "옛날에는 전사한 장수의 시체는 말가죽으로 쌌으므로 전쟁에 나가 살아 돌아오지 않겠다는 뜻을 말한다"
  },
  {
    "id": "idiom-7420eed90723",
    "word": "막고야산",
    "hanja": "莫姑野山",
    "meaning": "고야산은 늙지도 죽지도 않는 신선들이 사는 선경으로 전해오고 있다"
  },
  {
    "id": "idiom-544ad25cca5b",
    "word": "막무가내",
    "hanja": "莫無可奈",
    "meaning": "어쩔 도리가 없음"
  },
  {
    "id": "idiom-3d3c680b3bee",
    "word": "막상막하",
    "hanja": "莫上莫下",
    "meaning": "실력에 있어 낫고 못함이 없이 비슷함"
  },
  {
    "id": "idiom-98f6f635c0ec",
    "word": "막역지교",
    "hanja": "莫逆之交",
    "meaning": "뜻이 서로 맞아 지내는 사이가 썩 가까운 벗"
  },
  {
    "id": "idiom-06e1fd7e9bc4",
    "word": "막역지우",
    "hanja": "莫逆之友",
    "meaning": "거역할 수 없는 친한 벗"
  },
  {
    "id": "idiom-3cc9ec5033df",
    "word": "막천석지",
    "hanja": "幕天席地",
    "meaning": "하늘을 장막으로 삼고 땅을 자리를 삼는다는 뜻으로 지기가 웅대함을 비유"
  },
  {
    "id": "idiom-804426f9df4c",
    "word": "만경창파",
    "hanja": "萬頃蒼波",
    "meaning": "한없이 넓고 푸른 바다"
  },
  {
    "id": "idiom-8a97ac81a3d4",
    "word": "만고불변",
    "hanja": "萬古不變",
    "meaning": "오랜 세월을 두고 길이 변하지 않음, 만대불변 (萬代不變)"
  },
  {
    "id": "idiom-85f4fd90821a",
    "word": "만고불후",
    "hanja": "萬古不朽",
    "meaning": "영원히 썩지 아니하고 오래간다"
  },
  {
    "id": "idiom-dd53afbea5fa",
    "word": "만고풍상",
    "hanja": "萬古風霜",
    "meaning": "사는 동안에 겪은 많은 고생"
  },
  {
    "id": "idiom-4f4f80eddd01",
    "word": "만구성비",
    "hanja": "萬口成碑",
    "meaning": "많은 사람의 입이 비를 이룬다"
  },
  {
    "id": "idiom-44d005ddc2de",
    "word": "만권독파",
    "hanja": "萬卷讀破",
    "meaning": "만 권이나 되는 책을 다 읽음. 곧 많은 책을 끝까지 다 읽어 냄"
  },
  {
    "id": "idiom-9cf67c25e161",
    "word": "만단설화",
    "hanja": "萬端說話",
    "meaning": "여러 가지 이야기"
  },
  {
    "id": "idiom-15626560ccc6",
    "word": "만리동풍",
    "hanja": "萬里同風",
    "meaning": "온 천하에 같은 바람이 분다는 뜻으로, 천하가 통일되어 풍속이 같고 태평하다는 말"
  },
  {
    "id": "idiom-27f24fe6014e",
    "word": "만리장천",
    "hanja": "萬里長天",
    "meaning": "아득히 높고 먼 하늘"
  },
  {
    "id": "idiom-3e4609744fbb",
    "word": "만면수색",
    "hanja": "滿面愁色",
    "meaning": "얼굴에 가득 찬 수심"
  },
  {
    "id": "idiom-981e2c7f4c90",
    "word": "만무일실",
    "hanja": "萬無一失",
    "meaning": "실패할 염려도 없고 실패한 적도 없음"
  },
  {
    "id": "idiom-4904c1952985",
    "word": "만사여의",
    "hanja": "萬事如意",
    "meaning": "모든 일이 뜻하는 대로 잘 됨"
  },
  {
    "id": "idiom-e8920b44d7b7",
    "word": "만사일생",
    "hanja": "萬死一生",
    "meaning": "만 번의 죽을 고비에서 살아난다는 말로, 겨우 죽음을 모면하는 것을 뜻한다"
  },
  {
    "id": "idiom-6eff96ce5956",
    "word": "만사형통",
    "hanja": "萬事亨通",
    "meaning": "일이 순탄하게 진행됨"
  },
  {
    "id": "idiom-4be3a96e84d3",
    "word": "만사휴의",
    "hanja": "萬事休矣",
    "meaning": "모든 방법이 헛되게 됨"
  },
  {
    "id": "idiom-44cecdab4cdd",
    "word": "만산홍엽",
    "hanja": "滿山紅葉",
    "meaning": "온 산이 단풍으로 붉게 물듦"
  },
  {
    "id": "idiom-d07a4f501f19",
    "word": "만수무강",
    "hanja": "萬壽無疆",
    "meaning": "수명이 끝이 없음. 長壽를 빌 때 쓰는 말"
  },
  {
    "id": "idiom-1b1ee5ba0e6a",
    "word": "만승지국",
    "hanja": "萬乘之國",
    "meaning": "乘은 군사용 수레. 일만 대의 乘을 낼 수 있는 나라. 큰 나라의 제후 혹은 천자를 뜻한다"
  },
  {
    "id": "idiom-ba1bec548d00",
    "word": "만시지탄",
    "hanja": "晩時之嘆",
    "meaning": "기회를 놓쳐버린 한탄이란 말"
  },
  {
    "id": "idiom-18f5d447983e",
    "word": "만식당육",
    "hanja": "晩食當肉",
    "meaning": "때늦게 먹으면 고기맛과 같다. 배고플 때는 무엇을 먹든지 고기를 먹는 것과 같다는 말이다"
  },
  {
    "id": "idiom-e684dfce0af6",
    "word": "만신창이",
    "hanja": "滿身瘡痍",
    "meaning": "온 몸 이 상처투성이 가 됨. 어떤 사물이 엉망진창이 됨"
  },
  {
    "id": "idiom-5417c28b9a53",
    "word": "만전지책",
    "hanja": "萬全之策",
    "meaning": "조금의 허술함도 없는 완전한 계책"
  },
  {
    "id": "idiom-a7ebc5657bfe",
    "word": "만절필동",
    "hanja": "萬折必東",
    "meaning": "황하의 물이 이리저리 만 번을 굽이돌아도 반드시"
  },
  {
    "id": "idiom-3da5d6b06f3c",
    "word": "만추가경",
    "hanja": "晩秋佳景",
    "meaning": "늦가을의 아름다운 경치"
  },
  {
    "id": "idiom-4ee1798eb40f",
    "word": "만학천봉",
    "hanja": "萬壑千峰",
    "meaning": "많은 골짜기와 산봉우리"
  },
  {
    "id": "idiom-812be4bca43a",
    "word": "만화방창",
    "hanja": "萬化方暢",
    "meaning": "봄날이 되어 만물이 나서 자람"
  },
  {
    "id": "idiom-261787a66b8b",
    "word": "만휘군상",
    "hanja": "萬彙群象",
    "meaning": "우주의 수많은 현상"
  },
  {
    "id": "idiom-91ab60eaf973",
    "word": "말마이병",
    "hanja": "秣馬利兵",
    "meaning": "말에 먹이를 먹이고 칼을 갈아 출병 준비를 한다"
  },
  {
    "id": "idiom-8db21cafa616",
    "word": "망국지음",
    "hanja": "亡國之音",
    "meaning": "정치가 혼란하고 백성들의 마음이 게으르고, 풍기와 기강이 문란하여, 멸망하는 나라의 음악"
  },
  {
    "id": "idiom-ad4185c7cf0f",
    "word": "망극지은",
    "hanja": "罔極之恩",
    "meaning": "다함이 없는 임금이나 부모의 큰 은혜"
  },
  {
    "id": "idiom-2a2266962b45",
    "word": "망년지교",
    "hanja": "忘年之交",
    "meaning": "나이의 차이를 잊고 사귀는 친한 벗. 늘그막에 얻은 어린 친구와의 사귐을 일컫기도 한다"
  },
  {
    "id": "idiom-4e5477aef4d3",
    "word": "망년지우",
    "hanja": "忘年之友",
    "meaning": "나이 차이를 생각하지 않고, 재주와 학문만으로 사귀는 친구"
  },
  {
    "id": "idiom-8d6bf9dad51b",
    "word": "망루탄주",
    "hanja": "網漏呑舟",
    "meaning": "그물이 세면 배도 그 사이로 지나갈 수 있다. 법령이 관대하여 큰 죄를 짓고도 피할 수 있음을 비유"
  },
  {
    "id": "idiom-d735ec622afb",
    "word": "망매해갈",
    "hanja": "望梅解渴",
    "meaning": "曹操가 목이 마른 병사에게 살구 이야기를 하여 자연히 입안에 침이 생겨서 목마름을 풀게 했다"
  },
  {
    "id": "idiom-b82600c057aa",
    "word": "망양득우",
    "hanja": "亡羊得牛",
    "meaning": "양을 잃고 소를 얻는다. 즉 작은 것을 잃고 큰 것을 얻음의 비유"
  },
  {
    "id": "idiom-be49b1f263ab",
    "word": "망양보뢰",
    "hanja": "亡羊補牢",
    "meaning": "양을 잃고서 그 우리를 고친다. 실패한 후에 일을 대비한다. 이미 때가 늦었다"
  },
  {
    "id": "idiom-102ec2939652",
    "word": "망양지탄",
    "hanja": "亡羊之歎",
    "meaning": "잃은 양을 여러 갈래의 길에서 찾지 못하듯, 학문의 길이 여러 갈래여서 못 미침을 탄식"
  },
  {
    "id": "idiom-c5b8f6ee2086",
    "word": "망연자실",
    "hanja": "茫然自失",
    "meaning": "정신이 나가서 흐리멍덩한 모양"
  },
  {
    "id": "idiom-6aaa87e66664",
    "word": "망운지정",
    "hanja": "望雲之情",
    "meaning": "자식이 타향에서 부모를 그리는 정"
  },
  {
    "id": "idiom-d14d80400698",
    "word": "망자계치",
    "hanja": "亡子計齒",
    "meaning": "죽은 자식 나이를 센다는 뜻으로, 이미 지나간 쓸데없는 일을 생각하며 애석하게 생각함"
  },
  {
    "id": "idiom-0dc789f0b825",
    "word": "망자재배",
    "hanja": "芒刺在背",
    "meaning": "芒刺는 가시. 가시를 등에 지고 있다. (등 뒤에 자기가 꺼리고 사람이 있어서 마음이 편하지 않음)"
  },
  {
    "id": "idiom-6e2072c2ad82",
    "word": "망자존대",
    "hanja": "妄自尊大",
    "meaning": "아주 건방지게 자기만 잘났다고 뽐내어 자신을 높이고 남을 업신여김"
  },
  {
    "id": "idiom-a0b0011f79f5",
    "word": "망지소조",
    "hanja": "罔知所措",
    "meaning": "어찌할 바를 모르고 허둥지둥"
  },
  {
    "id": "idiom-17b3c49cfd02",
    "word": "망진막급",
    "hanja": "望塵莫及",
    "meaning": "먼지를 바라보고 미치지 못한다는 말로, 손에 넣지 못하는 것을 뜻한다"
  },
  {
    "id": "idiom-943097b7448a",
    "word": "망천지시",
    "hanja": "亡天之時",
    "meaning": "하늘이 망하려는 것"
  },
  {
    "id": "idiom-d3d8992b5287",
    "word": "망형지교",
    "hanja": "忘形之交",
    "meaning": "신분의 형식에 구애되지 않은 친한 친구"
  },
  {
    "id": "idiom-080d61cb57f7",
    "word": "매검매우",
    "hanja": "賣劍買牛",
    "meaning": "칼을 팔아 소를 사다. 전쟁을 그만두고 농사를 짓다"
  },
  {
    "id": "idiom-0d9310218a0c",
    "word": "매림지갈",
    "hanja": "梅林止渴",
    "meaning": "매화나무 숲에서 갈증을 그쳤다는 말로, 대용품이라도 일시적으로는 소용이 있다는 뜻"
  },
  {
    "id": "idiom-700cc7c595d9",
    "word": "매사마골",
    "hanja": "買死馬骨",
    "meaning": "죽은 말의 뼈를 산다는 뜻으로, 귀중한 것을 손에 넣게 위해 먼저 공을 들이는 것을 말한다"
  },
  {
    "id": "idiom-1882e0fdd14d",
    "word": "매처학자",
    "hanja": "梅妻鶴子",
    "meaning": "매화를 아내로 삼고 학을 자식으로 삼음. 속세를 떠나 유유자적하게 생활하는 것을 비유한다"
  },
  {
    "id": "idiom-eb95420076e8",
    "word": "맥구읍인",
    "hanja": "麥丘邑人",
    "meaning": "맥구읍 의 사람이라는 말로, 노인을 뜻한다"
  },
  {
    "id": "idiom-dbb9f3e68f1f",
    "word": "맥수지탄",
    "hanja": "麥秀之嘆",
    "meaning": "나라를 잃음에 대한 탄식"
  },
  {
    "id": "idiom-5f2c080a0732",
    "word": "맹귀우목",
    "hanja": "盲龜遇木",
    "meaning": "눈먼 거북이가 다행히 물에 뜬 나무를 붙잡게 되었다. 매우 힘든 행운"
  },
  {
    "id": "idiom-e336447809ca",
    "word": "맹모단기",
    "hanja": "孟母斷機",
    "meaning": "학문을 중도에 그만두는 것은 짜고 있는 베를 끊는 것과 같음"
  },
  {
    "id": "idiom-d3edc2dc3578",
    "word": "맹모삼천",
    "hanja": "孟母三遷",
    "meaning": "자녀 교육에는 주변 환경이 중요함을 이르는 말."
  },
  {
    "id": "idiom-baab1238e9d5",
    "word": "맹완단청",
    "hanja": "盲玩丹靑",
    "meaning": "장님의 단청 구경. 보이지 않는 눈으로 단청을 구경해 봤자 아무런 분별이 있을 수 없음"
  },
  {
    "id": "idiom-3eafa06f3c15",
    "word": "맹인모상",
    "hanja": "盲人摸象",
    "meaning": "장님 코끼리 만지기. 사물의 일부만 보고 전체의 결론을 내리는 좁은 견해"
  },
  {
    "id": "idiom-b531cb64ba97",
    "word": "맹인할마",
    "hanja": "盲人瞎馬",
    "meaning": "장님이 애꾸눈 말을 타고 다니다. 위험한 행동을 비유하는 말"
  },
  {
    "id": "idiom-5ef133bfcc4d",
    "word": "맹자정문",
    "hanja": "盲者正門",
    "meaning": "장님이 문을 바로 들어갔다. 우연히 요행수로 성공을 거두었음 (=盲者直門)"
  },
  {
    "id": "idiom-029f6e2b7207",
    "word": "맹자직문",
    "hanja": "盲者直門",
    "meaning": "장님이 문을 바로 들어갔다. 우연히 요행수로 성공을 거두었음 (=盲者正門)"
  },
  {
    "id": "idiom-ce78c4ba3cde",
    "word": "맹호복초",
    "hanja": "猛虎伏草",
    "meaning": "영웅은 일시적으로 숨어 있지만 언젠가는 세상에 드러나게 된다는 말"
  },
  {
    "id": "idiom-0a640eea6d29",
    "word": "맹호위서",
    "hanja": "猛虎爲鼠",
    "meaning": "범도 위엄을 잃게 되면 쥐와 같다"
  },
  {
    "id": "idiom-75d0271c8a09",
    "word": "면벽구년",
    "hanja": "面壁九年",
    "meaning": "고승 달마가 산중에서 구년간 벽을 대하고 앉아 수도하여 마침내 형태가 돌 속으로 들어갔다"
  },
  {
    "id": "idiom-ab0f1cd6535e",
    "word": "면종복배",
    "hanja": "面從腹背",
    "meaning": "앞에서는 순종하는 체하고 돌아서는 딴 마음을 먹음"
  },
  {
    "id": "idiom-0f4fd8cf6a42",
    "word": "멸사봉공",
    "hanja": "滅私奉公",
    "meaning": "사를 버리고 공을 위하여 힘써 일함"
  },
  {
    "id": "idiom-d5bef5795dc2",
    "word": "명경고현",
    "hanja": "明鏡高懸",
    "meaning": "높게 매달려 있는 맑은 거울. 시비를 분명하게 따져 판단하는 公正無私한 법관을 비유함"
  },
  {
    "id": "idiom-41137727ae5b",
    "word": "명경지수",
    "hanja": "明鏡止水",
    "meaning": "고요하고 잔잔한 마음"
  },
  {
    "id": "idiom-cd63160350fe",
    "word": "명명백백",
    "hanja": "明明白白",
    "meaning": "아주 명백함"
  },
  {
    "id": "idiom-6f1a3cdfdff7",
    "word": "명모호치",
    "hanja": "明眸皓齒",
    "meaning": "밝은 눈동자와 흰 새하얀 이의 미인을 형용하는 말"
  },
  {
    "id": "idiom-4dce51585f33",
    "word": "명불허전",
    "hanja": "名不虛傳",
    "meaning": "명예는 헛되이 전하지 않는다는 뜻으로, 명예가 널리 퍼짐은 그만한 실상이 있어 퍼진다는 말"
  },
  {
    "id": "idiom-bfc32bea7624",
    "word": "명실상부",
    "hanja": "名實相符",
    "meaning": "이름이나 명성과 실제 내용이 서로 들어맞음."
  },
  {
    "id": "idiom-954bcc056f2e",
    "word": "명심불망",
    "hanja": "銘心不忘",
    "meaning": "마음에 새기어 잊지 않음"
  },
  {
    "id": "idiom-5707d2bacb64",
    "word": "명야복야",
    "hanja": "命也福也",
    "meaning": "연거푸 생기는 행복"
  },
  {
    "id": "idiom-ea7b4fa7d21a",
    "word": "명약관화",
    "hanja": "明若觀火",
    "meaning": "불을 보듯이 환함"
  },
  {
    "id": "idiom-c69b23e5dbaa",
    "word": "명재경각",
    "hanja": "命在頃刻",
    "meaning": "거의 죽게 되어서 목숨이 곧 넘어갈 지경에 이름"
  },
  {
    "id": "idiom-669d2ab20d7f",
    "word": "명주각투",
    "hanja": "明珠闇投",
    "meaning": "夜光珠를 어두운 밤중에 집어 던진다. 귀한 보물도 禮를 갖추어서 주지 않으면 도리어 원한을 사게 됨"
  },
  {
    "id": "idiom-debf4a4b8021",
    "word": "명주암투",
    "hanja": "明珠暗投",
    "meaning": "밤에 빛나는 구슬 夜光珠를 어두운 밤중에 집어 던진다. (=明珠闇投)"
  },
  {
    "id": "idiom-ed7100af5e2a",
    "word": "명철보신",
    "hanja": "明哲保身",
    "meaning": "사리에 따라 나옴과 물러남을 어긋나지 않게 함. 요령 있게 처세를 잘하는 것"
  },
  {
    "id": "idiom-5381cc5f44e2",
    "word": "모수자천",
    "hanja": "毛遂自薦",
    "meaning": "趙나라 平原君이 楚나라에 구원요청을 위하여 使者를 물색 중에 毛遂가 自身을 스스로 薦擧함"
  },
  {
    "id": "idiom-e587faacf4ac",
    "word": "모순당착",
    "hanja": "矛盾撞着",
    "meaning": "앞뒤의 이치가 서로 맞지 않음 (=自家撞着)"
  },
  {
    "id": "idiom-2954dcaf54e6",
    "word": "목경지환",
    "hanja": "木梗之患",
    "meaning": "나무인형의 근심이라는 말로, 타향에서 객사하여 돌아오는 것을 뜻한다"
  },
  {
    "id": "idiom-039e01f9e98a",
    "word": "목불식정",
    "hanja": "目不識丁",
    "meaning": "낫 놓고 기역자도 모름"
  },
  {
    "id": "idiom-8a88895ba581",
    "word": "목불인견",
    "hanja": "目不忍見",
    "meaning": "차마 눈뜨고 볼 수 없는 참상이나 꼴 볼견"
  },
  {
    "id": "idiom-3bc800d031ff",
    "word": "목식이시",
    "hanja": "目食耳視",
    "meaning": "음식물을 보기 좋게 차려서 맛은 상관없이 눈에만 들게 함 (겉치레만을 취한 생활이 헛된 사치)"
  },
  {
    "id": "idiom-3983d0d0e9b8",
    "word": "목인석심",
    "hanja": "木人石心",
    "meaning": "의지가 굳어 어떠한 유혹에도 마음이 흔들리지 않는 사람"
  },
  {
    "id": "idiom-87882dd9383a",
    "word": "목후이관",
    "hanja": "沐猴而冠",
    "meaning": "의관은 갖추었으나 사람답지 못한 것. (沐猴는 원숭이)"
  },
  {
    "id": "idiom-1469e7b28229",
    "word": "몽매난망",
    "hanja": "夢寐難忘",
    "meaning": "꿈에도 그리워 잊기가 어려움"
  },
  {
    "id": "idiom-1481f1c4ff73",
    "word": "몽매지간",
    "hanja": "夢寐之間",
    "meaning": "자는 동안, 꿈을 꾸는 동안. 즉, 자나 깨나"
  },
  {
    "id": "idiom-32cefcf3aca4",
    "word": "묘기속출",
    "hanja": "妙技續出",
    "meaning": "교묘한 기술과 재주가 잇달아 나옴"
  },
  {
    "id": "idiom-18fbbb94203e",
    "word": "묘두현령",
    "hanja": "猫頭縣鈴",
    "meaning": "고양이 목에 방울 달기라는 뜻으로 실행할 수 없는 헛 이론을 일컬음 (=猫項懸鈴)"
  },
  {
    "id": "idiom-28aa895d873f",
    "word": "묘시파리",
    "hanja": "猫視跛履",
    "meaning": "애꾸가 보려 하고 절름발이가 걸으려 한다. (분수에 맞지 않은 일을 하면 화가 미친다는 말)"
  },
  {
    "id": "idiom-e77547a9863a",
    "word": "묘항현령",
    "hanja": "猫項懸鈴",
    "meaning": "고양이 목에 방울달기. 실행하지 못할 일을 공연히 의논만 함. (=猫頭縣鈴)"
  },
  {
    "id": "idiom-7acac784ef2a",
    "word": "묘호류견",
    "hanja": "描虎類犬",
    "meaning": "호랑이를 그리려다 실패하여 개와 비슷하게 되었다. 높은 뜻을 갖고 어떤 일을 성취하려다가 중도에 그침"
  },
  {
    "id": "idiom-41d0606cd125",
    "word": "무고지민",
    "hanja": "無告之民",
    "meaning": "고아나 과부, 늙은이처럼 어려운 백성"
  },
  {
    "id": "idiom-81a5ac6d787d",
    "word": "무골호인",
    "hanja": "無骨好人",
    "meaning": "아주 순하여 남의 비위에 두루 맞는 사람"
  },
  {
    "id": "idiom-753ce5d4e49f",
    "word": "무궁무진",
    "hanja": "無窮無盡",
    "meaning": "끝이 없고 다함이 없다"
  },
  {
    "id": "idiom-8bab5cfaf804",
    "word": "무근지설",
    "hanja": "無根之說",
    "meaning": "근거 없는 이야기. 헛소문"
  },
  {
    "id": "idiom-2832f0761c60",
    "word": "무념무상",
    "hanja": "無念無想",
    "meaning": "무아의 경지에 들어가 아무것도 생각하지 않는 것"
  },
  {
    "id": "idiom-b721e7b078c3",
    "word": "무릉도원",
    "hanja": "武陵桃源",
    "meaning": "신선이 살았다는 전설적인 중국의 명승지를 일컫는 말로 곧 속세를 떠난 별천지"
  },
  {
    "id": "idiom-8ae98a7e7555",
    "word": "무망지복",
    "hanja": "毋望之福",
    "meaning": "바라지 않아도 자연히 들어오게 되는 행복"
  },
  {
    "id": "idiom-bf7dc295cdee",
    "word": "무면도강",
    "hanja": "無面渡江",
    "meaning": "실패하고 고향에 돌아갈 면목이 없다"
  },
  {
    "id": "idiom-d28a00bdd99e",
    "word": "무병자구",
    "hanja": "無病自灸",
    "meaning": "질병이 없는데 스스로 뜸질을 한다는 말로, 불필요한 노력을 하여 정력을 낭비하는 것을 뜻함"
  },
  {
    "id": "idiom-2ccf1e65ea34",
    "word": "무불간섭",
    "hanja": "無不干涉",
    "meaning": "함부로 남의 일에 간섭함"
  },
  {
    "id": "idiom-dfaeac32c0f0",
    "word": "무불통지",
    "hanja": "無不通知",
    "meaning": "무슨 일이든 모르는 것이 없음. (=無所不知)"
  },
  {
    "id": "idiom-06406e46815a",
    "word": "무사자통",
    "hanja": "無師自通",
    "meaning": "일정한 스승이 없이 스스로 연구하고 깨우쳐 알아냄"
  },
  {
    "id": "idiom-dd98f55f1f7b",
    "word": "무산지몽",
    "hanja": "巫山之夢",
    "meaning": "남녀간의 밀회나 정교를 의미"
  },
  {
    "id": "idiom-2e148e061c66",
    "word": "무소부지",
    "hanja": "無所不知",
    "meaning": "알지 못하는 바가 없다. 매우 博學多識함"
  },
  {
    "id": "idiom-7618906c698c",
    "word": "무소불위",
    "hanja": "無所不爲",
    "meaning": "못할 것이 없음"
  },
  {
    "id": "idiom-0c4b63ee79a3",
    "word": "무아도취",
    "hanja": "無我陶醉",
    "meaning": "즐기거나 좋아하는 것에 정신이 쏠려 취하다시피 되어 자신을 잊어버리고 있는 상태 無我之境"
  },
  {
    "id": "idiom-8ea7229d27cb",
    "word": "무아지경",
    "hanja": "無我之境",
    "meaning": "불교용어 정신이 한쪽에 통일되어 나를 잇고 있는 경지"
  },
  {
    "id": "idiom-98f36f2f60e7",
    "word": "무용지물",
    "hanja": "無用之物",
    "meaning": "쓸모없는 물건"
  },
  {
    "id": "idiom-adab07f55a5f",
    "word": "무용지용",
    "hanja": "無用之用",
    "meaning": "언뜻 보아 별 쓸모없는 것으로 생각되는 것이 도리어 크게 쓰임"
  },
  {
    "id": "idiom-f81cce7aaa75",
    "word": "무위도식",
    "hanja": "無爲徒食",
    "meaning": "아무 하는 일 없이 먹기만 함"
  },
  {
    "id": "idiom-8b517d1c1ac6",
    "word": "무위이치",
    "hanja": "無爲而治",
    "meaning": "인위적으로 뭔가를 하려고 꾀하지 않으면서도 자연스럽게 잘 다스림"
  },
  {
    "id": "idiom-e64c7673139e",
    "word": "무위이화",
    "hanja": "無爲而化",
    "meaning": "애써 공들이지 않아도 스스로 변하여 잘 이루어짐"
  },
  {
    "id": "idiom-5e75aa012e9f",
    "word": "무위자연",
    "hanja": "無爲自然",
    "meaning": "자연에 맡겨 부질없는 행위를 하지 않음, 사람의 힘이 더해지지 않은 본디 그대로의 자연"
  },
  {
    "id": "idiom-549bb991d178",
    "word": "무의무탁",
    "hanja": "無依無托",
    "meaning": "의지하고 의탁할 곳이 없음"
  },
  {
    "id": "idiom-04d71e554d45",
    "word": "무인지경",
    "hanja": "無人之境",
    "meaning": "사람이라고는 전혀 없는 곳이라는 말로 ,아무 거칠 것이 없는 판"
  },
  {
    "id": "idiom-c0e3bc30664a",
    "word": "무장공자",
    "hanja": "無腸公子",
    "meaning": "담력이나 기개가 없는 사람을 비웃어 하는 말. 게의 별칭"
  },
  {
    "id": "idiom-524b5e416b3c",
    "word": "무지몽매",
    "hanja": "無知蒙昧",
    "meaning": "아는 것이 없이 어리석음"
  },
  {
    "id": "idiom-56820c794dfa",
    "word": "무편무당",
    "hanja": "無偏無黨",
    "meaning": "어느 한 쪽에 기울지 않고 중정 (中正), 공평 (公平)함"
  },
  {
    "id": "idiom-657e1a3f5585",
    "word": "무학지배",
    "hanja": "無學之輩",
    "meaning": "배운 것이 없는 무식한 인간이라는 뜻의 모욕적인 말"
  },
  {
    "id": "idiom-cfc67894748d",
    "word": "무혈혁명",
    "hanja": "無血革命",
    "meaning": "피를 흘리지 아니하고 평화스러운 수단으로 이루는 혁명"
  },
  {
    "id": "idiom-d9687f0cdf57",
    "word": "묵묵부답",
    "hanja": "黙黙不答",
    "meaning": "입을 다문 채 아무 대답도 하지 않음"
  },
  {
    "id": "idiom-eac07786deff",
    "word": "묵자비염",
    "hanja": "墨子悲染",
    "meaning": "묵자가 물들이는 것을 슬퍼한다는 말 (사람은 습관에 따라 그 성품의 좋고 나쁨이 결정된다)"
  },
  {
    "id": "idiom-c9cd861b29ad",
    "word": "묵적지수",
    "hanja": "墨翟之守",
    "meaning": "자기 의견을 끝까지 지킴, 융통성이 없음"
  },
  {
    "id": "idiom-87e05224cd22",
    "word": "문경지교",
    "hanja": "刎頸之交",
    "meaning": "대신 목을 내주어도 좋을 정도로 친한 친구의 사귐"
  },
  {
    "id": "idiom-119eb95b624d",
    "word": "문과식비",
    "hanja": "文過飾非",
    "meaning": "허물도 꾸미고 잘못도 꾸민다. 잘못이 있음에도 불구하고 뉘우침도 없이 숨길 뿐 아니라 도리어 외면하고 도리어 잘난 체함"
  },
  {
    "id": "idiom-f3d6e878c868",
    "word": "문무숭상",
    "hanja": "文武崇尙",
    "meaning": "학문과 무예를 다같이 높이어 숭상함"
  },
  {
    "id": "idiom-2d9232e370c3",
    "word": "문방사우",
    "hanja": "文房四友",
    "meaning": "종이, 붓, 먹, 벼루"
  },
  {
    "id": "idiom-5e2b346fff0a",
    "word": "문일지십",
    "hanja": "聞一知十",
    "meaning": "하나를 듣고 열을 미루어 앎. 곧 지극히 총명함. (이 말은 논어公冶長篇에 나오는 말임)"
  },
  {
    "id": "idiom-2b7e1ab35e5b",
    "word": "문전걸식",
    "hanja": "門前乞食",
    "meaning": "집집이 돌아다니며 밥을 구걸함"
  },
  {
    "id": "idiom-00df71576210",
    "word": "문전성시",
    "hanja": "門前成市",
    "meaning": "권세가의 문 앞이 방문객으로 몹시 붐빔"
  },
  {
    "id": "idiom-aab72ed7ab05",
    "word": "문전옥답",
    "hanja": "門前沃畓",
    "meaning": "집 앞 가까이에 있는 좋은 논, 곧 많은 재산을 일컫는 말"
  },
  {
    "id": "idiom-00403ee7243c",
    "word": "문전작라",
    "hanja": "門前雀羅",
    "meaning": "문 앞에 새 그물을 칠 수 있을 정도로 방문객이 한산함"
  },
  {
    "id": "idiom-5cdffae28538",
    "word": "물경소사",
    "hanja": "勿輕小事",
    "meaning": "조그만 일을 가볍게 여기지 말라. 작은 일에도 정성을 다하라"
  },
  {
    "id": "idiom-73a5c1057858",
    "word": "물경지교",
    "hanja": "勿頸之交",
    "meaning": "목이 잘리는 한이 있어도 마음을 변치 않고 사귀는 친한 사이"
  },
  {
    "id": "idiom-f685efcc0193",
    "word": "물부충생",
    "hanja": "物腐蟲生",
    "meaning": "내부에 약점이 생기면 곧 외부의 침입이 있게 된다는 뜻"
  },
  {
    "id": "idiom-2722b09492da",
    "word": "물심양면",
    "hanja": "物心兩面",
    "meaning": "물질적인 면과 정신적인 면"
  },
  {
    "id": "idiom-2d037870a03e",
    "word": "물심일여",
    "hanja": "物心一如",
    "meaning": "마음과 형체가 구분됨이 없이 하나로 일치한 상태"
  },
  {
    "id": "idiom-14d3e221e7a2",
    "word": "물아일체",
    "hanja": "物我一體",
    "meaning": "물건과 내가 일치함. 物과 我, 즉, 物界 心界가 한데 어울려 한 덩어리가 됨을 일컬음"
  },
  {
    "id": "idiom-b0f4641234fb",
    "word": "물외한인",
    "hanja": "物外閒人",
    "meaning": "세상의 시끄러움에서 벋어나 한가하게 지내는 사람"
  },
  {
    "id": "idiom-12406e21588e",
    "word": "미관말직",
    "hanja": "微官末職",
    "meaning": "지위가 아주 낮은 벼슬"
  },
  {
    "id": "idiom-311ae4a80c46",
    "word": "미도불원",
    "hanja": "迷道不遠",
    "meaning": "그리 멀지 않은 곳에서 길을 헤맨다. 멀지 않다는 뜻. 즉, 곧 본 길을 찾게 됨을 의미"
  },
  {
    "id": "idiom-936484a4e07e",
    "word": "미래지향",
    "hanja": "未來指向",
    "meaning": "장차 올 체험에 주목하여 이것을 직관적으로 장차 올 것으로서 의식함"
  },
  {
    "id": "idiom-84308aeef08a",
    "word": "미봉지책",
    "hanja": "彌縫之策",
    "meaning": "근본 해결 없이 당장의 문제만 임시로 덮는 방책."
  },
  {
    "id": "idiom-d5bfdbed1a21",
    "word": "미사여구",
    "hanja": "美辭麗句",
    "meaning": "아름다운 말로 꾸민 듣기 좋은 글귀. 외관만을 꾸민 성의 없는 말의 의미"
  },
  {
    "id": "idiom-0b33011f6183",
    "word": "미생지신",
    "hanja": "尾生之信",
    "meaning": "약속을 굳게 지킴, 고지식하여 융통성이 없음"
  },
  {
    "id": "idiom-1cfdf03b509f",
    "word": "미신타파",
    "hanja": "迷信打破",
    "meaning": "미신을 믿는 일을 깨뜨려 버림"
  },
  {
    "id": "idiom-b028896d946b",
    "word": "미연지전",
    "hanja": "未然之前",
    "meaning": "아직 그렇게 되지 아니함"
  },
  {
    "id": "idiom-33d7d19bd728",
    "word": "미인박명",
    "hanja": "美人薄命",
    "meaning": "미인은 흔히 불행하거나 병약하여 요절하는 일이 많다는 말"
  },
  {
    "id": "idiom-d629b2463628",
    "word": "미풍양속",
    "hanja": "美風良俗",
    "meaning": "아름답고 좋은 풍속"
  },
  {
    "id": "idiom-8ac45aa96c4a",
    "word": "밀운불우",
    "hanja": "密雲不雨",
    "meaning": "구름이 끼어 있으나 비가 오지 않음. 어떤 일의 징조만 있고 그 일은 이루어지지 않음"
  },
  {
    "id": "idiom-54191c2c16cc",
    "word": "박물군자",
    "hanja": "博物君子",
    "meaning": "온갖 사물에 대하여 견문이 썩 넓은 사람"
  },
  {
    "id": "idiom-53efc50ec2c1",
    "word": "박빙여리",
    "hanja": "薄氷如履",
    "meaning": "엷은 얼음을 밟듯이 세상의 처세에 조심함"
  },
  {
    "id": "idiom-ef38567b1a20",
    "word": "박옥혼금",
    "hanja": "璞玉渾金",
    "meaning": "璞玉은 갈고 닦지 않은 옥, 渾金은 아직 제련하지 않은 금. 곧 검소하고 질박한 사람을 칭찬하는 말"
  },
  {
    "id": "idiom-fa40d2a123f2",
    "word": "박이부정",
    "hanja": "博而不精",
    "meaning": "넓게 알고 있으나 자세하지 못함"
  },
  {
    "id": "idiom-fae7f446d037",
    "word": "박장대소",
    "hanja": "拍掌大笑",
    "meaning": "손바닥을 치면서 크게 웃음"
  },
  {
    "id": "idiom-b8737aa096bb",
    "word": "박주산채",
    "hanja": "薄酒山菜",
    "meaning": "맛이 변변치 않은 술과 산나물. 자기가 내는 술과 안주의 겸칭"
  },
  {
    "id": "idiom-723ea1f84244",
    "word": "박지약행",
    "hanja": "薄志弱行",
    "meaning": "뜻과 행실이 약하여 어려운 일을 견디지 못함"
  },
  {
    "id": "idiom-4df4a2701011",
    "word": "박학다식",
    "hanja": "博學多識",
    "meaning": "학문이 넓고 식견이 많음"
  },
  {
    "id": "idiom-9f300d4cb8ae",
    "word": "반계곡경",
    "hanja": "盤溪曲徑",
    "meaning": "정당하고 평탄한 방법으로 하지 아니하고 그릇되고 억지스럽게 함을 이르는 말"
  },
  {
    "id": "idiom-028dd013526c",
    "word": "반근착절",
    "hanja": "盤根錯節",
    "meaning": "굽은 뿌리와 엉클어진 마디라는 뜻으로, 뒤얽혀 처리하기 어려운 일을 의미"
  },
  {
    "id": "idiom-900355940e9d",
    "word": "반도이폐",
    "hanja": "半途而廢",
    "meaning": "일을 도모하다가 중도에 그만둠"
  },
  {
    "id": "idiom-df28370a5fbc",
    "word": "반면교사",
    "hanja": "反面敎師",
    "meaning": "다른 사람이나 사물의 부정적인 측면에서 가르침을 얻음을 이르는 말"
  },
  {
    "id": "idiom-d2727e907620",
    "word": "반면지교",
    "hanja": "半面之交",
    "meaning": "일면짜리도 못되는 교분 (겨우 알기만 함 아직 교제가 긴밀하지 못함)"
  },
  {
    "id": "idiom-b40e5117f720",
    "word": "반면지분",
    "hanja": "半面之分",
    "meaning": "얼굴을 반만 아는 사이. (교제가 아직 두텁지 못한 사이)"
  },
  {
    "id": "idiom-4f73c3258897",
    "word": "반면지식",
    "hanja": "半面之識",
    "meaning": "얼굴을 반만 아는 사이. 서로 알아보지만 친하게 지내지는 않는 사이"
  },
  {
    "id": "idiom-6a2088c3d3d2",
    "word": "반목질시",
    "hanja": "反目嫉視",
    "meaning": "눈을 흘기면서 밉게 봄"
  },
  {
    "id": "idiom-0f531b273d53",
    "word": "반문농부",
    "hanja": "班門弄斧",
    "meaning": "魯班의 집 문 앞에서 도끼를 솜씨 있게 다룬다.'는 뜻으로, (재주꾼 앞에서 잘난 체함.)"
  },
  {
    "id": "idiom-c25fc1c090e2",
    "word": "반생반사",
    "hanja": "半生半死",
    "meaning": "거의 죽게 되어서 죽을는지 살는지 알 수 없는 지경에 이름"
  },
  {
    "id": "idiom-32a96f97060e",
    "word": "반승반속",
    "hanja": "半僧半俗",
    "meaning": "중도 아니고 속인도 아니다. 분명하게 이름을 붙일 수 없는 것"
  },
  {
    "id": "idiom-c637ca265dce",
    "word": "반식재상",
    "hanja": "伴食宰相",
    "meaning": "無爲徒食으로 자리만 차지하고 있는 무능한 대신을 비꼬아 말함"
  },
  {
    "id": "idiom-7f14048011f4",
    "word": "반신반의",
    "hanja": "半信半疑",
    "meaning": "믿는 마음과 의심하는 마음이 함께 있음."
  },
  {
    "id": "idiom-04ede8d9ccf1",
    "word": "반신역당",
    "hanja": "反臣逆當",
    "meaning": "동탁이 낙양 부호들의 금전을 약탈하기 위해 여포로 하여금 反臣逆當 깃발을 들고 다니라고 하였다"
  },
  {
    "id": "idiom-4220a19efee3",
    "word": "반의지희",
    "hanja": "斑衣之戱",
    "meaning": "지극한 효성"
  },
  {
    "id": "idiom-8b6d7edcc246",
    "word": "반포보은",
    "hanja": "反哺報恩",
    "meaning": "자식이 부모가 길러준 은혜에 보답하는 것"
  },
  {
    "id": "idiom-10a1947b649f",
    "word": "반포지효",
    "hanja": "反哺之孝",
    "meaning": "자식이 자라서 부모를 봉양함"
  },
  {
    "id": "idiom-c0fd0c6d22ad",
    "word": "발본색원",
    "hanja": "拔本塞源",
    "meaning": "폐단이 되는 근원을 아주 뽑아 버림"
  },
  {
    "id": "idiom-005ae9cf4a16",
    "word": "발분망식",
    "hanja": "發憤忘食",
    "meaning": "한 가지 일을 성취하기 위해 밥 생각도 잊고 바삐 돌아다님"
  },
  {
    "id": "idiom-ae5f217e5f66",
    "word": "발산개세",
    "hanja": "拔山蓋世",
    "meaning": "산을 뽑고 세상을 덮음. 곧, 기개가 웅대함 (=力拔山兮起蓋世)"
  },
  {
    "id": "idiom-6214fb263aa2",
    "word": "발췌초록",
    "hanja": "拔萃抄錄",
    "meaning": "여럿 가운데 뛰어난 것을 뽑아 간단히 적어 둔 것"
  },
  {
    "id": "idiom-43cfd0d4baab",
    "word": "발호장군",
    "hanja": "跋扈將軍",
    "meaning": "양호가 통발을 뛰어넘어 도망친 큰 물고기처럼 방자함을 비유 (폭풍을 의미한다)"
  },
  {
    "id": "idiom-5b616421c317",
    "word": "방방곡곡",
    "hanja": "坊坊曲曲",
    "meaning": "어느 한 군데도 빼놓지 않은 모든 곳. 到處"
  },
  {
    "id": "idiom-e5aa7294eb97",
    "word": "방약무인",
    "hanja": "傍若無人",
    "meaning": "제 세상인 듯 함부로 날뜀"
  },
  {
    "id": "idiom-6ff6cc571d3d",
    "word": "방예원조",
    "hanja": "方枘圓鑿",
    "meaning": "모난 자루와 둥근 구멍이 맞지 않는다는 뜻으로, 사물이 서로 맞지 아니함을 비유한 말"
  },
  {
    "id": "idiom-af76515ebc3f",
    "word": "방장부절",
    "hanja": "方長不折",
    "meaning": "한창 자라는 나무는 꺾지 않는다. (잘 되어 가는 일을 방해하지 말라는 의미)"
  },
  {
    "id": "idiom-1a770f768099",
    "word": "방저원개",
    "hanja": "方底圓蓋",
    "meaning": "네모난 바닥에 둥근 뚜껑. 사물이 서로 맞지 않은 것"
  },
  {
    "id": "idiom-d11d74336c25",
    "word": "방촌이란",
    "hanja": "方寸已亂",
    "meaning": "마음이 이미 혼란스러워졌다는 말로, 마음이 흔들린 상태에서는 어떠한 일도 계속할 수 없음"
  },
  {
    "id": "idiom-a6dd8ef04cf7",
    "word": "방휼지쟁",
    "hanja": "蚌鷸之爭",
    "meaning": "조개와 도요새의 다툼. 서로 버티고 물러서지 않고 싸움"
  },
  {
    "id": "idiom-a22e19989a2d",
    "word": "배반낭자",
    "hanja": "杯盤狼藉",
    "meaning": "술 마시고 한창 노는 모양"
  },
  {
    "id": "idiom-274d3dc9d045",
    "word": "배수지진",
    "hanja": "背水之陣",
    "meaning": "필승을 기하여 목숨을 걸고 싸움"
  },
  {
    "id": "idiom-ec990f45dd95",
    "word": "배암투명",
    "hanja": "背暗投明",
    "meaning": "어두운 곳을 등지고 밝은 곳으로 나오다. 그른 길을 버리고 바른 길로 나아가다"
  },
  {
    "id": "idiom-5ec7262e31c6",
    "word": "배은망덕",
    "hanja": "背恩忘德",
    "meaning": "은혜를 잊고 도리어 배반함"
  },
  {
    "id": "idiom-9aac04ac5592",
    "word": "배중사영",
    "hanja": "杯中蛇影",
    "meaning": "쓸데없는 의심을 품고 스스로 고민함"
  },
  {
    "id": "idiom-623ab55da1b0",
    "word": "배회고면",
    "hanja": "徘徊顧眄",
    "meaning": "목적 없이 이리저리 거닐면서 여기저기 기웃거리다"
  },
  {
    "id": "idiom-9876c3504a35",
    "word": "백가쟁명",
    "hanja": "百家爭鳴",
    "meaning": "여러 사람이 서로 자기주장을 내세우는 일"
  },
  {
    "id": "idiom-572a85330526",
    "word": "백골난망",
    "hanja": "白骨難忘",
    "meaning": "백골이 되더라도 잊기 어려움을 뜻 하는 말로, 입은 은혜가 커 결코 잊지 않겠다는 의미"
  },
  {
    "id": "idiom-6d629de5e6bf",
    "word": "백구과극",
    "hanja": "白駒過隙",
    "meaning": "흰 망아지가 빨리 달리는 것을 문틈으로 본다.인생과 세월의 덧없고 짧음 (=白駒之過郤)"
  },
  {
    "id": "idiom-0bf24c41a0a2",
    "word": "백년가기",
    "hanja": "百年佳期",
    "meaning": "젊은 남녀가 한 평생을 함께 살자는 언약"
  },
  {
    "id": "idiom-7fa86e6d4403",
    "word": "백년가약",
    "hanja": "百年佳約",
    "meaning": "젊은 남녀가 한 평생을 함께 살자는 언약"
  },
  {
    "id": "idiom-441dd6f2ade8",
    "word": "백년대계",
    "hanja": "百年大計",
    "meaning": "먼 뒷날까지 걸친 큰 계획"
  },
  {
    "id": "idiom-8a6447580f12",
    "word": "백년지계",
    "hanja": "百年之計",
    "meaning": "백 년 동안의 계획. 곧, 오랜 세월을 위한 계획"
  },
  {
    "id": "idiom-e19e18794690",
    "word": "백년하청",
    "hanja": "百年河淸",
    "meaning": "아무리 기다려도 가망 없는 사태가 바로 잡히기 어려움"
  },
  {
    "id": "idiom-ef4cf915aabd",
    "word": "백년해로",
    "hanja": "百年偕老",
    "meaning": "부부가 화합하여 함께 늙도록 살아감"
  },
  {
    "id": "idiom-3e4ebcd9495e",
    "word": "백두여신",
    "hanja": "白頭如新",
    "meaning": "오랫동안 사귀어도 서로 상대방의 재능을 이해하지 못하면 새로 사귄 벗과 조금도 다를 바가 없다"
  },
  {
    "id": "idiom-0588248ece9a",
    "word": "백락일고",
    "hanja": "伯樂一顧",
    "meaning": "남이 자기 재능을 알고 잘 대우함"
  },
  {
    "id": "idiom-d2b9c1495df3",
    "word": "백룡어복",
    "hanja": "白龍魚服",
    "meaning": "흰 용이 물고기의 옷을 입는다. (신분이 높은 사람이 서민의 허름한 옷으로 갈아입고 미행함)"
  },
  {
    "id": "idiom-260947b951f1",
    "word": "백리부미",
    "hanja": "百里負米",
    "meaning": "백리나 떨어진 먼 곳으로 쌀을 진다는 말로 (부모의 봉양을 잘하는 것을 뜻함)"
  },
  {
    "id": "idiom-fa76c0b6a8a9",
    "word": "백리지재",
    "hanja": "百里之才",
    "meaning": "재능이 뛰어난 사람을 일컫는 말. 노숙이 방통을 유비에게 추천하면서 방통을 이에 비유하였다"
  },
  {
    "id": "idiom-656a6db80967",
    "word": "백마비마",
    "hanja": "白馬非馬",
    "meaning": "백마는 말이 아니다'라는 말로, 억지 논리를 비유하여 이르는 말"
  },
  {
    "id": "idiom-1fba6fe92f32",
    "word": "백면서생",
    "hanja": "白面書生",
    "meaning": "글만 읽고 세상일에 경험이 없는 사람"
  },
  {
    "id": "idiom-807d022dcd9b",
    "word": "백발백중",
    "hanja": "百發百中",
    "meaning": "총이나 활을 쏘면 어김없이 맞음. 또는, 예상한 일이 꼭 들어맞음"
  },
  {
    "id": "idiom-90ba0998336a",
    "word": "백설난무",
    "hanja": "白雪亂舞",
    "meaning": "휜 눈이 어지러이 춤을 춤. 눈이 흩날리는 모양의 비유"
  },
  {
    "id": "idiom-e9304cb599f8",
    "word": "백세지사",
    "hanja": "百世之師",
    "meaning": "백세후에까지 모든 사람들에게 본보기가 될 만큼 훌륭한 사람을 일컬음"
  },
  {
    "id": "idiom-27ea36bbb446",
    "word": "백수건달",
    "hanja": "白手乾達",
    "meaning": "아무 것도 없이 난봉을 부리고 돌아다니는 사람"
  },
  {
    "id": "idiom-879596817829",
    "word": "백수북면",
    "hanja": "白首北面",
    "meaning": "재주와 덕이 없는 사람은 나이를 먹어도 스승 앞에서 北向하고 앉아 가르침을 바란다는 뜻"
  },
  {
    "id": "idiom-5f5da9665728",
    "word": "백아절현",
    "hanja": "伯牙絶絃",
    "meaning": "친한 벗을 잃음"
  },
  {
    "id": "idiom-7eaa1a1be06c",
    "word": "백약지장",
    "hanja": "百藥之長",
    "meaning": "백 가지 약 중에 으뜸이라는 뜻으로, 술을 좋게 이르는 말"
  },
  {
    "id": "idiom-d25a973be00b",
    "word": "백어입주",
    "hanja": "白魚入舟",
    "meaning": "백어가 배로 뛰어들어 은나라가 항복한다는 조짐을 보였다는 데서 온 말로 적이 항복함을 비유"
  },
  {
    "id": "idiom-7bfc2798f7ef",
    "word": "백의종군",
    "hanja": "白衣從軍",
    "meaning": "벼슬하지 않고 전쟁에 종군함"
  },
  {
    "id": "idiom-36e461b1f6e1",
    "word": "백의천사",
    "hanja": "白衣天使",
    "meaning": "흰옷을 입은 간호사를 일컫는 말"
  },
  {
    "id": "idiom-277a025c6b84",
    "word": "백전노장",
    "hanja": "百戰老將",
    "meaning": "많은 싸움을 치른 노련한 장수. 산전수전 (山戰水戰) 다 겪어 여러 가지로 능란한 사람"
  },
  {
    "id": "idiom-873722973ed8",
    "word": "백전백승",
    "hanja": "百戰百勝",
    "meaning": "싸울 때마다 모두 이김."
  },
  {
    "id": "idiom-480acfe9667a",
    "word": "백전불태",
    "hanja": "百戰不殆",
    "meaning": "백번 싸워서 백번 이김"
  },
  {
    "id": "idiom-727a4947b2a7",
    "word": "백절불굴",
    "hanja": "百折不屈",
    "meaning": "여러 번 실패해도 뜻을 꺾지 않음."
  },
  {
    "id": "idiom-3855b205dde1",
    "word": "백절불요",
    "hanja": "百折不撓",
    "meaning": "백번 꺾어도 굽히지 않음"
  },
  {
    "id": "idiom-e999551cf851",
    "word": "백주지조",
    "hanja": "栢舟之操",
    "meaning": "共伯의 아내가 共姜이 栢舟라는 시를 지어 맹세하고 절개를 지킨 故事. (아내가 절개를 지키는 것)"
  },
  {
    "id": "idiom-5175bd9d520f",
    "word": "백중숙계",
    "hanja": "伯仲叔季",
    "meaning": "佰은 맏이, 仲은 둘째, 淑은 셋째, 季는 막내라는 뜻 네 형제의 차례를 일컫는 말"
  },
  {
    "id": "idiom-4bac397ba624",
    "word": "백중지간",
    "hanja": "伯仲之間",
    "meaning": "둘의 우열에 차이가 없이 어금 버금 맞서는 사이 (=難兄難弟)"
  },
  {
    "id": "idiom-622a9095c74c",
    "word": "백중지세",
    "hanja": "伯仲之勢",
    "meaning": "우열을 가리기 어려움"
  },
  {
    "id": "idiom-8f45e16e180c",
    "word": "백척간두",
    "hanja": "百尺竿頭",
    "meaning": "백척 높이의 장대 위에 올라섰다는 뜻. 몹시 위태롭고 어려운 지경에 빠짐"
  },
  {
    "id": "idiom-048c02bac1c6",
    "word": "백팔번뇌",
    "hanja": "百八煩惱",
    "meaning": "불교에서는 인간에게는 108가지 번뇌가 있다고 한다"
  },
  {
    "id": "idiom-cc88febb4de6",
    "word": "백해무익",
    "hanja": "百害無益",
    "meaning": "조금도 이로운 것이 없고 해롭기만 하다"
  },
  {
    "id": "idiom-4377fd4fb73f",
    "word": "백화난만",
    "hanja": "百花爛漫",
    "meaning": "온갖 꽃이 활짝 피어 아름답게 흐드러짐"
  },
  {
    "id": "idiom-4a566c963bcc",
    "word": "백화제방",
    "hanja": "百花齊放",
    "meaning": "온갖 꽃이 일시에 핀다는 뜻으로, 갖가지 학문이나 예술이 함께 성함의 비유"
  },
  {
    "id": "idiom-c979a7f1c100",
    "word": "번문욕례",
    "hanja": "繁文縟禮",
    "meaning": "번거롭고 까닭이 많으며, 형식에 치우친 禮文"
  },
  {
    "id": "idiom-19dca7948e87",
    "word": "벌제위명",
    "hanja": "伐齊爲名",
    "meaning": "어떤 일을 하는 척 하면서 사실은 다른 일을 함"
  },
  {
    "id": "idiom-730bd23235c1",
    "word": "변화무쌍",
    "hanja": "變化無雙",
    "meaning": "세상이 변하여 가는 것이 더할 수 없이 많고 심하다"
  },
  {
    "id": "idiom-d1291baff3fa",
    "word": "병가상사",
    "hanja": "兵家常事",
    "meaning": "군대에서 늘 있는 일의 뜻. 한번 실수는 兵家之常事라는 말로 전쟁의 지고 이김은 늘 있음"
  },
  {
    "id": "idiom-5964f2433977",
    "word": "병귀신속",
    "hanja": "兵貴神速",
    "meaning": "병사를 다룸에 있어서는 신속함이 제일이라는 뜻. 병법에 나와 있는 구절"
  },
  {
    "id": "idiom-b15d27cdb31c",
    "word": "병문졸속",
    "hanja": "兵聞拙速",
    "meaning": "用兵할 때는 졸렬하여도 빠른 것이 좋다는 뜻이다"
  },
  {
    "id": "idiom-5c3184d50438",
    "word": "병불염사",
    "hanja": "兵不厭詐",
    "meaning": "전쟁에서는 모든 방법으로 적군을 속여서라도 적을 이겨야 함"
  },
  {
    "id": "idiom-0e9808b4e8b6",
    "word": "병사지야",
    "hanja": "兵死之也",
    "meaning": "전쟁이란 사람이 죽는 것이라는 말로, 전쟁은 목숨을 던질 각오를 하고 해야 된다는 뜻이다"
  },
  {
    "id": "idiom-cfd6b516bb54",
    "word": "병입고황",
    "hanja": "病入膏肓",
    "meaning": "몸 깊은 곳에 병이 들었으니 침이 미치지 못하므로, 병을 고칠 수 없다는 뜻이다"
  },
  {
    "id": "idiom-1f5420e9cf8c",
    "word": "병주고향",
    "hanja": "竝州故鄕",
    "meaning": "당나라 가도가 병주에 살다가 떠날 때 한 말로 오래 살아서 정든 타향을 이름"
  },
  {
    "id": "idiom-1615ca76cfac",
    "word": "보국안민",
    "hanja": "輔國安民",
    "meaning": "나랏일을 돕고 백성을 편안하게 한다"
  },
  {
    "id": "idiom-b70119a266b1",
    "word": "보수설한",
    "hanja": "報讐雪恨",
    "meaning": "원수를 갚고 한을 씻는다는 뜻"
  },
  {
    "id": "idiom-bf43cdc48da4",
    "word": "보우지탄",
    "hanja": "駂羽之嘆",
    "meaning": "너새 깃의 탄식이라는 말로, 신하나 백성이 전역에 종사하여 부모님을 보살피지 못하는 것을 탄식함"
  },
  {
    "id": "idiom-5deea2edce5c",
    "word": "보원이덕",
    "hanja": "報怨以德",
    "meaning": "원수 갚기를 덕으로써 하라"
  },
  {
    "id": "idiom-1940aac2cc96",
    "word": "보이국사",
    "hanja": "報以國士",
    "meaning": "남을 국사로 대우하면 자기도 국사로서 대접을 받는다"
  },
  {
    "id": "idiom-07f1039944d9",
    "word": "복룡봉추",
    "hanja": "伏龍鳳雛",
    "meaning": "엎드려 있는 용과 봉황의 새끼라는 뜻으로, 초야에 숨어 있는 훌륭한 인재를 이르는 말"
  },
  {
    "id": "idiom-281bfa742f9e",
    "word": "복소지란",
    "hanja": "復巢之卵",
    "meaning": "공융의 두 아들이 한 말. 둥지가 부서지면 알이 성할 리가 없다는 뜻"
  },
  {
    "id": "idiom-84d8f2421338",
    "word": "복수불수",
    "hanja": "覆水不收",
    "meaning": "한 번 저지른 일은 다시 어찌 할 수 없음을 이른다. 엎질러진 물 (=覆水不返盆)"
  },
  {
    "id": "idiom-ca136ccb2e69",
    "word": "복잡다단",
    "hanja": "複雜多端",
    "meaning": "일이 얽히고설키어 갈피를 잡기 어려움"
  },
  {
    "id": "idiom-cb76b5a2a0bf",
    "word": "복재적선",
    "hanja": "福在積善",
    "meaning": "복 (福)의 근원은 선 (善)을 쌓는 데 있다"
  },
  {
    "id": "idiom-a49d059b4984",
    "word": "복지유체",
    "hanja": "伏地流涕",
    "meaning": "땅에 엎드려 눈물을 흘림"
  },
  {
    "id": "idiom-6bca142f87c6",
    "word": "복차지계",
    "hanja": "覆車之戒",
    "meaning": "먼저 간 수레가 엎어졌음을 보고 경계함. 앞사람의 실패를 뒷사람이 교훈으로 삼는 것"
  },
  {
    "id": "idiom-4833f6b42a52",
    "word": "본말전도",
    "hanja": "本末顚倒",
    "meaning": "일의 원줄기를 잊고 사소한 부분에만 사로잡힘"
  },
  {
    "id": "idiom-3d5516d6b1c6",
    "word": "본연지성",
    "hanja": "本然之性",
    "meaning": "사람이 본디부터 가지고 있는 심성. 지극히 착하고 조금도 사리사욕이 없는 천부자연의 심성"
  },
  {
    "id": "idiom-95de89afba12",
    "word": "본제입납",
    "hanja": "本第入納",
    "meaning": "자기 집에 편지할 때에 겉봉 표면에 자기 이름을 쓰고 그 밑에 쓰는 말"
  },
  {
    "id": "idiom-711498e77bb3",
    "word": "봉고파직",
    "hanja": "封庫罷職",
    "meaning": "부정을 저지른 관리를 罷免시키고 官庫를 봉하여 잠그는 일"
  },
  {
    "id": "idiom-f4c2d1253574",
    "word": "부부유별",
    "hanja": "夫婦有別",
    "meaning": "남편과 아내는 분별이 있어야 한다"
  },
  {
    "id": "idiom-800e5b994f8a",
    "word": "부부자자",
    "hanja": "父父子子",
    "meaning": "아버지는 아버지 노릇을 하고, 아들은 아들 노릇을 함"
  },
  {
    "id": "idiom-9f0159fe6fe8",
    "word": "부앙불괴",
    "hanja": "府仰不愧",
    "meaning": "하늘을 우러러보나 세상을 굽어보나 양심에 부끄러움이 없음"
  },
  {
    "id": "idiom-13cf95984d62",
    "word": "부언시용",
    "hanja": "婦言是用",
    "meaning": "여자의 말을 무조건 옳게 쓴다. 줏대 없이 여자의 말을 잘 듣다"
  },
  {
    "id": "idiom-d0379ae3772e",
    "word": "부위부강",
    "hanja": "夫爲婦綱",
    "meaning": "아내는 남편을 섬기는 것이 근본이다"
  },
  {
    "id": "idiom-9a94d7d02879",
    "word": "부위자강",
    "hanja": "父爲子綱",
    "meaning": "아들은 아버지를 섬기는 것이 근본이다"
  },
  {
    "id": "idiom-fc151c0857ca",
    "word": "부자유친",
    "hanja": "父子有親",
    "meaning": "부자간에는 친애함이 있어야 함"
  },
  {
    "id": "idiom-86a7e4369e2e",
    "word": "부전자전",
    "hanja": "父傳子傳",
    "meaning": "아버지의 것이 아들에게 전해짐"
  },
  {
    "id": "idiom-d6488dd5090c",
    "word": "부중생어",
    "hanja": "釜中生魚",
    "meaning": "솥 안에서 헤엄치는 물고기란 뜻으로 오래 계속되지 못할 일을 비유함"
  },
  {
    "id": "idiom-aa00bc460176",
    "word": "부중지어",
    "hanja": "釜中之魚",
    "meaning": "장차 삶아질지도 모르고 솥 안에서 헤엄치고 있는 물고기"
  },
  {
    "id": "idiom-3676355c165b",
    "word": "부지소운",
    "hanja": "不知所云",
    "meaning": "제갈량의 전출사표에 나오며, 무슨 말을 했는지 알 수가 없다는 뜻"
  },
  {
    "id": "idiom-204e4a1c91ec",
    "word": "부창부수",
    "hanja": "夫唱婦隨",
    "meaning": "부부의 화합을 뜻함"
  },
  {
    "id": "idiom-ad77265c84f9",
    "word": "부형청죄",
    "hanja": "負荊請罪",
    "meaning": "형 (荊)은 가시나무. 가시나무를 등에 지고 때려 주기를 바란다. 즉, 사죄하는 것을 의미한다"
  },
  {
    "id": "idiom-1e035a7718dd",
    "word": "부화뇌동",
    "hanja": "附和雷同",
    "meaning": "자기 생각 없이 남의 의견을 무작정 따름."
  },
  {
    "id": "idiom-f104762fbaac",
    "word": "북망산천",
    "hanja": "北邙山川",
    "meaning": "묘지가 있는 곳. 사람이 죽어서 가는 곳을 일컫는 말"
  },
  {
    "id": "idiom-b56a54112457",
    "word": "북문지탄",
    "hanja": "北門之歎",
    "meaning": "벼슬은 하였으나 뜻대로 성공하지 못하여 살림이 곤궁함을 한탄하는 말 (北門은 궁궐의 상징어)"
  },
  {
    "id": "idiom-315433efbdaa",
    "word": "북산지감",
    "hanja": "北山之感",
    "meaning": "나라 일에 힘쓰느라 부모봉양을 제대로 못한 것을 슬퍼하는 마음 (北山은 궁궐의 상징어)"
  },
  {
    "id": "idiom-41a9c96f4f95",
    "word": "북창삼우",
    "hanja": "北窓三友",
    "meaning": "북쪽 창가의 세 친구. 거문고와 시와 술을 일컬음"
  },
  {
    "id": "idiom-240b35400a19",
    "word": "북풍한설",
    "hanja": "北風寒雪",
    "meaning": "몹시 차고 추운 겨울바람과 눈"
  },
  {
    "id": "idiom-0d76038803e2",
    "word": "분골쇄신",
    "hanja": "粉骨碎身",
    "meaning": "몸을 아끼지 않고 힘을 다해 노력함."
  },
  {
    "id": "idiom-73e284fe2cf4",
    "word": "분기충천",
    "hanja": "憤氣沖天",
    "meaning": "분한 기운이 하늘을 찌를 듯 대단함"
  },
  {
    "id": "idiom-deaccf538eba",
    "word": "분서갱유",
    "hanja": "焚書坑儒",
    "meaning": "학자의 정치 비평을 금하기 위해 책을 불사르고, 유생들을 생매장함. (진시황 때)"
  },
  {
    "id": "idiom-92924b39f7d5",
    "word": "불가구약",
    "hanja": "不可救藥",
    "meaning": "일이 만회할 수 없을 지경에 달하였음을 형용한 말"
  },
  {
    "id": "idiom-0810171f8d86",
    "word": "불가사의",
    "hanja": "不可思議",
    "meaning": "사람의 생각으로는 미루어 알 수 없는 이상야릇함"
  },
  {
    "id": "idiom-a6be5601e9ef",
    "word": "불가지론",
    "hanja": "不可知論",
    "meaning": "의식에 주어지는 감각적 경험만이 인식되고, 그 배후에 있는 객관적인 실재는 인식할 수 없다는 설"
  },
  {
    "id": "idiom-3fe64c6c76d9",
    "word": "불가항력",
    "hanja": "不可抗力",
    "meaning": "힘으로 대항할 수 없음"
  },
  {
    "id": "idiom-30f4cc3e4cf3",
    "word": "불간지서",
    "hanja": "不刊之書",
    "meaning": "길이길이 전할 不朽의 良書 (영구히 전하여 없어지지 않는 良書.)"
  },
  {
    "id": "idiom-97930991b3ee",
    "word": "불감생심",
    "hanja": "不敢生心",
    "meaning": "힘에 부쳐 감히 엄두를 내지 못함"
  },
  {
    "id": "idiom-410380f6aa60",
    "word": "불고염치",
    "hanja": "不顧廉恥",
    "meaning": "체면과 염치를 돌아보지 않음"
  },
  {
    "id": "idiom-f8d23b2d07f0",
    "word": "불괴옥루",
    "hanja": "不愧屋漏",
    "meaning": "사람이 보지 아니하는 곳에서도 행동을 신중히 하고 경계하므로 부끄럽지 아니함"
  },
  {
    "id": "idiom-a2ce4051a985",
    "word": "불구대천",
    "hanja": "不俱戴天",
    "meaning": "하늘 아래 같이 살 수 없는 원수. 반드시 죽여 없애야 할 원수. (=不共戴天之讎)"
  },
  {
    "id": "idiom-608af815b736",
    "word": "불로장생",
    "hanja": "不老長生",
    "meaning": "늙지 않고 오래 산다"
  },
  {
    "id": "idiom-1b6e1890882f",
    "word": "불립문자",
    "hanja": "不立文字",
    "meaning": "마음에서 마음으로 전함. 이심전심"
  },
  {
    "id": "idiom-3b4786f74278",
    "word": "불망지은",
    "hanja": "不忘之恩",
    "meaning": "잊지 못할 은혜"
  },
  {
    "id": "idiom-8ea28335abfb",
    "word": "불면불휴",
    "hanja": "不眠不休",
    "meaning": "자지도 않고 쉬지도 않는다는 뜻으로, 조금도 쉬지 않고 내쳐 애써 일함의 뜻"
  },
  {
    "id": "idiom-6aed4553704f",
    "word": "불모지지",
    "hanja": "不毛之地",
    "meaning": "초목이 나지 않는 메마른 땅"
  },
  {
    "id": "idiom-8c0e689c19e2",
    "word": "불문가지",
    "hanja": "不問可知",
    "meaning": "묻지 않아도 능히 알 수 있음"
  },
  {
    "id": "idiom-2570fdb67825",
    "word": "불문곡직",
    "hanja": "不問曲直",
    "meaning": "옳고 그르고를 묻지 않고 다짜고짜로"
  },
  {
    "id": "idiom-c8fcbe8a8813",
    "word": "불벌부덕",
    "hanja": "不伐不德",
    "meaning": "자기의 공적을 뽐내지 않음"
  },
  {
    "id": "idiom-0f1a9f1e3a64",
    "word": "불비불명",
    "hanja": "不蜚不鳴",
    "meaning": "날지도 않고 울지도 않는다는 말로, 큰일을 하기 위해 오랫동안 조용히 때를 기다린다는 뜻"
  },
  {
    "id": "idiom-f25044c826bd",
    "word": "불세지재",
    "hanja": "不世之才",
    "meaning": "대대로 드문 큰 재주, 세상에 드문 큰 재주"
  },
  {
    "id": "idiom-7e10e40e4aee",
    "word": "불식태산",
    "hanja": "不識泰山",
    "meaning": "泰山을 몰랐다 는 뜻으로 인재를 알아보지 못한다는 말"
  },
  {
    "id": "idiom-f9412b46de8f",
    "word": "불요불굴",
    "hanja": "不撓不屈",
    "meaning": "한번 결심한 마음이 흔들거리거나 굽힘이 없이 억셈"
  },
  {
    "id": "idiom-21cbfc48536d",
    "word": "불원천리",
    "hanja": "不遠千里",
    "meaning": "천리도 멀지 않게 생각함"
  },
  {
    "id": "idiom-eb0d7dbc913d",
    "word": "불철주야",
    "hanja": "不撤晝夜",
    "meaning": "밤낮을 가리지 않음"
  },
  {
    "id": "idiom-6fc6c4b2f92b",
    "word": "불초지부",
    "hanja": "不肖之父",
    "meaning": "어리석은 아버지"
  },
  {
    "id": "idiom-d294277e612a",
    "word": "불치하문",
    "hanja": "不恥下問",
    "meaning": "아랫사람에게 묻기를 부끄러워하지 않음"
  },
  {
    "id": "idiom-b272f450948b",
    "word": "불편부당",
    "hanja": "不偏不黨",
    "meaning": "어느 한 쪽으로 기울어짐 없이 中正, 公平함. 늘 그러한 자연의 道의 본질을 말한다"
  },
  {
    "id": "idiom-3c97b388a7a9",
    "word": "불한이율",
    "hanja": "不寒而慄",
    "meaning": "춥지 않아도 벌벌 떨 정도로 몹시 두려운 상황을 형용한 말"
  },
  {
    "id": "idiom-1b9b34298f80",
    "word": "불협화음",
    "hanja": "不協和音",
    "meaning": "어울리지 않는 음"
  },
  {
    "id": "idiom-daf75942a1df",
    "word": "불혹지년",
    "hanja": "不惑之年",
    "meaning": "공자가 나이 사십부터 세상일에 미혹을 갖지 않는다고 하여 쓰이는 말"
  },
  {
    "id": "idiom-ee4a4a26b511",
    "word": "붕우유신",
    "hanja": "朋友有信",
    "meaning": "벗과 벗은 믿음이 있어야 한다"
  },
  {
    "id": "idiom-79e3e505f2ea",
    "word": "붕우책선",
    "hanja": "朋友責善",
    "meaning": "친구는 서로 착한 일을 권함. 친구라면 나쁜 짓을 못 하도록 권하고 좋은 길로 이끌어야 한다"
  },
  {
    "id": "idiom-005e9de136f8",
    "word": "붕정만리",
    "hanja": "鵬程萬里",
    "meaning": "붕새가 날아가는 하늘길이 만 리로 트임. 곧 전도가 지극히 양양한 장래"
  },
  {
    "id": "idiom-18b2f26bf691",
    "word": "비견계종",
    "hanja": "比肩繼踵",
    "meaning": "어깨를 나란히 하고 발뒤꿈치를 이음. 여러 사람을 줄지어 세우는 것을 의미하기도 한다"
  },
  {
    "id": "idiom-89cda9d1e673",
    "word": "비금주수",
    "hanja": "飛禽走獸",
    "meaning": "짐승과 길짐승"
  },
  {
    "id": "idiom-bf07f8d5a683",
    "word": "비례물동",
    "hanja": "非禮勿動",
    "meaning": "禮가 아니면 행동으로 옮기지도 말아라"
  },
  {
    "id": "idiom-8311b9d8eccf",
    "word": "비례물시",
    "hanja": "非禮勿視",
    "meaning": "禮義에 어긋나는 일은 보지를 말라는 뜻"
  },
  {
    "id": "idiom-77aee0a08dc1",
    "word": "비례물언",
    "hanja": "非禮勿言",
    "meaning": "禮가 아니면 말하지도 말아라"
  },
  {
    "id": "idiom-31064324375e",
    "word": "비례물청",
    "hanja": "非禮勿聽",
    "meaning": "禮가 아니면 듣지도 말아라"
  },
  {
    "id": "idiom-aa2f25ccbc37",
    "word": "비명횡사",
    "hanja": "非命橫死",
    "meaning": "뜻밖의 재난이나 사고 따위로 죽음"
  },
  {
    "id": "idiom-58a72c052929",
    "word": "비몽사몽",
    "hanja": "非夢似夢",
    "meaning": "꿈인지 생시인지 어렴풋한 상태"
  },
  {
    "id": "idiom-4c48257600b9",
    "word": "비방지목",
    "hanja": "誹謗之木",
    "meaning": "헐뜯는 나무라는 말이다"
  },
  {
    "id": "idiom-ea484f422cec",
    "word": "비분강개",
    "hanja": "悲憤慷慨",
    "meaning": "슬프고 분한 느낌이 마음속에 가득 차 있음"
  },
  {
    "id": "idiom-aeb99ad21a67",
    "word": "비비유지",
    "hanja": "比比有之",
    "meaning": "드물지 않음"
  },
  {
    "id": "idiom-627986db8741",
    "word": "비석지심",
    "hanja": "匪石之心",
    "meaning": "내 마음은 돌이 아니므로 굴려서 돌리지 못하듯 결심이 확고하다"
  },
  {
    "id": "idiom-ae91cb5e7bc9",
    "word": "비옥가봉",
    "hanja": "比屋可封",
    "meaning": "충신, 효자, 열녀가 많은 까닭에 벼슬에 봉할 만한 집들이 줄지어 있을 정도로 세상이 평안함"
  },
  {
    "id": "idiom-e1ce81f49a47",
    "word": "비육지탄",
    "hanja": "髀肉之嘆",
    "meaning": "넓적다리에 살만 찌는 것, 즉 성공하지 못하고 헛되이 세월만 보냄을 한탄함"
  },
  {
    "id": "idiom-bf3b6c640e07",
    "word": "비일비재",
    "hanja": "非一非再",
    "meaning": "한 두 번이 아님. 여러 번, 많이"
  },
  {
    "id": "idiom-2f36943acc80",
    "word": "빈계지신",
    "hanja": "牝鷄之晨",
    "meaning": "암탉이 새벽을 알리느라고 운다. 아내가 남편의 권리를 잡는 것을 일컫는 말이다"
  },
  {
    "id": "idiom-7f78bd489157",
    "word": "빈이무원",
    "hanja": "貧而無怨",
    "meaning": "가난하면서도 남을 원망하지 않음"
  },
  {
    "id": "idiom-a61250f67140",
    "word": "빈자소인",
    "hanja": "貧者小人",
    "meaning": "가난하면 저절로 졸장부가 됨"
  },
  {
    "id": "idiom-3dbc50c4f8a3",
    "word": "빈자일등",
    "hanja": "貧者一燈",
    "meaning": "물질이 많고 적음보다도 소중함을 일컬음"
  },
  {
    "id": "idiom-8e8dbbee5819",
    "word": "빈즉다사",
    "hanja": "貧則多事",
    "meaning": "가난하면 살림에 쪼들려 잔일이 많음"
  },
  {
    "id": "idiom-f880bb3ba691",
    "word": "빈천지교",
    "hanja": "貧賤之交",
    "meaning": "가난하고 천한 지위에 있을 때의 사귐. (=貧賤之交不可忘)"
  },
  {
    "id": "idiom-5479e80896ca",
    "word": "빙공영사",
    "hanja": "憑公營私",
    "meaning": "공사를 이용하여 사리를 꾀한다"
  },
  {
    "id": "idiom-e6f28e15de4f",
    "word": "빙자옥질",
    "hanja": "氷姿玉質",
    "meaning": "얼음같이 투명한 모습과 옥과 같이 뛰어난 바탕. 용모와 재주가 모두 뛰어남을 비유 (=仙姿玉質)"
  },
  {
    "id": "idiom-a47e9f909a81",
    "word": "빙청옥윤",
    "hanja": "氷淸玉潤",
    "meaning": "얼음처럼 맑고 구슬처럼 윤이 난다. 장인과 사위의 인물이 다 같이 뛰어남을 말한다"
  },
  {
    "id": "idiom-85e21b15f5e8",
    "word": "빙탄불용",
    "hanja": "氷炭不容",
    "meaning": "서로 용납할 수 없는 얼음과 숯. 두 사물이 서로 화합할 수 없음 (=氷炭不相容)"
  },
  {
    "id": "idiom-c90dbf1d5c24",
    "word": "빙탄지간",
    "hanja": "氷炭之間",
    "meaning": "서로 화합할 수 없는 사이"
  },
  {
    "id": "idiom-791b6e99d667",
    "word": "빙호지심",
    "hanja": "氷壺之心",
    "meaning": "백옥으로 만든 항아리에 얼음 한 조각을 넣은 것 같은 마음 (지극히 청렴결백한 마음)"
  },
  {
    "id": "idiom-7617e2333496",
    "word": "사가망처",
    "hanja": "徙家忘妻",
    "meaning": "이사할 때 자기의 妻를 깜빡 잊고 데려가지 않음. 잘 잊는 것을 가리켜 하는 말이다"
  },
  {
    "id": "idiom-31cb6c779a59",
    "word": "사고무친",
    "hanja": "四顧無親",
    "meaning": "사방을 둘러보아도 친한 사람이 없음. 곧 의지할 사람이 없음"
  },
  {
    "id": "idiom-5f9ad923b6e5",
    "word": "사군이충",
    "hanja": "事君以忠",
    "meaning": "충성으로 임금을 섬김"
  },
  {
    "id": "idiom-838ff94c7606",
    "word": "사기종인",
    "hanja": "舍己從人",
    "meaning": "자기의 이전 행위를 버리고 타인의 선행을 본떠 행함"
  },
  {
    "id": "idiom-837847b54d9c",
    "word": "사농공상",
    "hanja": "士農工商",
    "meaning": "선비·농부·장인·상인의 네 가지 신분을 아울러 일컫는 말"
  },
  {
    "id": "idiom-7fb07b660940",
    "word": "사단취장",
    "hanja": "捨短取長",
    "meaning": "단점은 버리고 장점은 취함"
  },
  {
    "id": "idiom-868843291541",
    "word": "사려분별",
    "hanja": "思慮分別",
    "meaning": "사려는 여러 가지로 생각을 짜내고 신중하게 판단하는 것"
  },
  {
    "id": "idiom-117f58ee17e6",
    "word": "사마난추",
    "hanja": "駟馬難追",
    "meaning": "駟馬는 말 네 필이 끄는 수레로써 엄청나게 빠른 것을 비유한다. 입조심을 하라는 뜻"
  },
  {
    "id": "idiom-09cf3e8e56ba",
    "word": "사면초가",
    "hanja": "四面楚歌",
    "meaning": "사방이 적이나 반대자에게 둘러싸여 도움받기 어려움."
  },
  {
    "id": "idiom-b861b465b16e",
    "word": "사면춘풍",
    "hanja": "四面春風",
    "meaning": "모든 방면에 봄바람이 분다. 항상 좋은 얼굴로 남을 대하여 누구에게나 호감을 삼"
  },
  {
    "id": "idiom-f2d1ecea56b1",
    "word": "사문난적",
    "hanja": "斯文亂賊",
    "meaning": "이단적인 언사로 유교를 어지럽히거나 유학의 본류를 어그러뜨리는 글을 쓰는 사람을 일컫는 말"
  },
  {
    "id": "idiom-ede3ab8b9180",
    "word": "사분오열",
    "hanja": "四分五裂",
    "meaning": "여러 쪽으로 찢어짐 어지럽게 분열됨"
  },
  {
    "id": "idiom-48466d57f8c2",
    "word": "사불급설",
    "hanja": "駟不及舌",
    "meaning": "소문이 삽시간에 퍼짐. 말조심하라는 뜻"
  },
  {
    "id": "idiom-5ed88dc13c80",
    "word": "사불범정",
    "hanja": "四不犯正",
    "meaning": "사악한 것은 바른 것을 범하지 못함"
  },
  {
    "id": "idiom-cf9148a214c2",
    "word": "사불여의",
    "hanja": "事不如意",
    "meaning": "일이 뜻대로 되지 않음"
  },
  {
    "id": "idiom-8a4cc8b413d1",
    "word": "사사오입",
    "hanja": "四捨五入",
    "meaning": "반올림"
  },
  {
    "id": "idiom-51d6183ec6f9",
    "word": "사상누각",
    "hanja": "沙上樓閣",
    "meaning": "모래위의 누각이란 뜻으로 ,무슨 일이든지 기초가 견고하지 못하면 오래 견디지 못함을 일컬음"
  },
  {
    "id": "idiom-9dab23f5c702",
    "word": "사생관두",
    "hanja": "死生關頭",
    "meaning": "죽느냐 사느냐의 위태한 고비"
  },
  {
    "id": "idiom-b4ee9327ca2e",
    "word": "사생취의",
    "hanja": "捨生取義",
    "meaning": "목숨을 버리고 의리를 쫓음"
  },
  {
    "id": "idiom-a71a785eabe2",
    "word": "사서지경",
    "hanja": "四書之經",
    "meaning": "사서의 경전. 사서는 논어·맹자·대학·중용의 네 가지 책"
  },
  {
    "id": "idiom-fbd16b9ec518",
    "word": "사석성호",
    "hanja": "射石成虎",
    "meaning": "성심을 다하면 아니 될 일도 이룰 수 있다는 것. 돌을 범인 줄 알고 쏘았더니 화살이 꽂혔다는 말"
  },
  {
    "id": "idiom-d0ab106264fa",
    "word": "사석위호",
    "hanja": "射石爲虎",
    "meaning": "돌을 범인 줄 알고 쏘았더니 돌에 화살이 꽂혔다. 성심을 다하면 아니 될 일도 이룰 수 있다"
  },
  {
    "id": "idiom-11177100e9c6",
    "word": "사승습장",
    "hanja": "死僧習丈",
    "meaning": "죽은 중의 볼기를 친다는 말로 대들 힘이 없는 사람에게 폭행을 가하거나 위엄을 부린다"
  },
  {
    "id": "idiom-c93ce887ffac",
    "word": "사실무근",
    "hanja": "事實無根",
    "meaning": "뿌리도 잎도 없는 것. 전혀 사실에 근거 하고 있지 않은 것"
  },
  {
    "id": "idiom-166b67ea0140",
    "word": "사양지심",
    "hanja": "辭讓之心",
    "meaning": "겸손히 마다하며 받지 않거나 남에게 양보하는 마음. 仁의 근본이다"
  },
  {
    "id": "idiom-de8b00b3e51f",
    "word": "사여귀가",
    "hanja": "死如歸家",
    "meaning": "죽음을 마치 집에 가는 것처럼 담담히 받아들임"
  },
  {
    "id": "idiom-9c3be953ebf7",
    "word": "사이비자",
    "hanja": "似而非者",
    "meaning": "겉으로 보기에는 비슷한 것 같으나 실지로는 아주 다른 가짜. (=似而非)"
  },
  {
    "id": "idiom-bf69ef65fb0d",
    "word": "사이후이",
    "hanja": "死而後已",
    "meaning": "어떤 사업을 함에 있어서 죽음에 이르러서야 그만둔다. 그만큼 뜻이 굳음을 말한다"
  },
  {
    "id": "idiom-ba948a607917",
    "word": "사인여천",
    "hanja": "事人如天",
    "meaning": "東學思想으로 사람 대하기를 하늘같이 떠받들라는 말"
  },
  {
    "id": "idiom-4094e6ff5db3",
    "word": "사직지신",
    "hanja": "社稷之臣",
    "meaning": "사직 (왕조)을 지탱할 만한 신하"
  },
  {
    "id": "idiom-1ef714d45aba",
    "word": "사친이효",
    "hanja": "事親以孝",
    "meaning": "효도로 부모를 섬김"
  },
  {
    "id": "idiom-beb1a50c4839",
    "word": "사통오달",
    "hanja": "四通五達",
    "meaning": "길이나 교통망 통신망 등이 사방으로 막힘없이 통함"
  },
  {
    "id": "idiom-7dc33b5f28f7",
    "word": "사통팔달",
    "hanja": "四通八達",
    "meaning": "도로가 사방팔방으로 통해 있어 교통이 편리한 것. 도로나 지하철 등 교통망이 발달 된 모습"
  },
  {
    "id": "idiom-b2cf6e421002",
    "word": "사필귀정",
    "hanja": "事必歸正",
    "meaning": "일은 결국 올바른 이치로 돌아감."
  },
  {
    "id": "idiom-950f754b6aec",
    "word": "사해동포",
    "hanja": "四海同胞",
    "meaning": "천하의 모든 사람들이 모두 형제"
  },
  {
    "id": "idiom-315f0b2abffb",
    "word": "사해형제",
    "hanja": "四海兄弟",
    "meaning": "사방이 형제라고 풀이되며 마음과 뜻을 같이 한다면 누구나 형제처럼 지낼 수 있다는 말"
  },
  {
    "id": "idiom-138d906c7d96",
    "word": "사회부연",
    "hanja": "死灰復燃",
    "meaning": "다 탄 재가 다시 불이 붙었다. 혹은 곤경에 처해 있던 사람이 훌륭하게 됨을 비유하는 말이다"
  },
  {
    "id": "idiom-57726fe0fb1d",
    "word": "산고수장",
    "hanja": "山高水長",
    "meaning": "군자의 덕이 길이길이 전함"
  },
  {
    "id": "idiom-998ae2f97ed3",
    "word": "산궁수진",
    "hanja": "山窮水盡",
    "meaning": "막다른 골목의 경우"
  },
  {
    "id": "idiom-ad6055f04f53",
    "word": "산림처사",
    "hanja": "山林處士",
    "meaning": "관직이나 세속을 떠나 산 속에 파묻혀 글이나 읽고 지내는 사람"
  },
  {
    "id": "idiom-faf20a7104cd",
    "word": "산상수훈",
    "hanja": "山上垂訓",
    "meaning": "예수가 산꼭대기에서 행한 설교. 예수의 사랑의 윤리가 표현되어 있음"
  },
  {
    "id": "idiom-04480f7bc24f",
    "word": "산자수명",
    "hanja": "山紫水明",
    "meaning": "아름다운 경치"
  },
  {
    "id": "idiom-bf7f2f94f828",
    "word": "산전수전",
    "hanja": "山戰水戰",
    "meaning": "세상의 여러 어려움과 경험을 두루 겪음."
  },
  {
    "id": "idiom-dc2d2a3cc87e",
    "word": "산해진미",
    "hanja": "山海珍味",
    "meaning": "산과 바다에서 나는 물건으로 만든 맛좋은 음식"
  },
  {
    "id": "idiom-02c12021ab68",
    "word": "살생유택",
    "hanja": "殺生有擇",
    "meaning": "산 것을 가려서 죽임"
  },
  {
    "id": "idiom-6731faf3531d",
    "word": "살신성인",
    "hanja": "殺身成仁",
    "meaning": "목숨을 버려 어진 일을 이룸"
  },
  {
    "id": "idiom-30cf79b63ba5",
    "word": "삼간초가",
    "hanja": "三間草家",
    "meaning": "세 간이 되는 초가. 썩 작은 집"
  },
  {
    "id": "idiom-8a9382e8fc33",
    "word": "삼강오륜",
    "hanja": "三綱五倫",
    "meaning": "유교에 있어서 사람들이 지켜야 할 도리"
  },
  {
    "id": "idiom-6bd2b409781a",
    "word": "삼고지례",
    "hanja": "三顧之禮",
    "meaning": "유비가 제갈양의 초옥을 세 번 찾아가 간청하여 제갈양을 군사로 맞아들인 일화에서 나온 말"
  },
  {
    "id": "idiom-8f164e1bca41",
    "word": "삼고초려",
    "hanja": "三顧草廬",
    "meaning": "유비가 제갈명을 세 번이나 찾아가 군사로 초빙한 데서 유래한 말 (임금의 두터운 사랑을 입다)"
  },
  {
    "id": "idiom-4c52927b4117",
    "word": "삼라만상",
    "hanja": "森羅萬象",
    "meaning": "우주에 존재하는 온갖 사물과 현상"
  },
  {
    "id": "idiom-fff7f7f669a7",
    "word": "삼령오신",
    "hanja": "三令五申",
    "meaning": "세 번 명령하고 다섯 번을 거듭 말하다. 같은 것을 몇 번이고 되풀이해서 명령하고 戒告하다"
  },
  {
    "id": "idiom-6c6164754102",
    "word": "삼마태수",
    "hanja": "三馬太守",
    "meaning": "청백리을 가리킴"
  },
  {
    "id": "idiom-2ce12d254acc",
    "word": "삼방순욱",
    "hanja": "三房荀彧",
    "meaning": "조조가 순욱을 세 번 방문한 끝에 그를 얻었다는 데에서 비롯된 고사성어"
  },
  {
    "id": "idiom-8f37f66c9b69",
    "word": "삼복백규",
    "hanja": "三復白圭",
    "meaning": "백규를 세 번 반복한다는 말로, 말을 신중하게 한다는 뜻이다"
  },
  {
    "id": "idiom-c075f3496231",
    "word": "삼삼오오",
    "hanja": "三三五五",
    "meaning": "셋 또는 대여섯이 무리를 지어 다니거나 함께 일을 하는 모양"
  },
  {
    "id": "idiom-b3585f9533a1",
    "word": "삼생유행",
    "hanja": "三生有幸",
    "meaning": "삼생의 행운이 있다는 말이다"
  },
  {
    "id": "idiom-98d8b0c66746",
    "word": "삼성오신",
    "hanja": "三省吾身",
    "meaning": "날마다 세 번씩 자신을 반성함"
  },
  {
    "id": "idiom-8cc926438aa8",
    "word": "삼순구식",
    "hanja": "三旬九食",
    "meaning": "한달에 아홉 끼를 먹을 정도로 매우 빈궁한 생활"
  },
  {
    "id": "idiom-d0c89f48c322",
    "word": "삼십육계",
    "hanja": "三十六計",
    "meaning": "곤란할 때는 주저하지 말고 도망가는 것이 가장 좋다. (=檀公三十六計走爲上策)"
  },
  {
    "id": "idiom-25ba1cec730b",
    "word": "삼십이립",
    "hanja": "三十而立",
    "meaning": "孔子가 한 말로 나이 삼십에 이르러 비로소 학문상 자립할 수 있게 되었다는 말"
  },
  {
    "id": "idiom-4e0345b8e4ff",
    "word": "삼악삼토",
    "hanja": "三握三吐",
    "meaning": "밥을 먹거나 머리를 감을 때 손님이 오면 먹던 밥은 뱉고, 감던 머리는 쥐고 바로 나가 마중함"
  },
  {
    "id": "idiom-809935fd0b97",
    "word": "삼여지공",
    "hanja": "三餘之功",
    "meaning": "독서하기에 가장 좋은 ‘겨울, 밤, 음우 (陰雨)’를 일컬음"
  },
  {
    "id": "idiom-d47d48c14896",
    "word": "삼위일체",
    "hanja": "三位一體",
    "meaning": "세 가지의 것이 서로 연관, 통합하여 목적하는 것이 하나가 되는 일"
  },
  {
    "id": "idiom-143b1687b85c",
    "word": "삼인성호",
    "hanja": "三人成虎",
    "meaning": "거짓말이라도 여러 사람이 하면 곧이듣는 다는 말"
  },
  {
    "id": "idiom-83dee0abdfa0",
    "word": "삼일유가",
    "hanja": "三日遊街",
    "meaning": "과거에 급제한 사람이 사흘 동안 온 거리로 돌아다님"
  },
  {
    "id": "idiom-ac62c99a1671",
    "word": "삼일천하",
    "hanja": "三日天下",
    "meaning": "짧은 동안 정권을 잡았다가 곧 실패함을 이름. 영화가 짧음"
  },
  {
    "id": "idiom-70d0002cae11",
    "word": "삼종지도",
    "hanja": "三從之道",
    "meaning": "여자가 지켜야 할 세 가지 도리. 곧 어버이, 남편, 아들을 좇는 일"
  },
  {
    "id": "idiom-6091fffa74d4",
    "word": "삼종지의",
    "hanja": "三從之義",
    "meaning": "여자가 지켜야 도리. 어려서는 아버지를, 시집가서는 남편을, 남편이 죽은 뒤에는 아들을 좇음"
  },
  {
    "id": "idiom-bdde6889390b",
    "word": "삼척동자",
    "hanja": "三尺童子",
    "meaning": "키가 석자에 불과한 자그만 어린애. 곧 어린아이"
  },
  {
    "id": "idiom-3451c34dd31d",
    "word": "삼천지교",
    "hanja": "三遷之敎",
    "meaning": "맹자의 어머니가 아들의 교육을 위하여 세 번 거처를 옮겼다 (=孟母三遷之敎)"
  },
  {
    "id": "idiom-17f5d8c58d38",
    "word": "삼한갑족",
    "hanja": "三韓甲族",
    "meaning": "우리나라에서 대대로 문벌이 높은 집안"
  },
  {
    "id": "idiom-0c06b4d85911",
    "word": "삼한사온",
    "hanja": "三寒四溫",
    "meaning": "사흘 가량 추운 날씨가 계속되다가, 나흘 가량 따뜻한 날씨가 계속하는 주기적인 기후 현상"
  },
  {
    "id": "idiom-74a0f9f67fd0",
    "word": "상가지구",
    "hanja": "喪家之狗",
    "meaning": "초상집에서 개에게 신경을 못 쓰 굶기기 쉽듯, 몹시 초췌한 모양으로 기웃거리며 얻어먹는 모습"
  },
  {
    "id": "idiom-d9d74fd0e341",
    "word": "상궁지조",
    "hanja": "傷弓之鳥",
    "meaning": "화살에 상처를 입은 새란 뜻으로, 화살에 놀란 새는 구부러진 나무만 봐도 놀란다는 뜻"
  },
  {
    "id": "idiom-440f11320fad",
    "word": "상덕돈화",
    "hanja": "象德敦和",
    "meaning": "큰 덕은 화를 돈독히 한다"
  },
  {
    "id": "idiom-d779daa0092e",
    "word": "상마지교",
    "hanja": "桑馬之交",
    "meaning": "뽕나무와 삼나무를 벗 삼아 지낸다. 즉 전원에 은거하여 농군들과 사귀어 지낸다는 말"
  },
  {
    "id": "idiom-53baa3b77ed6",
    "word": "상사불망",
    "hanja": "相思不忘",
    "meaning": "서로 그리워하여 잊지 못함"
  },
  {
    "id": "idiom-53a10dcfa365",
    "word": "상산구어",
    "hanja": "上山求魚",
    "meaning": "산 위에서 물고기를 찾는다. 당치 않은 데 가서 되지도 않는 것을 원한다는 말이다"
  },
  {
    "id": "idiom-1eb8fab8f498",
    "word": "상수여수",
    "hanja": "上壽如水",
    "meaning": "건강하게 오래 살려면, 흐르는 물처럼 도리에 따라서 살아야 한다는 뜻"
  },
  {
    "id": "idiom-dfc67107f1b5",
    "word": "상전벽해",
    "hanja": "桑田碧海",
    "meaning": "뽕나무밭이 푸른 바다가 됨 세상의 일이 덧없이 바뀜"
  },
  {
    "id": "idiom-e0e376161b75",
    "word": "상중지환",
    "hanja": "桑中之歡",
    "meaning": "임도 보고 뽕도 딴다"
  },
  {
    "id": "idiom-f4adfedaa986",
    "word": "상중지희",
    "hanja": "桑中之喜",
    "meaning": "남녀간의 밀회, 음사, 姦通을 이름"
  },
  {
    "id": "idiom-8f219a13b49e",
    "word": "상풍고절",
    "hanja": "霜風高節",
    "meaning": "어떠한 난관이나 어려움에 처해도 결코 굽히지 않는 높은 절개"
  },
  {
    "id": "idiom-fda6d9d8167f",
    "word": "상하탱석",
    "hanja": "上下撐石",
    "meaning": "윗돌 빼서 아랫돌 괴기. 곧 일이 몹시 꼬이는데 임시변통으로 견디어 나감을 이르는 말"
  },
  {
    "id": "idiom-5ab8e5da22b0",
    "word": "새옹지마",
    "hanja": "塞翁之馬",
    "meaning": "세상일은 복이 될지 화가 될지 알 수 없음"
  },
  {
    "id": "idiom-de30a3db6b66",
    "word": "생구불망",
    "hanja": "生口不網",
    "meaning": "산 사람의 목구멍에 거미줄 치지 않는다는 말"
  },
  {
    "id": "idiom-9706db394b31",
    "word": "생기사귀",
    "hanja": "生寄死歸",
    "meaning": "산다는 것은 이 세상에 잠시 머물러 있는 것이며 죽는다는 것은 원래대로 되돌아가는 것이라는 말"
  },
  {
    "id": "idiom-fe200cbc125b",
    "word": "생면부지",
    "hanja": "生面不知",
    "meaning": "태어나서 만나 본 적이 없는 전혀 모르는 사람"
  },
  {
    "id": "idiom-da20fecc97e0",
    "word": "생불여사",
    "hanja": "生不如死",
    "meaning": "삶이 죽음만 못 하다는 뜻으로, 아주 곤란한 처지에 있음을 말함"
  },
  {
    "id": "idiom-40c1637c37c6",
    "word": "생살여탈",
    "hanja": "生殺與奪",
    "meaning": "살리고 죽이고 주고 빼앗다. 남의 목숨이나 재물을 마음대로 하다"
  },
  {
    "id": "idiom-112d4a493816",
    "word": "생생발전",
    "hanja": "生生發展",
    "meaning": "끊임이 활동하면서 힘차게 발전함"
  },
  {
    "id": "idiom-7a2cc406a6bf",
    "word": "생이지지",
    "hanja": "生而知之",
    "meaning": "나면서부터 앎"
  },
  {
    "id": "idiom-106032a7b108",
    "word": "생자필멸",
    "hanja": "生者必滅",
    "meaning": "살아 있는 자는 반드시 죽는다. 그러므로 고귀한 삶을 어떻게 사는가가 문제"
  },
  {
    "id": "idiom-0c1472407827",
    "word": "서과피지",
    "hanja": "西瓜皮舐",
    "meaning": "수박 겉핥기. 일이나 물건의 내용도 잘 모르면서 겉만 아는 척하다. 아무 실속이 없다"
  },
  {
    "id": "idiom-8fe580dc47c6",
    "word": "서동부언",
    "hanja": "胥動浮言",
    "meaning": "거짓말을 퍼뜨려 인심을 선동함"
  },
  {
    "id": "idiom-6573ae6193b0",
    "word": "서리지탄",
    "hanja": "黍離之歎",
    "meaning": "나라가 망하여 옛 대궐 터에 기장이 익어 늘어진 것을 보고 탄식함 (영고성쇠가 무상함)"
  },
  {
    "id": "idiom-a74d4d655990",
    "word": "서시빈목",
    "hanja": "西施嚬目",
    "meaning": "남의 흉내를 냄"
  },
  {
    "id": "idiom-39fcb1aa045b",
    "word": "서절구투",
    "hanja": "鼠竊狗偸",
    "meaning": "쥐가 물건을 훔치고 개가 남의 눈을 속이는 것. 남모르게 숨어서 부당한 물건을 취하는 좀도둑을 말함"
  },
  {
    "id": "idiom-331429c5401f",
    "word": "서제막급",
    "hanja": "噬臍莫及",
    "meaning": "기회를 잃고 후회해도 아무 소용이 없음"
  },
  {
    "id": "idiom-0b6a97cda2fe",
    "word": "석과불식",
    "hanja": "碩果不食",
    "meaning": "큰 과일은 다 먹지 않고 후손을 위하여 남김. 즉 자신의 복을 버리고 후손의 복을 받들어 줌"
  },
  {
    "id": "idiom-493027b51140",
    "word": "석불반면",
    "hanja": "石佛反面",
    "meaning": "돌부처가 얼굴을 돌린다는 뜻으로, 아주 미워하고 싫어함을 비유 하여 이르는 말"
  },
  {
    "id": "idiom-a376c4924fe3",
    "word": "석전경우",
    "hanja": "石田耕牛",
    "meaning": "자갈밭을 가는 소란 뜻으로, 황해도 사람의 근면하고 인내심이 강한 성격을 평한 말"
  },
  {
    "id": "idiom-ad9997d7fa72",
    "word": "선견지명",
    "hanja": "先見之明",
    "meaning": "앞일을 미리 보아서 판단하는 총명. 앞일을 미리 내다보는 밝은 슬기"
  },
  {
    "id": "idiom-bd324f2db8b0",
    "word": "선공후사",
    "hanja": "先公後私",
    "meaning": "공적인 일을 먼저하고 사적인 일을 뒤로 미룸"
  },
  {
    "id": "idiom-93041f100fbe",
    "word": "선남선녀",
    "hanja": "善男善女",
    "meaning": "보통사람"
  },
  {
    "id": "idiom-0eb9cf5a0995",
    "word": "선례후학",
    "hanja": "先禮後學",
    "meaning": "먼저 예의를 배우고 나중에 학문을 배우라는 뜻. 예의의 중요성을 강조하는 말"
  },
  {
    "id": "idiom-e1c8aa099638",
    "word": "선발제인",
    "hanja": "先發制人",
    "meaning": "전쟁에서 기선을 제압해야 승리할 수 있다는 뜻"
  },
  {
    "id": "idiom-7ed714110448",
    "word": "선시선종",
    "hanja": "善始善終",
    "meaning": "처음이나 끝이나 한결같이 잘 함"
  },
  {
    "id": "idiom-618b82cb819e",
    "word": "선시어외",
    "hanja": "先始於巍",
    "meaning": "가까이 있는 너부터 또는 말한 사람부터 시작하라는 말"
  },
  {
    "id": "idiom-7960e7b25cba",
    "word": "선우후락",
    "hanja": "先憂後樂",
    "meaning": "근심은 남보다 먼저 근심하고, 즐거운 일은 남보다 나중에 즐거워함. (어진 사람의 마음씨)"
  },
  {
    "id": "idiom-47cf204b6adc",
    "word": "선유자익",
    "hanja": "善游者溺",
    "meaning": "헤엄을 잔치는 사람은 물에 빠져 죽기 쉽다. 즉 자기의 재능을 과신하면 화를 입게 된다"
  },
  {
    "id": "idiom-e3424f75dde8",
    "word": "선의후리",
    "hanja": "先義後利",
    "meaning": "먼저 의를 따지고 나중에 이익을 추구한다"
  },
  {
    "id": "idiom-1dcad009930c",
    "word": "선자옥질",
    "hanja": "仙姿玉質",
    "meaning": "용모가 아름답고 재질도 뛰어남"
  },
  {
    "id": "idiom-af276aba1bc4",
    "word": "선종외시",
    "hanja": "先從隗始",
    "meaning": "먼저 외로부터 시작하라. 큰일을 이루려면 먼저 작은 일부터 시작하여야 한다"
  },
  {
    "id": "idiom-ddd6eff355c1",
    "word": "선즉제인",
    "hanja": "先則制人",
    "meaning": "선수를 쓰면 남을 제압할 수 있음"
  },
  {
    "id": "idiom-271975b2b694",
    "word": "선풍도골",
    "hanja": "仙風道骨",
    "meaning": "뛰어난 풍채와 골격"
  },
  {
    "id": "idiom-89c4e8504456",
    "word": "선행후교",
    "hanja": "先行後敎",
    "meaning": "선인의 행위를 들어 후학을 가르침"
  },
  {
    "id": "idiom-e9b05d06b6f7",
    "word": "설니홍조",
    "hanja": "雪泥鴻爪",
    "meaning": "눈이 녹은 진땅에 큰 기러기가 걸어가 발자취를 남기나 그것은 곧 사라진다. (인생이 허무함)"
  },
  {
    "id": "idiom-d1272dc528b0",
    "word": "설망어검",
    "hanja": "舌芒於劍",
    "meaning": "혀는 칼보다 날카로움"
  },
  {
    "id": "idiom-35325623e56c",
    "word": "설부화용",
    "hanja": "雪膚花容",
    "meaning": "흰 살결에 고운 얼굴 (미인의 얼굴)"
  },
  {
    "id": "idiom-f496c9583821",
    "word": "설상가상",
    "hanja": "雪上加霜",
    "meaning": "어려운 일 위에 또 어려운 일이 겹침."
  },
  {
    "id": "idiom-915e6c8f3b53",
    "word": "설왕설래",
    "hanja": "說往說來",
    "meaning": "서로 辯論을 주고받으며 옥신각신함"
  },
  {
    "id": "idiom-e0b5507a56d1",
    "word": "설중송백",
    "hanja": "雪中松柏",
    "meaning": "송백은 눈 속에서도 그 색이 변하지 않는다 하여 사람의 節操가 굳은 데 비유하는 말이다"
  },
  {
    "id": "idiom-9ca22a1d90e9",
    "word": "섬섬옥수",
    "hanja": "纖纖玉手",
    "meaning": "가냘프고 고운 여자의 손"
  },
  {
    "id": "idiom-e5c58de9d525",
    "word": "성경시보",
    "hanja": "誠敬是寶",
    "meaning": "성실 공경 이것이 보배다"
  },
  {
    "id": "idiom-b19cbe3e564c",
    "word": "성동격서",
    "hanja": "聲東擊西",
    "meaning": "병법의 하나로 동쪽을 친다고 소리 질러 놓고 실제로는 서쪽을 친다"
  },
  {
    "id": "idiom-3190dab576ee",
    "word": "성인지미",
    "hanja": "成人之美",
    "meaning": "남의 뛰어난 점을 도와 더욱 빛나게 하는 일"
  },
  {
    "id": "idiom-92a3fc297688",
    "word": "성자필쇠",
    "hanja": "盛者必衰",
    "meaning": "한 번 성한 자는 반드시 쇠할 때가 있다는 말"
  },
  {
    "id": "idiom-e59217824dd2",
    "word": "성하지맹",
    "hanja": "城下之盟",
    "meaning": "적에게 성을 정복당하고서 항복하여 맺은 강화 (講和)의 맹약 (盟約). 대단히 굴욕적인 강화"
  },
  {
    "id": "idiom-2ca73e245dd7",
    "word": "성호사서",
    "hanja": "城狐社鼠",
    "meaning": "임금 옆에 있는 간사한 신하"
  },
  {
    "id": "idiom-4a33dc1517b3",
    "word": "성화요원",
    "hanja": "星火燎原",
    "meaning": "별똥처럼 작은 불이 들을 태우듯 사소한 것을 방치하면 나중에 매우 큰 재난을 가져온다"
  },
  {
    "id": "idiom-0297e3420ef0",
    "word": "세고취화",
    "hanja": "勢孤取和",
    "meaning": "자기편의 세력이 약할 때는 화평을 취하라는 뜻"
  },
  {
    "id": "idiom-e33cbf3ad802",
    "word": "세답족백",
    "hanja": "洗踏足白",
    "meaning": "상전의 빨래에 종의 발뒤꿈치가 희어진다는 뜻으로 남의 일을 하여 얻어지는 소득"
  },
  {
    "id": "idiom-ecf3dda6a818",
    "word": "세덕장상",
    "hanja": "世德長祥",
    "meaning": "덕으로 처세하면 길이 상서롭다"
  },
  {
    "id": "idiom-fa9877235095",
    "word": "세리지교",
    "hanja": "勢利之交",
    "meaning": "권세와 이익을 얻기 위한 교제"
  },
  {
    "id": "idiom-262801c0eb1d",
    "word": "세속오계",
    "hanja": "世俗五戒",
    "meaning": "화랑들에게 지켜야 할 다섯 가지 계율. (事君以忠 事親以孝 交友以信 臨戰無退 殺生有擇)"
  },
  {
    "id": "idiom-ed8ee8ff9d0d",
    "word": "세여파죽",
    "hanja": "勢如破竹",
    "meaning": "기세가 대나무를 쪼개는 것과도 같다는 뜻. (=破竹之勢)"
  },
  {
    "id": "idiom-cc57d2b11a0b",
    "word": "세한고절",
    "hanja": "歲寒孤節",
    "meaning": "추운 계절에도 혼자 푸르른 대나무. 겨울"
  },
  {
    "id": "idiom-9d1d53c5fc45",
    "word": "세한삼우",
    "hanja": "歲寒三友",
    "meaning": "겨울철 관상용인 소나무, 대나무, 매화나무"
  },
  {
    "id": "idiom-511d50e7e345",
    "word": "세한송백",
    "hanja": "歲寒松柏",
    "meaning": "임금 옆에 있는 간사한 신하를 말한다"
  },
  {
    "id": "idiom-8db02aa93563",
    "word": "소국과민",
    "hanja": "小國寡民",
    "meaning": "적은 나라 적은 백성, 노자가 이야기하는 가장 이상적인 국가형태"
  },
  {
    "id": "idiom-0c99d74f3846",
    "word": "소리장도",
    "hanja": "笑裏藏刀",
    "meaning": "외면으로는 웃으면서 온화한 척 하지만, 마음속에는 음흉하게 칼을 품고 있음 (=口蜜腹劍)"
  },
  {
    "id": "idiom-9e413ea8178a",
    "word": "소복재근",
    "hanja": "小福在勤",
    "meaning": "조그만 복은 부지런함에 달려있다"
  },
  {
    "id": "idiom-600c49ff5e52",
    "word": "소이부답",
    "hanja": "笑而不答",
    "meaning": "웃기만 하고 대답을 하지 않음"
  },
  {
    "id": "idiom-d70ca06d5f9a",
    "word": "소인묵객",
    "hanja": "騷人墨客",
    "meaning": "詩文이나 書畵를 일삼는 사람"
  },
  {
    "id": "idiom-19b4a23893b8",
    "word": "소인지용",
    "hanja": "小人之勇",
    "meaning": "혈기에서 오는 匹夫의 용기"
  },
  {
    "id": "idiom-0c7f33fb798f",
    "word": "소탐대실",
    "hanja": "小貪大失",
    "meaning": "작은 이익을 탐하다 더 큰 것을 잃음."
  },
  {
    "id": "idiom-8a12b9cd77af",
    "word": "소향무적",
    "hanja": "所向無敵",
    "meaning": "이르는 곳마다 맞설 싸울 사람이 없다는 뜻으로, 막강한 세력을 뜻한다"
  },
  {
    "id": "idiom-876681276afa",
    "word": "속거천리",
    "hanja": "速去千里",
    "meaning": "어서 멀리 가라는 뜻으로 귀신을 물리칠 때에 쓰는 말"
  },
  {
    "id": "idiom-0c7cd33b8f9b",
    "word": "속수무책",
    "hanja": "束手無策",
    "meaning": "어찌 할 도리 없이 꼼짝 못 함"
  },
  {
    "id": "idiom-3e87a11baed4",
    "word": "속수지례",
    "hanja": "束脩之禮",
    "meaning": "묶은 육포의 예절 스승을 처음 만나 가르침을 청할 때 작은 선물을 함으로써 예절을 갖추는 것"
  },
  {
    "id": "idiom-7d478cec8bd5",
    "word": "속전속결",
    "hanja": "速戰速決",
    "meaning": "장기전을 피하고 속전으로 전국을 판가름하는 것"
  },
  {
    "id": "idiom-f031b577d642",
    "word": "손강영설",
    "hanja": "孫康映雪",
    "meaning": "孫姜이 집이 가난하여 기름을 구하지 못해서 쌓인 눈빛에 비추어 책을 읽었다는 고사"
  },
  {
    "id": "idiom-6275d4eed15a",
    "word": "손순매아",
    "hanja": "孫順埋兒",
    "meaning": "손순이 어머니에 대한 효도를 다하기 위하여 아이를 묻었다는 설화. (효심이 지극함)"
  },
  {
    "id": "idiom-7975ed5a1418",
    "word": "손자삼요",
    "hanja": "損者三樂",
    "meaning": "驕慢을 좋아하고, 놀기를 좋아하고, 주색을 좋아하는 것을 말함"
  },
  {
    "id": "idiom-e3053aae9393",
    "word": "손자삼우",
    "hanja": "損者三友",
    "meaning": "사귀면 손해를 보는 벗. 편벽한 사람, 착하지만 줏대 없는 사람, 말만 앞세우고 성실하지 못한 사람"
  },
  {
    "id": "idiom-59f356dfafbc",
    "word": "솔선수범",
    "hanja": "率先垂範",
    "meaning": "먼저 자신이 본보기를 보이는 것"
  },
  {
    "id": "idiom-8ea8198a33ae",
    "word": "송구영신",
    "hanja": "送舊迎新",
    "meaning": "묵은해를 보내고 새해를 맞음"
  },
  {
    "id": "idiom-3b3a4f7f8996",
    "word": "송무백열",
    "hanja": "松茂栢悅",
    "meaning": "소나무가 무성해지니 잣나무가 기뻐한다. 친구의 잘 됨을 기뻐한다는 의미로 쓰인다"
  },
  {
    "id": "idiom-efc86114d064",
    "word": "송백지조",
    "hanja": "松柏之操",
    "meaning": "소나무와 잣나무의 푸르름처럼 변하지 않는 지조"
  },
  {
    "id": "idiom-db45af157fcb",
    "word": "송양지인",
    "hanja": "宋襄之仁",
    "meaning": "쓸데없는 인정을 베푸는 것"
  },
  {
    "id": "idiom-a7334fccdc9c",
    "word": "수간모옥",
    "hanja": "數間茅屋",
    "meaning": "두서너 칸밖에 안되는 띳집. 오두막집"
  },
  {
    "id": "idiom-232ccb7cf1b9",
    "word": "수구초심",
    "hanja": "首丘初心",
    "meaning": "여우가 죽을 때 고향 쪽으로 머리를 둔다는데 서 고향을 생각하는 마음을 말함"
  },
  {
    "id": "idiom-ef56fa0a444d",
    "word": "수도어행",
    "hanja": "水到魚行",
    "meaning": "물이 이르면 고기가 그 물 속을 가게 된다. 무슨 일이건 때가 되면 이루어진다는 의미"
  },
  {
    "id": "idiom-30b53e99eab7",
    "word": "수명어천",
    "hanja": "受命於天",
    "meaning": "하늘로부터 명을 받음"
  },
  {
    "id": "idiom-b3d9deb4ac8f",
    "word": "수명장수",
    "hanja": "壽命長壽",
    "meaning": "수명이 길어 오래도록 삶"
  },
  {
    "id": "idiom-28e5208038cb",
    "word": "수문수답",
    "hanja": "隨問隨答",
    "meaning": "물으면 묻는 대로 거침없이 대답함"
  },
  {
    "id": "idiom-7d7c16e2d15f",
    "word": "수복강녕",
    "hanja": "壽福康寧",
    "meaning": "오래살고 복되며, 몸이 건강하고 편안함"
  },
  {
    "id": "idiom-42213b0dee9d",
    "word": "수불석권",
    "hanja": "手不釋卷",
    "meaning": "손에서 책을 놓지 않음의 뜻. 즉, 열심히 공부함을 일컬음"
  },
  {
    "id": "idiom-605297852de8",
    "word": "수서양단",
    "hanja": "首鼠兩端",
    "meaning": "진퇴를 정하지 못하고 망설임, 두 마음을 가지고 기회를 봄"
  },
  {
    "id": "idiom-b99dd71afe37",
    "word": "수석침류",
    "hanja": "漱石枕流",
    "meaning": "돌로 양치질하고 흐르는 물을 베개 삼는다. 말을 잘못해 놓고 그럴 듯하게 꾸며대는 것"
  },
  {
    "id": "idiom-5c95c5ca268b",
    "word": "수세불통",
    "hanja": "水泄不通",
    "meaning": "물이 샐 틈이 없다. 단속이 엄하여 비밀이 새어 나가지 못한다"
  },
  {
    "id": "idiom-3e7bf9442140",
    "word": "수수방관",
    "hanja": "袖手傍觀",
    "meaning": "직접 나서지 않고 곁에서 지켜보기만 함."
  },
  {
    "id": "idiom-7ce2e2377dac",
    "word": "수신제가",
    "hanja": "修身齊家",
    "meaning": "행실을 닦고 집안을 바로 잡음"
  },
  {
    "id": "idiom-74d6aa23b96f",
    "word": "수심가지",
    "hanja": "水深可知",
    "meaning": "물의 깊이는 알 수 있으나 사람의 속마음은 헤아리기가 어렵다는 뜻"
  },
  {
    "id": "idiom-c8e8ec78ca7a",
    "word": "수어지교",
    "hanja": "水魚之交",
    "meaning": "물과 물고기처럼 떨어질 수 없는 친밀한 관계."
  },
  {
    "id": "idiom-2ebbc65b0c42",
    "word": "수오지심",
    "hanja": "羞惡之心",
    "meaning": "자신의 그릇됨을 부끄러워하고 남의 바르지 못함을 미워하는 마음. 의 (義)의 근본이다"
  },
  {
    "id": "idiom-269ff21f12f7",
    "word": "수원수구",
    "hanja": "誰怨誰咎",
    "meaning": "누굴 원망하며 누굴 탓할 것인가. 남을 원망하거나 책망할 것이 없음을 이르는 말이다"
  },
  {
    "id": "idiom-4a9eb6ca38e7",
    "word": "수적천석",
    "hanja": "水滴穿石",
    "meaning": "떨어지는 물방울이 돌을 뚫는다는 뜻으로, 작은 노력이라도 끈기 있게 하면 큰일을 이룰 수 있음"
  },
  {
    "id": "idiom-d3421811b2a2",
    "word": "수족지애",
    "hanja": "手足之愛",
    "meaning": "형제 사이의 우애를 일컫는 말"
  },
  {
    "id": "idiom-cf5a73fe1882",
    "word": "수주대토",
    "hanja": "守株待兎",
    "meaning": "어리석게 한 가지만 기다려 융통성이 없음. 노력 없이 성공을 바람"
  },
  {
    "id": "idiom-d9a2d1fcbe92",
    "word": "수주탄작",
    "hanja": "隨株彈雀",
    "meaning": "隨株 수후의 구슬로 날아가는 참새를 쏜다. 적은 것을 얻으려고 큰 것을 버림 (=小貪大失)"
  },
  {
    "id": "idiom-eb64670ca8ee",
    "word": "수즉다욕",
    "hanja": "壽則多辱",
    "meaning": "오래 살수록 망신스러운 일을 많이 겪게 됨"
  },
  {
    "id": "idiom-3d711ad62ab9",
    "word": "수하친병",
    "hanja": "手下親兵",
    "meaning": "자기에게 직접 딸린 병졸, 자기의 수족처럼 마음대로 부리는 사람"
  },
  {
    "id": "idiom-cebb4097aead",
    "word": "숙맥불변",
    "hanja": "菽麥不辨",
    "meaning": "콩인지 보리인지 분별하지 못한다. 어리석고 못난 사람"
  },
  {
    "id": "idiom-c3471fe8ce5d",
    "word": "숙수지환",
    "hanja": "菽水之歡",
    "meaning": "콩을 먹고 물을 마시는 가난한 생활을 하면서도 부모에게 효성을 다하는 즐거움"
  },
  {
    "id": "idiom-d6e3fe1f859b",
    "word": "숙습난방",
    "hanja": "宿習難防",
    "meaning": "몸에 밴 습관은 고치기가 어렵다"
  },
  {
    "id": "idiom-c96b47be08e7",
    "word": "숙호충비",
    "hanja": "宿虎衝鼻",
    "meaning": "자는 범 코침 주기. 화를 스스로 불러들이는 일"
  },
  {
    "id": "idiom-23dfffe81d9b",
    "word": "순결무구",
    "hanja": "純潔無垢",
    "meaning": "마음과 몸이 아주 깨끗하여 조금도 더러운 때가 없다"
  },
  {
    "id": "idiom-fcf9a6c0b07e",
    "word": "순망치한",
    "hanja": "脣亡齒寒",
    "meaning": "가까이 의지하던 한쪽이 무너지면 다른 쪽도 위태로워짐."
  },
  {
    "id": "idiom-2175f82bf863",
    "word": "순치보거",
    "hanja": "脣齒輔車",
    "meaning": "이와 입술처럼 서로 없어서는 안 될 사이"
  },
  {
    "id": "idiom-e83f5dfffc29",
    "word": "순치지국",
    "hanja": "脣齒之國",
    "meaning": "이해관계가 밀접하여 입술과 이와의 관계 같은 나라"
  },
  {
    "id": "idiom-47ff18c3cbd4",
    "word": "순치지세",
    "hanja": "脣齒之勢",
    "meaning": "입술과 이처럼 서로 의지하는 관계"
  },
  {
    "id": "idiom-af3814d83948",
    "word": "술이불작",
    "hanja": "述而不作",
    "meaning": "'참된 창작은 옛것을 토대로 자연스럽게 태어난다.'는 공자의 말씀"
  },
  {
    "id": "idiom-0c6a7fca99ad",
    "word": "숭덕광업",
    "hanja": "崇德廣業",
    "meaning": "높은 덕과 큰 사업. 또, 덕을 높이고 업을 넓힘"
  },
  {
    "id": "idiom-76f7f5ec4356",
    "word": "슬갑도적",
    "hanja": "膝甲盜賊",
    "meaning": "남의 시문 (詩文)을 표절하여 쓰는 사람을 일컫는 말이다"
  },
  {
    "id": "idiom-5ca7d1806f91",
    "word": "승기자염",
    "hanja": "勝己者厭",
    "meaning": "속인은 자기보다 재능이 많은 사람을 싫어한다는 뜻"
  },
  {
    "id": "idiom-3b24dc1620fc",
    "word": "승당입실",
    "hanja": "升堂入室",
    "meaning": "마루에 올라 방에 든다는 뜻으로 모든 일은 순서가 있음을 이르는 말, 학문이 점점 깊어짐을 비유"
  },
  {
    "id": "idiom-fac03210810d",
    "word": "승승장구",
    "hanja": "乘勝長驅",
    "meaning": "싸움에서 이긴 기세를 타고 계속 적을 몰아침"
  },
  {
    "id": "idiom-7544cad66004",
    "word": "시근종태",
    "hanja": "始勤終怠",
    "meaning": "처음에 일을 시작할 때는 부지런하나 나중에는 게으름을 피움"
  },
  {
    "id": "idiom-ed4523ce1321",
    "word": "시비곡직",
    "hanja": "是非曲直",
    "meaning": "옳고 그르고 굽고 곧음"
  },
  {
    "id": "idiom-d629802fb1fb",
    "word": "시비지심",
    "hanja": "是非之心",
    "meaning": "시비를 가릴 줄 아는 마음. 是非之心智之端也옳고 그름을 가리는 마음은 지 (智)의 근본이다"
  },
  {
    "id": "idiom-82e1fc51976c",
    "word": "시산혈해",
    "hanja": "屍山血海",
    "meaning": "시체가 산처럼 쌓이고 피가 바다처럼 많음"
  },
  {
    "id": "idiom-6cc9254de53a",
    "word": "시시각각",
    "hanja": "時時刻刻",
    "meaning": "시간이 흐름에 따라 시각마다"
  },
  {
    "id": "idiom-99441c741c48",
    "word": "시시비비",
    "hanja": "是是非非",
    "meaning": "옳고 그름을 가리어 밝힘"
  },
  {
    "id": "idiom-0b75349de1e5",
    "word": "시야비야",
    "hanja": "是耶非耶",
    "meaning": "옳으니 그르니 하고 시비를 가림"
  },
  {
    "id": "idiom-ffed29f4c97f",
    "word": "시위소찬",
    "hanja": "尸位素餐",
    "meaning": "벼슬의 책임은 다하지 않고 봉록만 먹는다"
  },
  {
    "id": "idiom-a3858ca351f8",
    "word": "시종여일",
    "hanja": "始終如一",
    "meaning": "처음이나 나중이 한결같아서 변함없음"
  },
  {
    "id": "idiom-cd8daa338bc8",
    "word": "시종일관",
    "hanja": "始終一貫",
    "meaning": "처음과 끝이 같음"
  },
  {
    "id": "idiom-744a12b3e6e4",
    "word": "시행착오",
    "hanja": "施行錯誤",
    "meaning": "일을 되풀이하면서 고쳐 나감"
  },
  {
    "id": "idiom-65219736f716",
    "word": "시혜종덕",
    "hanja": "施惠種德",
    "meaning": "은혜를 베풀고 덕을 심는다"
  },
  {
    "id": "idiom-7c0c18f0d291",
    "word": "식불감미",
    "hanja": "食不感味",
    "meaning": "먹어도 맛을 느끼지 못한다는 말. (제갈량의 출사표에 나오는 말)"
  },
  {
    "id": "idiom-034131601efc",
    "word": "식불이미",
    "hanja": "食不二味",
    "meaning": "음식을 잘 차려 먹지 아니함"
  },
  {
    "id": "idiom-eef5688ea524",
    "word": "식소사번",
    "hanja": "食少事煩",
    "meaning": "먹을 것은 적고 할일은 많음"
  },
  {
    "id": "idiom-a0aea33c7cec",
    "word": "식자우환",
    "hanja": "識字憂患",
    "meaning": "학식이 도리어 근심을 이끌어 옴"
  },
  {
    "id": "idiom-81d0cdad89f3",
    "word": "식전방장",
    "hanja": "食前方丈",
    "meaning": "사방 열 자짜리 상에 차린 잘 차린 음식이라는 뜻으로 호화롭게 많이 차린 성찬"
  },
  {
    "id": "idiom-1b069b644cab",
    "word": "신상필벌",
    "hanja": "信賞必罰",
    "meaning": "공이 있는 사람에게는 반드시 상을 주고, 죄가 있는 사람에게는 반드시 벌을 줌"
  },
  {
    "id": "idiom-8a112ce482f7",
    "word": "신언서판",
    "hanja": "身言書判",
    "meaning": "인물을 선택하는 네 가지 조건. 몸, 말씨, 글씨, 판단력"
  },
  {
    "id": "idiom-a4ef55dd1f66",
    "word": "신은구의",
    "hanja": "新恩久義",
    "meaning": "새로운 은혜, 오래된 의리라는 뜻으로, 은혜는 조조에 대한 것이요, 의리는 유비에 대한 것이다"
  },
  {
    "id": "idiom-f4b440c146ce",
    "word": "신진대사",
    "hanja": "新陳代謝",
    "meaning": "묵은 것이 없어지고 새것이 대신 생기는 일"
  },
  {
    "id": "idiom-74392fed8ff8",
    "word": "신체발부",
    "hanja": "身體髮膚",
    "meaning": "머리끝부터 발끝까지의 몸 전체"
  },
  {
    "id": "idiom-46cacedc6c2f",
    "word": "신출귀몰",
    "hanja": "神出鬼沒",
    "meaning": "자유자재로 출몰하여 그 변화를 헤아릴 수 없음"
  },
  {
    "id": "idiom-27dd695455bb",
    "word": "신토불이",
    "hanja": "身土不二",
    "meaning": "몸과 태어난 땅은 하나라는 뜻으로, 제 땅에서 산출된 것이라야 체질에 잘 맞는다는 말"
  },
  {
    "id": "idiom-24355ae0de24",
    "word": "신통지력",
    "hanja": "神通之力",
    "meaning": "신통력. 헤아릴 수 없는 변화의 재주를 가진 힘"
  },
  {
    "id": "idiom-7ec6d8085cf8",
    "word": "실리추구",
    "hanja": "實利追求",
    "meaning": "현실적인 이익을 추구함"
  },
  {
    "id": "idiom-4685466d91da",
    "word": "실사구시",
    "hanja": "實事求是",
    "meaning": "있는 그대로의 사실 즉, 실제에 입각해서 그 일의 진상을 찾고 구하는 것을 말한다"
  },
  {
    "id": "idiom-d42f08e4c9a4",
    "word": "실천궁행",
    "hanja": "實踐躬行",
    "meaning": "말로 하지 않고 실천하며, 남에게 시키지 않고 몸소 행함"
  },
  {
    "id": "idiom-6ef43e20f29b",
    "word": "심기일전",
    "hanja": "心機一轉",
    "meaning": "어떠한 동기에 의하여 이제까지 행동하고 먹었던 마음을 좋은 쪽으로 바꿈"
  },
  {
    "id": "idiom-671548b682f8",
    "word": "심사숙고",
    "hanja": "深思熟考",
    "meaning": "깊이 생각하고 곧 신중을 기하여 곰곰이 생각함"
  },
  {
    "id": "idiom-df2b984795d3",
    "word": "심심상인",
    "hanja": "心心相印",
    "meaning": "마음에서 마음으로 전함. 이심전심"
  },
  {
    "id": "idiom-711055ef2f5a",
    "word": "심재홍곡",
    "hanja": "心在鴻鵠",
    "meaning": "바둑을 두면서 마음은 기러기나 고니가 날아오면 쏘아 맞출 것만 생각함 (마음은 다른 곳에 씀)"
  },
  {
    "id": "idiom-2914c5a8e8a9",
    "word": "십년지계",
    "hanja": "十年之計",
    "meaning": "십년의 큰 계획 (나무를 심는 일)"
  },
  {
    "id": "idiom-9487d6207018",
    "word": "십년지기",
    "hanja": "十年知己",
    "meaning": "여러 해 친하게 사귀어 온 친구"
  },
  {
    "id": "idiom-4e2ceb8cd4f3",
    "word": "십년한창",
    "hanja": "十年寒窓",
    "meaning": "십년동안 사람이 오지 않아 쓸쓸한 창문 (오랫동안 열심히 공부한 세월)"
  },
  {
    "id": "idiom-8b5d0aabad1d",
    "word": "십맹일장",
    "hanja": "十盲一杖",
    "meaning": "열 소경에 한 막대기. 어떠한 사물이 여러 곳에 다같이 긴요하게 쓰임을 가리키는 말"
  },
  {
    "id": "idiom-99c9cd7c6945",
    "word": "십목소시",
    "hanja": "十目所視",
    "meaning": "열개 (여러 개)의 눈이 보는 바와 같음이라는 뜻으로, 여러 사람이 다같이 보고 있는 것"
  },
  {
    "id": "idiom-7d2ff190f95c",
    "word": "십벌지목",
    "hanja": "十伐之木",
    "meaning": "열 번 찍어 안 넘어가는 나무가 없다는 뜻"
  },
  {
    "id": "idiom-9eb84c842dde",
    "word": "십보방초",
    "hanja": "十步芳草",
    "meaning": "열 걸음 안에 아름다운 꽃과 풀이 있다. 도처에 人才가 있다"
  },
  {
    "id": "idiom-1f858bffe1ad",
    "word": "십상팔구",
    "hanja": "十常八九",
    "meaning": "열이면 여덟이나 아홉은 그러함"
  },
  {
    "id": "idiom-21bfb78bda4c",
    "word": "십시일반",
    "hanja": "十匙一飯",
    "meaning": "여러 사람이 한 사람 구제하기는 쉬움"
  },
  {
    "id": "idiom-eb8920d2766f",
    "word": "십일지국",
    "hanja": "十日之菊",
    "meaning": "국화는 9월 9일이 절정이므로 이미 때가 늦었다는 말"
  },
  {
    "id": "idiom-0e1c8d370721",
    "word": "십전구도",
    "hanja": "十顚九倒",
    "meaning": "여러 가지 고생을 겪음"
  },
  {
    "id": "idiom-c3c8e7d60381",
    "word": "십중팔구",
    "hanja": "十中八九",
    "meaning": "열 가운데 여덟이나 아홉. 거의 예외 없이 그러할 것이라는 추측"
  },
  {
    "id": "idiom-7850779ba434",
    "word": "아가사창",
    "hanja": "我歌査唱",
    "meaning": "내가 부를 노래를 사돈이 부른다. 즉 책망을 받을 사람이 도리어 큰 소리를 침"
  },
  {
    "id": "idiom-12418279b58a",
    "word": "아동주졸",
    "hanja": "兒童走卒",
    "meaning": "철없는 아이들과 어리석은 사람들"
  },
  {
    "id": "idiom-d1e55d88d4f4",
    "word": "아비규환",
    "hanja": "阿鼻叫喚",
    "meaning": "阿鼻는 八大地獄의 8번째로 고통을 못 참아 울부짖는 소리"
  },
  {
    "id": "idiom-f90aa4941373",
    "word": "아수라장",
    "hanja": "阿修羅場",
    "meaning": "阿修羅'는 산스크리트 'asur'의 音譯으로 추악하다는 뜻이다 (끔찍하게 흐트러진 현장)"
  },
  {
    "id": "idiom-e694d87e01ba",
    "word": "아심여칭",
    "hanja": "我心如秤",
    "meaning": "내 마음은 공정한 저울과 같아 어느 한 쪽으로 기울어지지 않음"
  },
  {
    "id": "idiom-75c91c05097d",
    "word": "아전인수",
    "hanja": "我田引水",
    "meaning": "일을 자기에게 유리한 쪽으로만 해석하거나 처리함."
  },
  {
    "id": "idiom-ea46c94ad642",
    "word": "악목도천",
    "hanja": "惡木盜泉",
    "meaning": "더워도 나쁜 나무 그늘에서 쉬지 않고, 목이 말라도 盜란 나쁜 이름이 붙은 샘물은 마시지 않음"
  },
  {
    "id": "idiom-bf05da9f6364",
    "word": "악목불음",
    "hanja": "惡木不蔭",
    "meaning": "나쁜 나무에는 그늘이 생기지 않는다. 덕망이 있어야만 주변에 따르는 무리들이 많다"
  },
  {
    "id": "idiom-4aa023af397d",
    "word": "악발토포",
    "hanja": "握髮吐哺",
    "meaning": "주공이 감던 머리를 쥐고 입에 든 밥을 뱉고 찾아온 손을 만났다는 일에서, 인재를 아낌을 비유"
  },
  {
    "id": "idiom-d7871b3d89f2",
    "word": "악의악식",
    "hanja": "惡衣惡食",
    "meaning": "좋지 못한 옷을 입고 맛없는 음식을 먹음. 또는, 그런 옷과 음식"
  },
  {
    "id": "idiom-4663880b5fae",
    "word": "악인악과",
    "hanja": "惡因惡果",
    "meaning": "악한 일을 하면 반드시 그 결과가 나쁘게 나타난다는 말"
  },
  {
    "id": "idiom-ba71b663a74f",
    "word": "악전고투",
    "hanja": "惡戰苦鬪",
    "meaning": "죽을힘을 다하여 고되게 싸움"
  },
  {
    "id": "idiom-fb2f77cf8eaa",
    "word": "안고수비",
    "hanja": "眼高手卑",
    "meaning": "눈은 높으나 손은 낮다는 의미로 이상은 높으나 그에 따른 행동이 미치지 못함을 일컬음"
  },
  {
    "id": "idiom-b931196753e8",
    "word": "안분지족",
    "hanja": "安分知足",
    "meaning": "자기 처지에 맞게 살며 만족할 줄 앎."
  },
  {
    "id": "idiom-42bfb150044b",
    "word": "안불망위",
    "hanja": "安不忘危",
    "meaning": "편안할 때도 마음을 놓지 않고 위태로움에 항상 대비함"
  },
  {
    "id": "idiom-29fa78b28cd0",
    "word": "안빈낙도",
    "hanja": "安貧樂道",
    "meaning": "구차한 중에도 편한 마음으로 도를 즐김"
  },
  {
    "id": "idiom-2ccc074e16f5",
    "word": "안심입명",
    "hanja": "安心立命",
    "meaning": "생사 (生死)의 이해에 대하여 태연함. 생사의 도리를 깨달아 내세의 안심을 꾀함"
  },
  {
    "id": "idiom-083fa263ad6a",
    "word": "안여태산",
    "hanja": "安如泰山",
    "meaning": "편안하기가 태산과 같음"
  },
  {
    "id": "idiom-269cd4352a51",
    "word": "안자지어",
    "hanja": "晏子之御",
    "meaning": "안자의 마부. 변변치 못한 지위를 믿고 우쭐대는 기량이 작은 사람"
  },
  {
    "id": "idiom-b9e82635b5f9",
    "word": "안중무인",
    "hanja": "眼中無人",
    "meaning": "자기밖에 없듯 교만하여 사람을 업신여김 (=眼下無人)"
  },
  {
    "id": "idiom-0dfab1a00f25",
    "word": "안중지인",
    "hanja": "眼中之人",
    "meaning": "눈 속에 있는 사람. 情든 사람을 뜻한다. 눈앞에 없어도 평생 사귄 사람을 일컫기도 한다"
  },
  {
    "id": "idiom-23843373eb45",
    "word": "안중지정",
    "hanja": "眼中之釘",
    "meaning": "항상 눈에 거슬리는 사람"
  },
  {
    "id": "idiom-6d43680d9eb7",
    "word": "안하무인",
    "hanja": "眼下無人",
    "meaning": "눈 아래 사람이 없음. 곧 교만하여 사람을 업신여김"
  },
  {
    "id": "idiom-38c3ed5f4bfa",
    "word": "암중모색",
    "hanja": "暗中摸索",
    "meaning": "어둠 속에서 손으로 더듬어 찾음"
  },
  {
    "id": "idiom-bf7bcd37ef65",
    "word": "암중비약",
    "hanja": "暗中飛躍",
    "meaning": "비밀한 가운데 맹렬히 활동함"
  },
  {
    "id": "idiom-b3bfdbacf36e",
    "word": "앙급지어",
    "hanja": "殃及池魚",
    "meaning": "성에 난 불을 끄느라 연못물을 퍼다 썼더니 못의 고기가 죽었다 (다른 재앙을 불러옴)"
  },
  {
    "id": "idiom-331789767db4",
    "word": "애걸복걸",
    "hanja": "哀乞伏乞",
    "meaning": "갖은 수단으로 머리 숙여 빌고 빌다"
  },
  {
    "id": "idiom-7ebdd6e0e47c",
    "word": "애국애족",
    "hanja": "愛國愛族",
    "meaning": "자기의 나라와 겨레를 사랑함"
  },
  {
    "id": "idiom-42ec2ebf0a28",
    "word": "애매모호",
    "hanja": "曖昧模糊",
    "meaning": "사물의 이치가 희미하고 분명치 않음"
  },
  {
    "id": "idiom-4c9583f03880",
    "word": "애별리고",
    "hanja": "愛別離苦",
    "meaning": "불교에서 말하는 八苦의 하나. 사랑하는 사람과 헤어져야 하는 괴로움"
  },
  {
    "id": "idiom-34f8e4905ebb",
    "word": "애불승희",
    "hanja": "哀不勝喜",
    "meaning": "슬픔은 기쁨을 이기지 못한다"
  },
  {
    "id": "idiom-b3646d1d271a",
    "word": "애사호죽",
    "hanja": "哀絲豪竹",
    "meaning": "관현의 소리가 비장하여 사람을 감동시킴을 이름"
  },
  {
    "id": "idiom-ed6af28d79e6",
    "word": "애석폐고",
    "hanja": "哀惜弊袴",
    "meaning": "헤진 헌 바지도 남에게 그냥 주기를 아까워함"
  },
  {
    "id": "idiom-ae9f0da0cebf",
    "word": "애이불비",
    "hanja": "哀而不悲",
    "meaning": "속으로는 슬퍼하지만 겉으로는 슬픔을 나타내지 아니함"
  },
  {
    "id": "idiom-51503fc355a9",
    "word": "애이불상",
    "hanja": "哀而不傷",
    "meaning": "슬퍼 허나 마음이 상하지 않도록 슬퍼함"
  },
  {
    "id": "idiom-c10e40a5ae57",
    "word": "애인여기",
    "hanja": "愛人如己",
    "meaning": "남을 자기 몸같이 사랑함. 다른 사람들을 사랑하는 사람은 다른 사람들도 늘 그를 사랑해준다"
  },
  {
    "id": "idiom-2adca007e418",
    "word": "애지중지",
    "hanja": "愛之重之",
    "meaning": "매우 사랑하고 귀중히 여김"
  },
  {
    "id": "idiom-a010ac6b3b30",
    "word": "애훼골립",
    "hanja": "哀毁骨立",
    "meaning": "부모의 죽음을 슬퍼하여 몸이 바싹 여윔"
  },
  {
    "id": "idiom-0fc3ff366eaa",
    "word": "야단법석",
    "hanja": "野壇法席",
    "meaning": "野壇이란 야외에 세운 단이란 뜻이고, 法席은 불법을 펴는 자리라는 뜻이다"
  },
  {
    "id": "idiom-7b8482cb60fe",
    "word": "약롱중물",
    "hanja": "藥籠中物",
    "meaning": "항상 곁에 있어야할 인물, 심복"
  },
  {
    "id": "idiom-224cec863a62",
    "word": "약방감초",
    "hanja": "藥房甘草",
    "meaning": "무슨 일이나 빠짐없이 끼임 반드시 끼어야할 사물"
  },
  {
    "id": "idiom-b0f09befed10",
    "word": "약섭대수",
    "hanja": "若涉大水",
    "meaning": "큰 개천을 건너는 것과 같은 위험함"
  },
  {
    "id": "idiom-4024e6f4b0ef",
    "word": "약육강식",
    "hanja": "弱肉强食",
    "meaning": "약한 놈이 강한 놈에게 먹힘"
  },
  {
    "id": "idiom-f745fba0035c",
    "word": "양금택목",
    "hanja": "良禽擇木",
    "meaning": "현명한 사람을 자기 재능을 키워줄 사람을 가려서 섬김"
  },
  {
    "id": "idiom-d4a9e31ff054",
    "word": "양두구육",
    "hanja": "羊頭狗肉",
    "meaning": "그럴 듯하게 내세우나 속은 음융함"
  },
  {
    "id": "idiom-31267b8e3c25",
    "word": "양상군자",
    "hanja": "梁上君子",
    "meaning": "도둑을 점잖게 일컫는 말"
  },
  {
    "id": "idiom-cef1aad3ab66",
    "word": "양수겸장",
    "hanja": "兩手兼將",
    "meaning": "하나의 표적에 대하여 두 방향에서 공격해 들어감"
  },
  {
    "id": "idiom-03a5cf7c740e",
    "word": "양약고구",
    "hanja": "良藥苦口",
    "meaning": "좋은 말은 귀에 거슬림 (=良藥苦於口而於病)"
  },
  {
    "id": "idiom-812d4b9c84cf",
    "word": "양지양능",
    "hanja": "良志良能",
    "meaning": "교육이나 체험에 의하지 아니하고 선천적으로 알고 행할 수 있는 능력"
  },
  {
    "id": "idiom-d651c6a76df1",
    "word": "양지지효",
    "hanja": "養志之孝",
    "meaning": "항상 부모의 뜻을 받들어 마음을 기쁘게 해드리는 효행"
  },
  {
    "id": "idiom-62e98f12d709",
    "word": "양포지구",
    "hanja": "楊布之狗",
    "meaning": "겉모습이 변한 것을 보고, 속까지 변해버렸다고 판단하는 사람을 일컫는 말"
  },
  {
    "id": "idiom-318d364045f1",
    "word": "양호상투",
    "hanja": "兩虎相鬪",
    "meaning": "두 호랑이가 서로 싸운다. 두 영웅 또는 두 나라가 서로 싸우는 것"
  },
  {
    "id": "idiom-17b0be38e93b",
    "word": "양호유환",
    "hanja": "養虎遺患",
    "meaning": "호랑이를 길러 근심을 남김. 스스로 화를 자초했다는 뜻"
  },
  {
    "id": "idiom-7934f7666d2f",
    "word": "양호후환",
    "hanja": "養虎後患",
    "meaning": "범을 길렀다가 그 범에 물린다는 뜻 은혜를 베풀었다가 도리어 해를 당함을 비유 (=養虎遺患)"
  },
  {
    "id": "idiom-22f8d586ac06",
    "word": "어두육미",
    "hanja": "魚頭肉尾",
    "meaning": "물고기의 머리와 짐승의 꼬리라는 뜻으로 어류는 머리가 육류는 꼬리가 맛이 좋음을 이르는 말"
  },
  {
    "id": "idiom-3005a330bc42",
    "word": "어로불변",
    "hanja": "魚魯不辨",
    "meaning": "魚자와 魯자를 구별하지 못함. 매우 무식함"
  },
  {
    "id": "idiom-979f8040f154",
    "word": "어망홍리",
    "hanja": "魚網鴻離",
    "meaning": "고기를 잡으려고 그물을 쳤는데 기러기가 걸렸다"
  },
  {
    "id": "idiom-aae3d481535f",
    "word": "어목연석",
    "hanja": "魚目燕石",
    "meaning": "魚目은 물고기의 눈, 燕石은 燕山의 돌. 모두 玉과 비슷하여 옥으로 혼동함"
  },
  {
    "id": "idiom-b42e79542331",
    "word": "어변성룡",
    "hanja": "魚變成龍",
    "meaning": "물고기가 변하여 용이 됨. 어릴 적에는 신통치 못하던 사람이 자라서 훌륭하게 됨을 일컬음"
  },
  {
    "id": "idiom-9638cf768b94",
    "word": "어부지리",
    "hanja": "漁夫之利",
    "meaning": "두 쪽이 다투는 사이 제삼자가 이익을 얻음."
  },
  {
    "id": "idiom-d7c1c6365e66",
    "word": "어불성설",
    "hanja": "語不成說",
    "meaning": "말이 이치에 맞지 않음"
  },
  {
    "id": "idiom-1e8539a49db8",
    "word": "어수지친",
    "hanja": "魚水之親",
    "meaning": "고기와 물의 친함. 임금과 백성이 친밀한 것을 일컬음, 부부간의 정을 말하기도 함 (=水魚之交)"
  },
  {
    "id": "idiom-726d192134fe",
    "word": "어유부중",
    "hanja": "魚遊釜中",
    "meaning": "고기가 솥 속에서 논다. 목숨이 붙어 있다 할지라도 오래 가지 못할 것을 비유함 (=釜中之魚)"
  },
  {
    "id": "idiom-3287c269b1bc",
    "word": "억강부약",
    "hanja": "抑强扶弱",
    "meaning": "강한 자를 누르고, 약한 자를 도와줌"
  },
  {
    "id": "idiom-e1669743e256",
    "word": "언감생심",
    "hanja": "焉敢生心",
    "meaning": "어찌 감히 그런 마음을 먹을 수 있으랴'라는 뜻"
  },
  {
    "id": "idiom-829a021a95ce",
    "word": "언과기실",
    "hanja": "言過其實",
    "meaning": "실제보다 말이 더 앞선다는 뜻"
  },
  {
    "id": "idiom-bb9269d97e2d",
    "word": "언문일치",
    "hanja": "言文一致",
    "meaning": "실제로 쓰는 말과 글이 꼭 같음"
  },
  {
    "id": "idiom-33330c28cdd5",
    "word": "언문풍월",
    "hanja": "諺文風月",
    "meaning": "지난날, 우리 글로 지은 시가 따위를 얕보아 이르던 말"
  },
  {
    "id": "idiom-f1718da286c7",
    "word": "언비천리",
    "hanja": "言飛千里",
    "meaning": "발 없는 말이 천리를 간다는 뜻으로, 말이 빠르게 멀리 퍼진다는 말"
  },
  {
    "id": "idiom-f131949a5de2",
    "word": "언서지망",
    "hanja": "偃鼠之望",
    "meaning": "쥐는 작은 동물이라서 강물을 마신대야 자기 배하나 가득히 밖에 더 못 마신다"
  },
  {
    "id": "idiom-913b6d5f8eb7",
    "word": "언어도단",
    "hanja": "言語道斷",
    "meaning": "말문이 막힌다는 뜻으로, 어이가 없어 이루 말로 나타낼 수 없음을 이르는 말"
  },
  {
    "id": "idiom-6e7a597b5f6c",
    "word": "언자부지",
    "hanja": "言者不知",
    "meaning": "떠들어 대는 사람은 알지 못하는 것이다"
  },
  {
    "id": "idiom-1ad8a7b88fbc",
    "word": "언중유골",
    "hanja": "言中有骨",
    "meaning": "예사로운 말 속에 심상치 않은 뜻이 있음"
  },
  {
    "id": "idiom-c998ecc1602f",
    "word": "언즉시야",
    "hanja": "言則是也",
    "meaning": "말이 사리에 맞음"
  },
  {
    "id": "idiom-1b8bf6e59f30",
    "word": "언출위론",
    "hanja": "言出爲論",
    "meaning": "말을 하면 經論이고 (言出爲論 下筆成文원어)"
  },
  {
    "id": "idiom-1371c6ff8058",
    "word": "언행일치",
    "hanja": "言行一致",
    "meaning": "말과 행동이 일치함"
  },
  {
    "id": "idiom-032f96ee8ec9",
    "word": "엄동설한",
    "hanja": "嚴冬雪寒",
    "meaning": "눈이 오는 몹시 추운 겨울"
  },
  {
    "id": "idiom-bb1b745e8a84",
    "word": "엄목포작",
    "hanja": "掩目捕雀",
    "meaning": "눈을 가리고 참새를 잡으려 한다. 일을 성취하려면 성실하게 하지 않으면 안 된다는 뜻"
  },
  {
    "id": "idiom-93be5ee7b0b0",
    "word": "엄이도령",
    "hanja": "掩耳盜鈴",
    "meaning": "자기 귀를 가리고 방울을 훔친다는 뜻"
  },
  {
    "id": "idiom-d185e6ca2d63",
    "word": "엄이도종",
    "hanja": "掩耳盜鐘",
    "meaning": "귀를 막고 종을 훔친다. 자기만 듣지 않으면 남도 듣지 못한다고 생각하는 어리석은 행동"
  },
  {
    "id": "idiom-a8323739fc84",
    "word": "여고금슬",
    "hanja": "如鼓琴瑟",
    "meaning": "거문고와 비파의 합주처럼 부부가 화합함"
  },
  {
    "id": "idiom-13bcecc8b025",
    "word": "여단수족",
    "hanja": "如斷手足",
    "meaning": "손발이 끊어진 것처럼 의지할 곳이 없음"
  },
  {
    "id": "idiom-d17121d46f75",
    "word": "여도지죄",
    "hanja": "餘桃之罪",
    "meaning": "애증과 증오의 변화가 심함"
  },
  {
    "id": "idiom-6741119670d5",
    "word": "여리박빙",
    "hanja": "如履薄氷",
    "meaning": "살얼음을 밟는 것과 같음을 의미. 즉, 처세에 극히 조심함을 이르는 말"
  },
  {
    "id": "idiom-20b128ba0a89",
    "word": "여물위춘",
    "hanja": "與物爲春",
    "meaning": "만물과 함께 봄을 즐긴다는 뜻"
  },
  {
    "id": "idiom-daf4bf4b05d5",
    "word": "여민동락",
    "hanja": "與民同樂",
    "meaning": "왕이 백성과 즐거움을 함께 나눔을 말한다"
  },
  {
    "id": "idiom-c78e87cf84c3",
    "word": "여세추이",
    "hanja": "如世推移",
    "meaning": "세상이 변하는 대로 따라 변함"
  },
  {
    "id": "idiom-11b77d674396",
    "word": "여자동포",
    "hanja": "與子同袍",
    "meaning": "자네와 두루마기를 같이 입겠네. 친구 사이에 서로 허물없이 무관하여 하는 말"
  },
  {
    "id": "idiom-903b8e68b34c",
    "word": "여조과목",
    "hanja": "與鳥過目",
    "meaning": "새가 눈앞을 스쳐 날아가는 것처럼 빨리 지나치는 것에 비유한 말"
  },
  {
    "id": "idiom-46e657b92a4a",
    "word": "여족여수",
    "hanja": "如足如手",
    "meaning": "형제는 몸에서 떼어놓을 수 없는 팔다리와 같다는 말"
  },
  {
    "id": "idiom-bbee846a84c8",
    "word": "여좌침석",
    "hanja": "如坐針席",
    "meaning": "바늘방석에 앉은 것처럼 몹시 불안하다 (=坐不安席)"
  },
  {
    "id": "idiom-239b20db0ffb",
    "word": "여쾌등오",
    "hanja": "與筷等伍",
    "meaning": "한나라 한신이 살아 있을 때 번쾌와 어깨를 나란히 하였다 하여 한탄한 말"
  },
  {
    "id": "idiom-9ad32efd1dbf",
    "word": "여풍과이",
    "hanja": "與風過耳",
    "meaning": "바람이 귀를 지나가듯 조금도 그 일에 관련이 없음"
  },
  {
    "id": "idiom-4aa8a89da2a7",
    "word": "여필종부",
    "hanja": "女必從夫",
    "meaning": "아내는 반드시 남편에게 순종해야 함"
  },
  {
    "id": "idiom-52e3562d918f",
    "word": "역자교지",
    "hanja": "易子敎之",
    "meaning": "자식을 서로 바꾸어 가르친다는 뜻으로, 부모가 자기 자식을 가르치기는 어렵다. (=易子而敎之)"
  },
  {
    "id": "idiom-c8d7203c4806",
    "word": "역지사지",
    "hanja": "易地思之",
    "meaning": "상대의 처지에 서서 생각함."
  },
  {
    "id": "idiom-025eccd42054",
    "word": "연도일할",
    "hanja": "鉛刀一割",
    "meaning": "납으로 만든 칼도 한번은 자를 힘이 있다. 자기가 약하다고 겸손하게 하는 말로도 쓰임"
  },
  {
    "id": "idiom-b2b26a859ee6",
    "word": "연마장양",
    "hanja": "鍊磨長養",
    "meaning": "갈고 닦고 오래도록 준비하여 옴"
  },
  {
    "id": "idiom-ed8d86e4720d",
    "word": "연모지정",
    "hanja": "戀慕之情",
    "meaning": "사랑하여 그리워하는 정"
  },
  {
    "id": "idiom-1743558bdcd3",
    "word": "연목구어",
    "hanja": "緣木求魚",
    "meaning": "나무에 올라가서 물고기를 구함 되지 않을 일을 무리하게 하려고 함"
  },
  {
    "id": "idiom-c7a5766a20f5",
    "word": "연비어약",
    "hanja": "鳶飛魚躍",
    "meaning": "하늘에 솔개가 날고 물 속에 고기가 뛰어노는 것이 자연스럽고 조화로움"
  },
  {
    "id": "idiom-192624e9ea58",
    "word": "연전연승",
    "hanja": "連戰連勝",
    "meaning": "싸울 때마다 빈번히 이김"
  },
  {
    "id": "idiom-662f3a37e9cf",
    "word": "연하고질",
    "hanja": "煙霞痼疾",
    "meaning": "산과 물을 매우 사랑하는 것이 마치 고치지 못할 병이 든 것 같음"
  },
  {
    "id": "idiom-893df13ec188",
    "word": "연홍지탄",
    "hanja": "燕鴻之歎",
    "meaning": "봄과 가을에 엇갈리는 제비와 기러기처럼 서로 반대의 입장이 되어 만나지 못함 (=燕雁代飛)"
  },
  {
    "id": "idiom-49bcf71ab4f4",
    "word": "염량세태",
    "hanja": "炎凉世態",
    "meaning": "권세가 있을 때에는 아첨하여 쫓고 권세가 떨어지면 푸대접하는 세속의 인심"
  },
  {
    "id": "idiom-4baf00fad727",
    "word": "염불위괴",
    "hanja": "恬不爲愧",
    "meaning": "옳지 않은 일을 하고도 전혀 부끄러워할 줄 모름"
  },
  {
    "id": "idiom-834b7bd2a192",
    "word": "염화미소",
    "hanja": "拈華微笑",
    "meaning": "말로 하지 않고 마음에서 마음으로 전하는 일을 뜻하는 말. (=以心傳心)"
  },
  {
    "id": "idiom-b47c3c2e6e72",
    "word": "염화시중",
    "hanja": "拈華示衆",
    "meaning": "마음에서 마음으로 전함"
  },
  {
    "id": "idiom-8608c1da5527",
    "word": "영고성쇠",
    "hanja": "榮枯盛衰",
    "meaning": "사람의 일생이나 나라의 운명이 필 때도 있고 질 때도 있으며 융성할 때도 있고 쇠퇴할 때도 있음을 뜻한다"
  },
  {
    "id": "idiom-3447b6d89af7",
    "word": "영만지구",
    "hanja": "盈滿之咎",
    "meaning": "가득 차면 기울고 넘친다. 만사가 다 이루어지면 도리어 화를 가져오게 될 수 있음을 뜻함"
  },
  {
    "id": "idiom-9522e2ddbc7b",
    "word": "영생불멸",
    "hanja": "永生不滅",
    "meaning": "죽지 않고 영원히 살아 없어지지 않음"
  },
  {
    "id": "idiom-c6afda1db681",
    "word": "영서연설",
    "hanja": "郢書燕說",
    "meaning": "이치에 맞지 않는 것을 억지로 끌어다 붙여 도리에 맞는 것처럼 말한다는 뜻"
  },
  {
    "id": "idiom-1dffaec4757c",
    "word": "영세무궁",
    "hanja": "永世無窮",
    "meaning": "영원토록 무궁함"
  },
  {
    "id": "idiom-1b49065ece8e",
    "word": "영영무궁",
    "hanja": "永永無窮",
    "meaning": "영원하도록 길고 끝없이 오램"
  },
  {
    "id": "idiom-a72147f7f230",
    "word": "예미도종",
    "hanja": "曳尾塗中",
    "meaning": "부귀속의 구속된 생활을 하는 것보다는 비록 가난하더라도 자유로운 생활을 누리는 것이 낫다"
  },
  {
    "id": "idiom-378dadf37a0e",
    "word": "예지단야",
    "hanja": "禮之端也",
    "meaning": "겸허하게 양보하는 마음은 禮의 근본이다"
  },
  {
    "id": "idiom-7de4596c40a2",
    "word": "오거지서",
    "hanja": "五車之書",
    "meaning": "다섯 수레에 가득 실을 정도로 장서가 많음"
  },
  {
    "id": "idiom-d47848e482cb",
    "word": "오관육참",
    "hanja": "五關六斬",
    "meaning": "관우가 원소 밑에 있던 유비를 만나기 위해 그를 가로막는 다섯 관문의 장수 여섯을 베었다. 그의"
  },
  {
    "id": "idiom-8f87077bc7ca",
    "word": "오관참장",
    "hanja": "五關斬將",
    "meaning": "관우가 단기로 조조의 다섯 관문 장수들을 차례로 베고 유비에게 들어갔다"
  },
  {
    "id": "idiom-10e15efae6c4",
    "word": "오동일엽",
    "hanja": "梧桐一葉",
    "meaning": "오동 한 잎을 보고 가을이 온 것을 안다. 한 가지 구실을 보면 일의 전말을 알 수 있다는 말로 쓰인다"
  },
  {
    "id": "idiom-8b0c5647ad02",
    "word": "오리무중",
    "hanja": "五里霧中",
    "meaning": "일의 갈피나 방향을 전혀 알 수 없음."
  },
  {
    "id": "idiom-479476bc6a90",
    "word": "오매불망",
    "hanja": "寤寐不忘",
    "meaning": "늘 잊지 못함 (자나 깨나 잊지 못함)"
  },
  {
    "id": "idiom-7c23e62e70d8",
    "word": "오매사복",
    "hanja": "寤寐思服",
    "meaning": "자나 깨나 생각하는 것을 말한다"
  },
  {
    "id": "idiom-a460768e5943",
    "word": "오불관언",
    "hanja": "吾不關焉",
    "meaning": "나는 상관하지 아니함"
  },
  {
    "id": "idiom-72a4fa0d8b8e",
    "word": "오비삼척",
    "hanja": "吾鼻三尺",
    "meaning": "네코가 석 자. 곧, 자기도 곤경에 처하여 감당할 수가 없어 남을 도울 여유가 없음을 일컬음"
  },
  {
    "id": "idiom-d6c9802318bf",
    "word": "오비이락",
    "hanja": "烏飛梨落",
    "meaning": "까마귀 날자 배 떨어진다. 일이 공교롭게 같이 일어나 남의 의심을 받게 됨"
  },
  {
    "id": "idiom-e30cdc300d02",
    "word": "오비토주",
    "hanja": "烏飛兎走",
    "meaning": "세월이 빨리 흘러감을 이르는 말"
  },
  {
    "id": "idiom-7a76c4e4a414",
    "word": "오상고절",
    "hanja": "傲霜孤節",
    "meaning": "굽히지 않는 절개"
  },
  {
    "id": "idiom-a5f2d12099f0",
    "word": "오색영롱",
    "hanja": "五色玲瓏",
    "meaning": "여러 가지 빛이 한데 섞이어 찬란하게 비침"
  },
  {
    "id": "idiom-0012538d9d98",
    "word": "오손공주",
    "hanja": "烏孫公主",
    "meaning": "정략결혼의 희생이 된 슬픈 운명의 여인"
  },
  {
    "id": "idiom-42900bfc84c4",
    "word": "오언장성",
    "hanja": "五言長城",
    "meaning": "五言詩를 잘 짓는 것이나 萬里長城은 보통 사람으로서는 바랄 수 없는 일임을 비유하는 말이다"
  },
  {
    "id": "idiom-b79048856114",
    "word": "오우천월",
    "hanja": "吳牛喘月",
    "meaning": "吳나라의 소가 더위를 두려워해서 달을 보고도 해 인줄 알고 헐떡인다. (지레 짐작으로 걱정함)"
  },
  {
    "id": "idiom-b5aaf50554a6",
    "word": "오운지진",
    "hanja": "烏雲之陣",
    "meaning": "까마귀가 흩어지는 것 구름이 모이는 것과 같이 모임과 흩어짐이 계속되면서 변화가 많은 陣法을 말함"
  },
  {
    "id": "idiom-01c9bd0da926",
    "word": "오월동주",
    "hanja": "吳越同舟",
    "meaning": "서로 적대하던 사람들이 같은 상황에서 협력하게 됨."
  },
  {
    "id": "idiom-18e4726d5f61",
    "word": "오유선생",
    "hanja": "烏有先生",
    "meaning": "상식적으로는 도저히 있을 수 없는 사람"
  },
  {
    "id": "idiom-ca80e7784f9f",
    "word": "오음성고",
    "hanja": "五陰盛苦",
    "meaning": "불교에서 이르는 팔고의 하나 오온이 불같이 일어나서 생기는 고통"
  },
  {
    "id": "idiom-5332a85fdc86",
    "word": "오장육부",
    "hanja": "五臟六腑",
    "meaning": "내장의 총칭"
  },
  {
    "id": "idiom-0f92b5e61140",
    "word": "오풍십우",
    "hanja": "五風十雨",
    "meaning": "기후가 매우 순조로운 것. 또는 세월이 평화로움"
  },
  {
    "id": "idiom-dabedab162a8",
    "word": "오하아몽",
    "hanja": "吳下阿蒙",
    "meaning": "오나라 아래에 의지하고 있는 여몽. 학문의 소양도 없는 보잘 것 없는 인물"
  },
  {
    "id": "idiom-03155d3bb3a7",
    "word": "오합지졸",
    "hanja": "烏合之卒",
    "meaning": "까마귀가 모인 것 같은 무리. 질서 없이 어중이떠중이가 모인 군중을 뜻한다"
  },
  {
    "id": "idiom-9104e86709d5",
    "word": "오합지중",
    "hanja": "烏合之衆",
    "meaning": "까마귀 떼와 같이 조직도 훈련도 없이 모인 무리"
  },
  {
    "id": "idiom-3fc1e9d4dc1a",
    "word": "옥골선풍",
    "hanja": "玉骨仙風",
    "meaning": "뛰어난 풍채와 골격"
  },
  {
    "id": "idiom-113d9bc0edbc",
    "word": "옥석구분",
    "hanja": "玉石俱焚",
    "meaning": "좋은 것과 나쁜 것이 함께 망하는 것을 일컫는 말이다"
  },
  {
    "id": "idiom-470524503ddd",
    "word": "옥석동궤",
    "hanja": "玉石同匱",
    "meaning": "옥과 돌이 한 궤짝 속에 있음. 혹은 똑똑한 사람과 어리석은 사람이 한데 섞여 있는 경우"
  },
  {
    "id": "idiom-8e7ef46dbeb7",
    "word": "옥석혼효",
    "hanja": "玉石混淆",
    "meaning": "훌륭한 것과 쓸데없는 것이 뒤섞여 있음"
  },
  {
    "id": "idiom-f6d9a80c834c",
    "word": "옥오지애",
    "hanja": "屋烏之愛",
    "meaning": "사람이 사랑스러우면 그 사람의 집에 있는 까마귀까지 귀여워함"
  },
  {
    "id": "idiom-d5f84cbad14b",
    "word": "옥의옥식",
    "hanja": "玉衣玉食",
    "meaning": "좋은 옷을 입고 맛있는 음식을 먹음"
  },
  {
    "id": "idiom-8c56b7355738",
    "word": "옥하가옥",
    "hanja": "屋下架屋",
    "meaning": "집 아래 집을 다시 짓는다. 부질없이 모방만 하고 새로운 발전이 없음을 가리키는 말이다"
  },
  {
    "id": "idiom-757f27c34ab2",
    "word": "온고지신",
    "hanja": "溫故知新",
    "meaning": "옛 것을 익히어 새것을 앎)"
  },
  {
    "id": "idiom-ababf3a3e47e",
    "word": "온정신성",
    "hanja": "溫凊晨省",
    "meaning": "겨울에는 따뜻하게 여름에는 시원하게 해드림 정성을 다해 부모를 모시다"
  },
  {
    "id": "idiom-76d18a7f9923",
    "word": "와각지쟁",
    "hanja": "蝸角之爭",
    "meaning": "하찮은 일로 실랑이를 함"
  },
  {
    "id": "idiom-486300643f36",
    "word": "와부뇌명",
    "hanja": "瓦釜雷鳴",
    "meaning": "질그릇과 솥이 부딪치는 소리를 듣고 천둥이 치는 소리로 착각함"
  },
  {
    "id": "idiom-77e6d29e3bd2",
    "word": "와신상담",
    "hanja": "臥薪嘗膽",
    "meaning": "섶에 눕고 쓸개를 맛본다는 뜻으로 원수를 갚고자 고생을 참고 견딤"
  },
  {
    "id": "idiom-885e452b03c7",
    "word": "완물상지",
    "hanja": "玩物喪志",
    "meaning": "쓸 데 없는 물건을 가지고 노는 데 정신이 팔려 소중한 자기의 의지를 잃음"
  },
  {
    "id": "idiom-97da12ad6f45",
    "word": "왈가왈부",
    "hanja": "曰可曰否",
    "meaning": "옳거니 그르니 하고 말함"
  },
  {
    "id": "idiom-9cd45d174cda",
    "word": "왕좌지재",
    "hanja": "王座之才",
    "meaning": "왕을 섬길만한 재주를 지닌 사람이라는 뜻. 하옹이 순욱을 보고 이렇게 평하였다"
  },
  {
    "id": "idiom-b1c744b1f461",
    "word": "왕척직심",
    "hanja": "枉尺直尋",
    "meaning": "작은 욕에 얽매이지 않고 큰일을 이룸을 이르는 말"
  },
  {
    "id": "idiom-c66a2d16afa1",
    "word": "왕후장상",
    "hanja": "王侯將相",
    "meaning": "제왕과 제후와 장수와 재상을 함께 이르는 말"
  },
  {
    "id": "idiom-caa5250dd080",
    "word": "왜인관장",
    "hanja": "矮人觀場",
    "meaning": "자신은 아무것도 모르면서 남이 그렇다고 하니까 덩달아 그렇다고 하는 것을 비유 (=矮子看戱)"
  },
  {
    "id": "idiom-0ba74faf20e3",
    "word": "왜자간희",
    "hanja": "矮者看戱",
    "meaning": "난장이가 키가 작아 구경은 못하고 남들이 보고 얘기하는 소리를 듣고 자기가 본척 아는 척 함"
  },
  {
    "id": "idiom-f25f27e2d7ef",
    "word": "외유내강",
    "hanja": "外柔內剛",
    "meaning": "겉으로 보기에는 부드러 우나 속은 꿋꿋하고 강함"
  },
  {
    "id": "idiom-97b1cac13b95",
    "word": "외친내소",
    "hanja": "外親內疎",
    "meaning": "겉으로는 친한 척하면서 속으로는 멀리함"
  },
  {
    "id": "idiom-b9cd161a9879",
    "word": "외허내실",
    "hanja": "外虛內實",
    "meaning": "겉으로는 보잘 것 없으나 속으로는 충실함"
  },
  {
    "id": "idiom-264e93bcb674",
    "word": "요동지시",
    "hanja": "遼東之豕",
    "meaning": "견문이 좁고 오만한 탓에 하찮은 공을 득의양양하여 자랑함"
  },
  {
    "id": "idiom-18eb9c142514",
    "word": "요령부득",
    "hanja": "要領不得",
    "meaning": "말이나 글의 요령을 잡을 수 없음"
  },
  {
    "id": "idiom-0fdebcffddc4",
    "word": "요산요수",
    "hanja": "樂山樂水",
    "meaning": "智者樂水 仁者樂山의 줄 인말. 지혜 있는 자는 물을 좋아하고, 어진 자는 산을 좋아한다는 뜻"
  },
  {
    "id": "idiom-e2aa908f1320",
    "word": "요원지화",
    "hanja": "爎原之火",
    "meaning": "들판을 태우는 불. 세력이 대단해서 막을 수 없게 되는 것을 비유하는 말이다"
  },
  {
    "id": "idiom-999abd144a83",
    "word": "요조숙녀",
    "hanja": "窈窕淑女",
    "meaning": "마음씨가 얌전하고 자태가 아름다운 여자"
  },
  {
    "id": "idiom-f46a62f67e36",
    "word": "요지부동",
    "hanja": "搖之不動",
    "meaning": "흔들어도 꼼짝 않음"
  },
  {
    "id": "idiom-a05046313637",
    "word": "욕교반졸",
    "hanja": "欲巧反拙",
    "meaning": "기교를 너무 부리면 도리어 못 하게 됨"
  },
  {
    "id": "idiom-816cee26f897",
    "word": "욕사무지",
    "hanja": "欲死無地",
    "meaning": "죽으려고 하여도 죽을 만한 땅이 없다는 뜻으로 매우 분하고 원통함"
  },
  {
    "id": "idiom-dfb36fa0982d",
    "word": "욕소필연",
    "hanja": "欲燒筆硯",
    "meaning": "붓과 벼루를 태워버리고 싶다. 남이 지은문장의 보고 자신의 재주가 그에 미치지 못함을 탄식함"
  },
  {
    "id": "idiom-94961c5a1d85",
    "word": "욕속부달",
    "hanja": "欲速不達",
    "meaning": "마음만 급하다고 일이 잘 되는 게 아니라는 뜻. 즉, 매사를 하나씩 차근차근 풀어나가라는 말"
  },
  {
    "id": "idiom-3da87e201c5a",
    "word": "용두사미",
    "hanja": "龍頭蛇尾",
    "meaning": "시작이 좋고 나중은 나빠짐"
  },
  {
    "id": "idiom-bff631b0d3bd",
    "word": "용미봉탕",
    "hanja": "龍尾鳳湯",
    "meaning": "맛이 썩 좋은 음식을 가리키는 말"
  },
  {
    "id": "idiom-babbb5f8feb3",
    "word": "용사비등",
    "hanja": "龍蛇飛騰",
    "meaning": "용과 뱀이 나는 것과 같이 글씨가 힘참"
  },
  {
    "id": "idiom-67da82a05b72",
    "word": "용여득운",
    "hanja": "龍如得雲",
    "meaning": "용이 구름을 얻듯이 큰 인물이 활동할 기회를 얻음의 비유"
  },
  {
    "id": "idiom-8e2c48e97d81",
    "word": "용의주도",
    "hanja": "用意周到",
    "meaning": "마음의 준비가 두루 미쳐 빈틈이 없음"
  },
  {
    "id": "idiom-4cde851ef9c3",
    "word": "용자불구",
    "hanja": "勇者不懼",
    "meaning": "용감한 사람은 道義를 위해서 목숨을 아끼지 않음 (어떠한 경우를 당하여서도 두려워하지 않음)"
  },
  {
    "id": "idiom-c283c32c67e4",
    "word": "용호상박",
    "hanja": "龍虎相搏",
    "meaning": "용과 범이 서로 싸우다. 강한 사람이나 나라가 서로 싸우는 것"
  },
  {
    "id": "idiom-c2e024005dc8",
    "word": "용혹무괴",
    "hanja": "容或無怪",
    "meaning": "짐작하여 헤아릴만한 사정이 있는 것"
  },
  {
    "id": "idiom-71fef4a1f796",
    "word": "우공이산",
    "hanja": "愚公移山",
    "meaning": "꾸준히 노력하면 어려운 일도 이룰 수 있음."
  },
  {
    "id": "idiom-9a2cbee4e50a",
    "word": "우국지사",
    "hanja": "憂國之士",
    "meaning": "나라의 앞일을 근심하고 염려하는 사람"
  },
  {
    "id": "idiom-204c8a6a594f",
    "word": "우도할계",
    "hanja": "牛刀割鷄",
    "meaning": "닭을 잡는 데에 어찌 소 잡는 칼을 쓰랴. 조그만 일을 처리하는 데 大器를 씀"
  },
  {
    "id": "idiom-2177214f4c8c",
    "word": "우문현답",
    "hanja": "愚問賢答",
    "meaning": "어리석은 질문에 현명한 대답"
  },
  {
    "id": "idiom-82cbdc0904a7",
    "word": "우부우부",
    "hanja": "愚夫愚婦",
    "meaning": "어리석은 지아비와 지어미"
  },
  {
    "id": "idiom-11d4358b36a7",
    "word": "우수마발",
    "hanja": "牛溲馬勃",
    "meaning": "쇠오줌과 말 똥, 곧 별반 대수롭지 않은 물건을 뜻함"
  },
  {
    "id": "idiom-880ad0c981ee",
    "word": "우수사려",
    "hanja": "憂愁思慮",
    "meaning": "근심과 걱정"
  },
  {
    "id": "idiom-ab586241d105",
    "word": "우여곡절",
    "hanja": "迂餘曲折",
    "meaning": "여러 가지로 뒤얽힌 복잡한 사정이나 변화"
  },
  {
    "id": "idiom-8108060a70f4",
    "word": "우왕마왕",
    "hanja": "牛往馬往",
    "meaning": "소 갈 데, 말 갈 데. 갈 수 있을 만한 곳은 다 다녔다는 뜻"
  },
  {
    "id": "idiom-32ec51a99965",
    "word": "우왕좌왕",
    "hanja": "右往左往",
    "meaning": "사방으로 왔다 갔다 함"
  },
  {
    "id": "idiom-31555f2c2356",
    "word": "우유부단",
    "hanja": "優柔不斷",
    "meaning": "어물어물하며 딱 잘라 결단을 내리지 못함"
  },
  {
    "id": "idiom-318db506ebf4",
    "word": "우이독경",
    "hanja": "牛耳讀經",
    "meaning": "아무리 알려 주어도 상대가 이해하거나 듣지 않음."
  },
  {
    "id": "idiom-0dfb0f867859",
    "word": "우자일득",
    "hanja": "愚者一得",
    "meaning": "어리석은 사람도 때에 따라 좋은 생각을 해 낸다"
  },
  {
    "id": "idiom-8220f7285a79",
    "word": "우자천려",
    "hanja": "愚者千慮",
    "meaning": "어리석은 자의 많은 생각"
  },
  {
    "id": "idiom-f0f78e0b0b85",
    "word": "우화등선",
    "hanja": "羽化登仙",
    "meaning": "껍질을 벗고 날개를 달아 하늘로 올라간다는 뜻으로 사람이 도를 깨쳐 신선이 됨"
  },
  {
    "id": "idiom-68173e447665",
    "word": "우후죽순",
    "hanja": "雨後竹筍",
    "meaning": "비가 온 뒤에 여기저기 무럭무럭 솟는 죽순 즉 어떠한 일이 한때에 많이 일어나는 것을 비유함"
  },
  {
    "id": "idiom-c699b2c61abe",
    "word": "욱일승천",
    "hanja": "旭日昇天",
    "meaning": "아침 해가 하늘로 오름. 그와 같은 기상"
  },
  {
    "id": "idiom-e62b11573278",
    "word": "운니지차",
    "hanja": "雲泥之差",
    "meaning": "구름과 진흙의 차이. 天地之差와 같은 말. 사정이 크게 다름을 말한다"
  },
  {
    "id": "idiom-1ff553b8d0bd",
    "word": "운산무산",
    "hanja": "雲散霧散",
    "meaning": "구름이 흩어지고 안개가 사라지듯, 근심이나 걱정이 깨끗이 사라짐의 비유"
  },
  {
    "id": "idiom-4a858a3dbdb9",
    "word": "운상기품",
    "hanja": "雲上氣稟",
    "meaning": "속됨을 벗어난 고상한 기질과 성품"
  },
  {
    "id": "idiom-b951b08a5de5",
    "word": "운수소관",
    "hanja": "運數所關",
    "meaning": "모든 일이 능력이나 노력에 상관없이 운수에 달려 있다는 생각"
  },
  {
    "id": "idiom-25ae553a3d63",
    "word": "운예지망",
    "hanja": "雲霓之望",
    "meaning": "큰 가뭄에 구름과 무지개를 바라듯 그 희망이 간절함을 비유하는 말로 쓰인다"
  },
  {
    "id": "idiom-d09f0ff63df4",
    "word": "운우지정",
    "hanja": "雲雨之情",
    "meaning": "남녀간의 육체적인 사랑"
  },
  {
    "id": "idiom-57fd08ec485c",
    "word": "운중백학",
    "hanja": "雲中白鶴",
    "meaning": "구름 속을 나는 백학. 고상한 기품을 가진 사람을 가리키는 말이다"
  },
  {
    "id": "idiom-51c56cb61af6",
    "word": "운증용변",
    "hanja": "雲蒸龍變",
    "meaning": "구름이 들끓어 용으로 변함. 영웅호걸이 때를 만나 일어남을 일컬음"
  },
  {
    "id": "idiom-71fa8ab9f683",
    "word": "원교근공",
    "hanja": "遠交近攻",
    "meaning": "먼 나라와 친교를 맺고 가까운 나라를 공격함"
  },
  {
    "id": "idiom-2c567ef52f95",
    "word": "원문사극",
    "hanja": "轅門射戟",
    "meaning": "여포가 원문에서 150보 거리에 놓아둔 화극의 곁가지를 화살로 쏘아 맞춘 일"
  },
  {
    "id": "idiom-6dca10a9b855",
    "word": "원앙지계",
    "hanja": "鴛鴦之契",
    "meaning": "琴瑟이 좋은 부부사이"
  },
  {
    "id": "idiom-27dc9fdff6e2",
    "word": "원입골수",
    "hanja": "怨入骨髓",
    "meaning": "원한이 뼈에 사무침"
  },
  {
    "id": "idiom-29adfc40c14f",
    "word": "원조방예",
    "hanja": "圓鑿方枘",
    "meaning": "둥근 구멍에 모난 자루를 넣는다는 뜻으로, 사물이 서로 맞지 않음의 비유"
  },
  {
    "id": "idiom-a2b50f4111ac",
    "word": "원증회고",
    "hanja": "怨憎會苦",
    "meaning": "불교에서 이르는 팔고의 하나 원망하거나 미워하는 사람과 만나 살아야 하는 고통"
  },
  {
    "id": "idiom-b5e0fededa75",
    "word": "원천우인",
    "hanja": "怨天尤人",
    "meaning": "하늘을 원망하고 사람을 탓함"
  },
  {
    "id": "idiom-9ccc182908d0",
    "word": "원형리정",
    "hanja": "元亨利貞",
    "meaning": "사물의 근본 원리. 만물이 처음 생겨나서 자라고 삶을 이루고 완성함. 또는 仁․義․禮․智"
  },
  {
    "id": "idiom-0d2a8a1cf05d",
    "word": "원화소복",
    "hanja": "遠禍召福",
    "meaning": "화를 멀리하고 복을 불러들임"
  },
  {
    "id": "idiom-e244e25bd3fc",
    "word": "원후취월",
    "hanja": "猿猴取月",
    "meaning": "원숭이가 물에 비친 달을 잡으려다가 물에 빠져 죽는다는 뜻 (욕심을 부리면 화를 입게 됨)"
  },
  {
    "id": "idiom-3596e2bd4883",
    "word": "월만즉휴",
    "hanja": "月滿則虧",
    "meaning": "달도 차면 이지러진다는 뜻으로, 무슨 일이든 성하면 쇠퇴하게 된다는 말"
  },
  {
    "id": "idiom-a9e06183a605",
    "word": "월명성희",
    "hanja": "月明星稀",
    "meaning": "달이 밝으면 별빛은 희미해진다는 뜻. (한 영웅이 나타나면 다른 群雄의 존재가 희미해짐)"
  },
  {
    "id": "idiom-6d2f38ff818c",
    "word": "월백풍청",
    "hanja": "月白風淸",
    "meaning": "달은 밝고 바람은 선선함. 달이 밝은 가을밤의 경치를 형용한 말"
  },
  {
    "id": "idiom-8f801f16b509",
    "word": "월영즉식",
    "hanja": "月盈則食",
    "meaning": "달이 꽉 차서 보름달이 되고 나면 줄어들어 밤하늘에 안보이게 된다. 한번 흥하면 한번은 망함을 비유함"
  },
  {
    "id": "idiom-b342bfa98ea6",
    "word": "월태화용",
    "hanja": "月態花容",
    "meaning": "달 같은 태도와 꽃 같은 얼굴"
  },
  {
    "id": "idiom-362d3e15252f",
    "word": "월하노인",
    "hanja": "月下老人",
    "meaning": "혼인을 중매하는 사람을 이르는 말"
  },
  {
    "id": "idiom-51a29958d75b",
    "word": "월하빙인",
    "hanja": "月下氷人",
    "meaning": "月下老와 氷上人이 합쳐진 말로 결혼 중매인"
  },
  {
    "id": "idiom-a31a242105ac",
    "word": "위국충절",
    "hanja": "爲國忠節",
    "meaning": "나라를 위한 충성스러운 절개"
  },
  {
    "id": "idiom-b1c404e3ac33",
    "word": "위기일발",
    "hanja": "危機一髮",
    "meaning": "거의 여유가 없는 위급한 순간"
  },
  {
    "id": "idiom-f2060c73dbe9",
    "word": "위록위마",
    "hanja": "謂鹿爲馬",
    "meaning": "사슴을 가리켜 말이라고 한다는 뜻으로 사리에 맞지 않는 억지 주장을 비유한 말 (=指鹿爲馬)"
  },
  {
    "id": "idiom-45882d7de5e8",
    "word": "위부불인",
    "hanja": "爲富不仁",
    "meaning": "致富하려면 자연히 어질지 못한 일을 하게 된다는 말"
  },
  {
    "id": "idiom-df181ad5139c",
    "word": "위수강운",
    "hanja": "渭樹江雲",
    "meaning": "渭水에 있는 나무와 江水 위에 떠 있는 구름. (멀리 떨어져 있는 벗이 서로 그리워함)"
  },
  {
    "id": "idiom-f39133dbde47",
    "word": "위여조로",
    "hanja": "危如朝露",
    "meaning": "아침 이슬은 해가 뜨면 곧 사라지듯이 위기가 임박해 있음을 말함"
  },
  {
    "id": "idiom-9221d878b1d8",
    "word": "위이불맹",
    "hanja": "威而不猛",
    "meaning": "威嚴은 있으나 결코 난폭하지 않음"
  },
  {
    "id": "idiom-8108fe7c50fa",
    "word": "위인설관",
    "hanja": "爲人設官",
    "meaning": "어떤 사람을 위해 벼슬자리를 새로이 마련함"
  },
  {
    "id": "idiom-723c83a7695b",
    "word": "위편삼절",
    "hanja": "韋編三絶",
    "meaning": "공자가 읽던 책 끈이 세 번이나 끊어졌다는 것에서 유래한 것으로 열심히 공부한다는 뜻"
  },
  {
    "id": "idiom-bce7502b33a4",
    "word": "위풍당당",
    "hanja": "威風堂堂",
    "meaning": "풍채가 위엄이 있어 당당함"
  },
  {
    "id": "idiom-a930e9a141c9",
    "word": "유고무류",
    "hanja": "有敎無類",
    "meaning": "가르침이 있으면 종류가 없다. 가르침이 있으면 모든 사람이 차별이 없다"
  },
  {
    "id": "idiom-5e4d758984ff",
    "word": "유구무언",
    "hanja": "有口無言",
    "meaning": "입은 있으나 말이 없다는 뜻으로 변명을 못함을 이름"
  },
  {
    "id": "idiom-d3144cefa20f",
    "word": "유구불언",
    "hanja": "有口不言",
    "meaning": "입은 있으되 말을 하지 않는다는 뜻, (거북하거나 따분하여 하고 싶은 말이 있어도 하지 아니함)"
  },
  {
    "id": "idiom-03efd3900ec0",
    "word": "유년만취",
    "hanja": "遺臭萬年",
    "meaning": "냄새가 만 년에까지 남겨진다. 더러운 이름을 영원히 장래에까지 남김"
  },
  {
    "id": "idiom-92f974b4a42e",
    "word": "유능제강",
    "hanja": "柔能制剛",
    "meaning": "부드러움이 능히 굳셈을 제어한다"
  },
  {
    "id": "idiom-11951cf38b2b",
    "word": "유록화홍",
    "hanja": "柳綠花紅",
    "meaning": "버들은 푸르고 꽃은 붉다. 자연에 조금도 인공을 가하지 않음을 일컫는 말이다"
  },
  {
    "id": "idiom-d8839688cd0e",
    "word": "유만부동",
    "hanja": "類萬不同",
    "meaning": "모든 것이 서로 같지 아니함"
  },
  {
    "id": "idiom-c78abe38eee9",
    "word": "유명무실",
    "hanja": "有名無實",
    "meaning": "이름뿐이고 실상은 없음"
  },
  {
    "id": "idiom-753b5127748a",
    "word": "유무상통",
    "hanja": "有無相通",
    "meaning": "있는 것과 없는 것은 서로 통한다는 뜻"
  },
  {
    "id": "idiom-da4728b1b476",
    "word": "유방백세",
    "hanja": "流芳百世",
    "meaning": "향기가 백대에 걸쳐 흐름. 꽃다운 이름이 후세에 길이 전함"
  },
  {
    "id": "idiom-25dd70560772",
    "word": "유비무환",
    "hanja": "有備無患",
    "meaning": "미리 준비하면 뒤에 걱정할 일이 없음."
  },
  {
    "id": "idiom-bd5d643e832c",
    "word": "유수불부",
    "hanja": "流水不腐",
    "meaning": "흐르는 물은 썩지 않는다. 항상 움직이는 것은 못쓰게 되지 않는다는 비유로 쓰인다"
  },
  {
    "id": "idiom-1d5f4470249a",
    "word": "유시유종",
    "hanja": "有始有終",
    "meaning": "시작할 때부터 끝을 맺을 때까지 변함이 없음"
  },
  {
    "id": "idiom-32b7a3bf217e",
    "word": "유아독존",
    "hanja": "唯我獨尊",
    "meaning": "불교에서 부처가 한 말로, 사람은 누구나 존귀하고 무한한 존재라는 의미. (=天上天下唯我獨尊)"
  },
  {
    "id": "idiom-ab1f29ace24d",
    "word": "유야무야",
    "hanja": "有耶無耶",
    "meaning": "있는지 없는지 모르게 희미함"
  },
  {
    "id": "idiom-5f90c8709cb7",
    "word": "유어부중",
    "hanja": "游於釜中",
    "meaning": "가마솥 속에서 논다. 생명이 매우 위험한 상태에 놓여 있다"
  },
  {
    "id": "idiom-63daf7accb4f",
    "word": "유언비어",
    "hanja": "流言蜚語",
    "meaning": "도무지 근거 없이 널리 퍼진 소문"
  },
  {
    "id": "idiom-f061a233b2b6",
    "word": "유위변전",
    "hanja": "有爲變轉",
    "meaning": "세상은 항상 변화무쌍하여 잠시도 머물러 있는 법이 없다는 뜻"
  },
  {
    "id": "idiom-cd3cd3c42060",
    "word": "유유상종",
    "hanja": "類類相從",
    "meaning": "끼리끼리 사귐"
  },
  {
    "id": "idiom-83471288c149",
    "word": "유유자적",
    "hanja": "悠悠自適",
    "meaning": "속세를 떠나 아무것에도 속박되지 않고 자기가 하고 싶은 대로 마음 편히 삶"
  },
  {
    "id": "idiom-d80727486f74",
    "word": "유일무이",
    "hanja": "唯一無二",
    "meaning": "오직 하나 뿐 둘도 없음"
  },
  {
    "id": "idiom-03b3430b04b6",
    "word": "유종지미",
    "hanja": "有終之美",
    "meaning": "끝맺음을 잘 마무리하는 것"
  },
  {
    "id": "idiom-8860657db233",
    "word": "유좌지기",
    "hanja": "宥坐之器",
    "meaning": "항상 곁에 두고 보는 그릇. 마음을 적당히 가지기 위해 곁에 두고 보는 그릇"
  },
  {
    "id": "idiom-bfbdd274c75f",
    "word": "유필유방",
    "hanja": "遊必有方",
    "meaning": "부모가 생존해 계실 때는 그 슬하에서 모시고 遊學을 할지라도 부모가 알 수 있도록 일정한 곳에 머물러야 한다는 뜻"
  },
  {
    "id": "idiom-0dda95c4d6cd",
    "word": "육도문자",
    "hanja": "肉跳文字",
    "meaning": "뜻을 잘못 사용한 글"
  },
  {
    "id": "idiom-1e86fd5cbd01",
    "word": "육부출충",
    "hanja": "肉腐出蟲",
    "meaning": "모든 일은 근본이 잘못되면 폐단이 백출한다는 것"
  },
  {
    "id": "idiom-d84043849390",
    "word": "육산포림",
    "hanja": "肉山脯林",
    "meaning": "고기와 술이 많음을 이름"
  },
  {
    "id": "idiom-3f2e20657aea",
    "word": "육적회귤",
    "hanja": "陸績懷橘",
    "meaning": "陸績이란사람이懷橘 (귤을품음) 부모님 생각에 귤을 소매에 넣은 일 (효성의 뜻으로 쓰임)"
  },
  {
    "id": "idiom-433c6035e42f",
    "word": "육지행선",
    "hanja": "陸地行船",
    "meaning": "뭍으로 배를 저으려 함. 되지도 않을 일을 억지로 하려 함"
  },
  {
    "id": "idiom-46bcd01a9530",
    "word": "육척지고",
    "hanja": "六尺之孤",
    "meaning": "열 너더댓 살의 부모 없는 아이"
  },
  {
    "id": "idiom-92694d549ed0",
    "word": "윤문윤무",
    "hanja": "允文允武",
    "meaning": "문무와 덕을 갖춘 착한 임금을 형용한 말"
  },
  {
    "id": "idiom-068adac31cf0",
    "word": "윤언여한",
    "hanja": "綸言如汗",
    "meaning": "임금의 綸言은 땀과 같다. 임금의 綸言은 한 번 내리면 고칠 수 없음"
  },
  {
    "id": "idiom-da2cfc6169dd",
    "word": "윤회전생",
    "hanja": "輪回轉生",
    "meaning": "생사를 반복 해감을 말함"
  },
  {
    "id": "idiom-cef1d1393ce2",
    "word": "은감불원",
    "hanja": "殷鑑不遠",
    "meaning": "은나라의 거울은 먼데 있지 않다는 뜻으로 다른 사람의 실패를 자신의 거울로 삼으라는 말"
  },
  {
    "id": "idiom-e2e0bca49c2e",
    "word": "은거방언",
    "hanja": "隱居放言",
    "meaning": "속세를 피하여 혼자 지내면서 품고 있는 생각을 거리낌 없이 말하는 것을 일컫는다"
  },
  {
    "id": "idiom-97378dafb656",
    "word": "은심원생",
    "hanja": "恩深怨生",
    "meaning": "사람에게 은혜를 베푸는 것이 도를 넘치면 오히려 원망을 받는다는 뜻"
  },
  {
    "id": "idiom-6392819b7128",
    "word": "은인자중",
    "hanja": "隱忍自重",
    "meaning": "괴로움을 참고 몸가짐을 조심함"
  },
  {
    "id": "idiom-41382e1e9936",
    "word": "을축갑자",
    "hanja": "乙丑甲子",
    "meaning": "갑자을축이 바른 차례인데 그 차례가 바뀜과 같이 일이 제대로 안되고 순서가 바뀜"
  },
  {
    "id": "idiom-bb3b44daba40",
    "word": "음덕양보",
    "hanja": "陰德陽報",
    "meaning": "남모르게 덕을 쌓은 사람은 뒤에 그 보답을 절로 받음"
  },
  {
    "id": "idiom-a1e1e7e1e3e6",
    "word": "음마투전",
    "hanja": "飮馬投錢",
    "meaning": "말에게 물을 먹일 때 먼저 돈을 물 속에 던져서 물 값을 지불할 정도로 결백한 행실을 비유함"
  },
  {
    "id": "idiom-42dea2abdfbc",
    "word": "음풍농월",
    "hanja": "吟風弄月",
    "meaning": "맑은 바람과 밝은 달을 노래함. 풍류를 즐긴다는 뜻"
  },
  {
    "id": "idiom-a7de3cb9ac58",
    "word": "읍견군폐",
    "hanja": "邑犬群吠",
    "meaning": "동네 개들이 떼 지어 짖어 댄다는 뜻으로, 여러 소인배들이 남을 비방함의 비유"
  },
  {
    "id": "idiom-c33eb7467b8d",
    "word": "읍참마속",
    "hanja": "泣斬馬謖",
    "meaning": "울면서 마속을 벤다는 뜻으로, 공정함을 지키기 위해서 사사로운 정을 버린다는 말"
  },
  {
    "id": "idiom-6037d00ec73a",
    "word": "응접불가",
    "hanja": "應接不暇",
    "meaning": "일일이 인사할 사이가 없다는 말로 아주 바쁨을 형용"
  },
  {
    "id": "idiom-12a22fca8da8",
    "word": "의금경이",
    "hanja": "衣錦褧衣",
    "meaning": "비단 옷을 입고 홑옷을 또 입음 미덕을 갖추고 있으나 이를 자랑하지 않음을 비유함 (=衣錦絅衣)"
  },
  {
    "id": "idiom-ef898abb3d19",
    "word": "의금야행",
    "hanja": "衣錦夜行",
    "meaning": "비단옷을 입고 밤에 다닌다는 뜻으로 입신출세 하여도 사람들에게 알려지지 않음을 비유"
  },
  {
    "id": "idiom-79887b621eb4",
    "word": "의금주행",
    "hanja": "衣錦晝行",
    "meaning": "의금야행과 반대되는 말로 입신출세하여 고향에 돌아감"
  },
  {
    "id": "idiom-77f33c5f7e92",
    "word": "의기소침",
    "hanja": "意氣銷沈",
    "meaning": "의기가 쇠하여 사그라짐"
  },
  {
    "id": "idiom-a5228eaf325c",
    "word": "의기양양",
    "hanja": "意氣揚揚",
    "meaning": "의기가 드높아 매우 자랑스럽게 행동하는 모양"
  },
  {
    "id": "idiom-07459b6d8374",
    "word": "의기충천",
    "hanja": "意氣衝天",
    "meaning": "의기가 하늘을 찌를 듯함"
  },
  {
    "id": "idiom-1640ef1f26ac",
    "word": "의기투합",
    "hanja": "意氣投合",
    "meaning": "서로 마음이 맞다"
  },
  {
    "id": "idiom-95b6b38ff89d",
    "word": "의마심원",
    "hanja": "意馬心猿",
    "meaning": "뜻은 말처럼 날뛰어 다루기 어렵고 마음은 원숭이처럼 이 흉내 저 흉내 다 내어 걷잡을 수 없다"
  },
  {
    "id": "idiom-77d030b62381",
    "word": "의문지망",
    "hanja": "依門之望",
    "meaning": "멀리 가 있는 아들을 매일 문에 기대어 기다리는 어머니의 정을 일컫는 말이다"
  },
  {
    "id": "idiom-93e7ddac8451",
    "word": "의미심장",
    "hanja": "意味深長",
    "meaning": "말이나 글의 뜻이 매우 깊음"
  },
  {
    "id": "idiom-a2104ae1b280",
    "word": "의방지훈",
    "hanja": "義方之訓",
    "meaning": "아버지가 아들에게 하는 교훈"
  },
  {
    "id": "idiom-53774d58cbd4",
    "word": "의불부심",
    "hanja": "義不負心",
    "meaning": "의는 마음을 저버리지 않음이라는 뜻"
  },
  {
    "id": "idiom-2b84db5db1a6",
    "word": "의심암귀",
    "hanja": "疑心暗鬼",
    "meaning": "의심하면 마음속에 망상이 일어나 불안함, 선입관이 판단을 빗나가게 함"
  },
  {
    "id": "idiom-a94206863b96",
    "word": "이관규천",
    "hanja": "以管窺天",
    "meaning": "대롱을 통해 하늘을 봄. 우물 안 개구리"
  },
  {
    "id": "idiom-cd1fd093a107",
    "word": "이구동성",
    "hanja": "異口同聲",
    "meaning": "여러 사람이 한결같은 말을 함."
  },
  {
    "id": "idiom-8b1e6737a307",
    "word": "이군삭거",
    "hanja": "離群索居",
    "meaning": "동문의 벗들과 떨어져 외롭게 사는 것을 말함"
  },
  {
    "id": "idiom-27720212d639",
    "word": "이덕보원",
    "hanja": "以德報怨",
    "meaning": "원수를 은혜로 갚는다"
  },
  {
    "id": "idiom-f97a4370383d",
    "word": "이독제독",
    "hanja": "以毒制毒",
    "meaning": "독을 없애는데 다른 독을 사용함"
  },
  {
    "id": "idiom-f254c4065403",
    "word": "이란격석",
    "hanja": "以卵擊石",
    "meaning": "계란으로 바위치기. 즉, 약한 것으로 강한 것을 당해 내려는 어리석음을 비유"
  },
  {
    "id": "idiom-7fbc084cebb7",
    "word": "이란투석",
    "hanja": "以卵投石",
    "meaning": "계란으로 바위를 친다"
  },
  {
    "id": "idiom-fff98818175e",
    "word": "이만융적",
    "hanja": "夷蠻戎狄",
    "meaning": "동쪽․남쪽․서쪽․북쪽 오랑캐. 즉 사방의 오랑캐"
  },
  {
    "id": "idiom-9d0a62376d76",
    "word": "이목구비",
    "hanja": "耳目口鼻",
    "meaning": "귀·눈·입·코"
  },
  {
    "id": "idiom-b30c4e61c1b6",
    "word": "이목지신",
    "hanja": "移木之信",
    "meaning": "남을 속이지 아니함을 밝힘, 약속을 실행함"
  },
  {
    "id": "idiom-f28a36f85315",
    "word": "이발지신",
    "hanja": "已發之矢",
    "meaning": "이미 떠난 화살. 이미 시작한 일을 중지하기 어려운 형편에 놓인 상태"
  },
  {
    "id": "idiom-c3d3ddd9af03",
    "word": "이상동몽",
    "hanja": "異床同夢",
    "meaning": "다른 처지에서 같은 뜻을 가짐의 비유"
  },
  {
    "id": "idiom-ee372b7bea57",
    "word": "이소성대",
    "hanja": "以小成大",
    "meaning": "작은 일에서부터 시작해서 큰일을 이룸"
  },
  {
    "id": "idiom-f09aa25b58d1",
    "word": "이실직고",
    "hanja": "以實直告",
    "meaning": "참으로써 바로고함"
  },
  {
    "id": "idiom-ef3cd576a5a6",
    "word": "이심전심",
    "hanja": "以心傳心",
    "meaning": "말하지 않아도 서로 마음이 통함."
  },
  {
    "id": "idiom-89c0f3009fa7",
    "word": "이양역우",
    "hanja": "以羊易牛",
    "meaning": "양을 가지고 소와 바꿈. 작은 것을 가지고 큰 것에 대용하는 것을 뜻한다"
  },
  {
    "id": "idiom-9a65da04c8ad",
    "word": "이여반장",
    "hanja": "易如反掌",
    "meaning": "쉽기가 손바닥 뒤집는 것과 같음"
  },
  {
    "id": "idiom-cba296697539",
    "word": "이열치열",
    "hanja": "以熱治熱",
    "meaning": "열로서 열을 다스림"
  },
  {
    "id": "idiom-6810c1171335",
    "word": "이왕지사",
    "hanja": "已往之事",
    "meaning": "이미 지나간 일"
  },
  {
    "id": "idiom-5f6c1b00c5f9",
    "word": "이용후생",
    "hanja": "利用厚生",
    "meaning": "이용은 匠人이 그릇을 만들고 厚生은 옷을 입고 고기를 먹어 추위에 떨지 않고 굶주리지 않음"
  },
  {
    "id": "idiom-21346d6f2670",
    "word": "이율배반",
    "hanja": "二律背反",
    "meaning": "꼭 같은 근거를 가지고 정당하다고 주장되는 서로 모순되는 두 명제, 또는 그 관계"
  },
  {
    "id": "idiom-8017d45ee43e",
    "word": "이이제이",
    "hanja": "以夷制夷",
    "meaning": "오랑캐로 오랑캐를 제어한다는 뜻으로, 이 나라의 힘을 빌리어 저 나라를 침"
  },
  {
    "id": "idiom-a610ad6fb394",
    "word": "이인동심",
    "hanja": "二人同心",
    "meaning": "절친한 친구사이"
  },
  {
    "id": "idiom-0731af3546e6",
    "word": "이전투구",
    "hanja": "泥田鬪狗",
    "meaning": "진흙 밭의 개싸움. 치열하게 싸우지만 결국 서로에게 아무 이득이 없는 싸움"
  },
  {
    "id": "idiom-d024203fe70f",
    "word": "이지측해",
    "hanja": "以指測海",
    "meaning": "손가락을 가지고 바다의 깊이를 잰다. 양 (量)을 모르는 어리석음을 가리키는 말이다"
  },
  {
    "id": "idiom-dbdd984b0e8f",
    "word": "이판사판",
    "hanja": "理判事判",
    "meaning": "뾰족한 방법이 없어 막다른 상황에 이름"
  },
  {
    "id": "idiom-616439541e72",
    "word": "이포역포",
    "hanja": "以暴易暴",
    "meaning": "폭력으로 폭력을 다스린다는 말로, 정치를 함에 있어 덕 (德)으로 하지 않고 힘 (力)으로 다스림"
  },
  {
    "id": "idiom-a937f8d3d687",
    "word": "이해득실",
    "hanja": "利害得失",
    "meaning": "이익과 손해, 얻음과 잃음"
  },
  {
    "id": "idiom-0824db861408",
    "word": "익불사숙",
    "hanja": "弋不射宿",
    "meaning": "주살로 자는 새를 잡지 않는다는 뜻으로 仁者의 자비심을 이름"
  },
  {
    "id": "idiom-f2111d9de118",
    "word": "익자삼요",
    "hanja": "益者三樂",
    "meaning": "禮樂을 적당히 좋아하고, 남의 착함을 좋아하고, 착한 벗이 많음을 좋아하는 것"
  },
  {
    "id": "idiom-abcca63e098e",
    "word": "익자삼우",
    "hanja": "益者三友",
    "meaning": "사귀어 보탬이 되는 세 벗으로 정직한 사람, 신의 있는 사람, 학식 있는 사람 등을 말함"
  },
  {
    "id": "idiom-9581d05658d8",
    "word": "익하함구",
    "hanja": "匿瑕含垢",
    "meaning": "임금의 도량이 넓고 커서 널리 용서하고 수치를 참는 일"
  },
  {
    "id": "idiom-d25ccc6db07f",
    "word": "인거피도",
    "hanja": "引車避道",
    "meaning": "길가는 도중에서 귀인을 만났을 때 공경하여 길을 피해줌"
  },
  {
    "id": "idiom-de10db2f723b",
    "word": "인걸지령",
    "hanja": "人傑地靈",
    "meaning": "걸출한 인재를 낳아 그 땅이 좋다는 뜻"
  },
  {
    "id": "idiom-4233f5ddc555",
    "word": "인과응보",
    "hanja": "因果應報",
    "meaning": "선한 행동에는 선한 결과가, 악한 행동에는 악한 결과가 나타난다고 하는 것"
  },
  {
    "id": "idiom-0d1775624968",
    "word": "인구회자",
    "hanja": "人口膾炙",
    "meaning": "사람들의 입맛에 맞는 회와 구운 고기라는 뜻 많은 사람들 입에 자주 오르내림을 이르는 말"
  },
  {
    "id": "idiom-6b58733cd554",
    "word": "인금구망",
    "hanja": "人琴俱亡",
    "meaning": "가까운 이들의 죽음에 대한 哀悼의 情을 비유한 말"
  },
  {
    "id": "idiom-c9e4f9ec22d4",
    "word": "인류호우",
    "hanja": "引類呼友",
    "meaning": "뜻이 같은 사람을 불러 모으는 것"
  },
  {
    "id": "idiom-bb948fafcf68",
    "word": "인만거백",
    "hanja": "引滿擧白",
    "meaning": "넘쳐흐르는 술잔을 들어 마셔 버리는 것. 백은 술잔임"
  },
  {
    "id": "idiom-37e0551fb4af",
    "word": "인면수심",
    "hanja": "人面獸心",
    "meaning": "얼굴은 사람이나 마음은 짐승과 다름없는 사람"
  },
  {
    "id": "idiom-0a00b520d91d",
    "word": "인명재천",
    "hanja": "人命在天",
    "meaning": "사람의 목숨은 하늘에 달렸다"
  },
  {
    "id": "idiom-b5dd65c9cc5a",
    "word": "인사불성",
    "hanja": "人事不省",
    "meaning": "정신을 잃고 의식을 모름"
  },
  {
    "id": "idiom-4ded1e6e244a",
    "word": "인사유명",
    "hanja": "人死留名",
    "meaning": "사람은 죽어서 이름을 남긴다"
  },
  {
    "id": "idiom-4cf97a10c450",
    "word": "인산인해",
    "hanja": "人山人海",
    "meaning": "많은 사람이 한 군데로 모여서 사람으로 산과 바다를 이룸. 人波"
  },
  {
    "id": "idiom-1a23ef65fe38",
    "word": "인생무상",
    "hanja": "人生無常",
    "meaning": "인생이 덧없음을 이르는 말"
  },
  {
    "id": "idiom-6283f8b70598",
    "word": "인생재근",
    "hanja": "人生在勤",
    "meaning": "사람의 근본은 부지런함에 있다는 말"
  },
  {
    "id": "idiom-1287ecffef6c",
    "word": "인생조로",
    "hanja": "人生朝露",
    "meaning": "인생은 아침이슬과 같이 덧없음"
  },
  {
    "id": "idiom-ff9ae0e7f209",
    "word": "인순고식",
    "hanja": "因徇姑息",
    "meaning": "사람은 습관이나 폐단에서 벗어나지 못하고 눈앞의 편안함만을 취하다"
  },
  {
    "id": "idiom-15569498a5e5",
    "word": "인승비근",
    "hanja": "引繩批根",
    "meaning": "자기의 반대자에게 앙갚음을 하는 것을 이름"
  },
  {
    "id": "idiom-3b5212db67c2",
    "word": "인심여면",
    "hanja": "人心如面",
    "meaning": "사람의 얼굴이 각각 다름과 같이 마음도 또한 각기 다르다는 말"
  },
  {
    "id": "idiom-d7d7e4a4dd4d",
    "word": "인유실의",
    "hanja": "引喩失義",
    "meaning": "비유를 잘못하여 뜻이 어긋나는 것"
  },
  {
    "id": "idiom-e45064c61ca6",
    "word": "인의예지",
    "hanja": "仁義禮智",
    "meaning": "중국 戰國時代의 사상가 孟子가 주창한 인간 도덕성에 관한 설"
  },
  {
    "id": "idiom-c68bff809dc4",
    "word": "인이불발",
    "hanja": "引而不發",
    "meaning": "가르침에 있어 공부하는 법만을 가르치고 그 묘처를 말하지 않아 학습자가 궁리하여 자득케 함"
  },
  {
    "id": "idiom-1d81274a5a60",
    "word": "인인성사",
    "hanja": "因人成事",
    "meaning": "남의 힘으로 일을 이룸"
  },
  {
    "id": "idiom-b222b73ef859",
    "word": "인자무적",
    "hanja": "仁者無敵",
    "meaning": "어진 사람에게는 적이 없음"
  },
  {
    "id": "idiom-ec65829d1e82",
    "word": "인자불우",
    "hanja": "仁者不憂",
    "meaning": "어진 사람은 道理에 따라 행하고 양심에 거리낌이 없으므로 근심을 하지 않음"
  },
  {
    "id": "idiom-d60726856309",
    "word": "인자요산",
    "hanja": "仁者樂山",
    "meaning": "인자는 의리에 만족하며 생각이 깊고 행동이 신중함이 산과 같으므로 자연히 산을 좋아함"
  },
  {
    "id": "idiom-d56d224a3e1e",
    "word": "인중기기",
    "hanja": "人中驥驥",
    "meaning": "뛰어나게 잘난 사람을 이름"
  },
  {
    "id": "idiom-c6a72ebe6649",
    "word": "인중사자",
    "hanja": "人中獅子",
    "meaning": "다른 사람들보다 뛰어나게 잘난 사람을 이름"
  },
  {
    "id": "idiom-b8676a71023e",
    "word": "인지상정",
    "hanja": "人之常情",
    "meaning": "사람이 누구나 가지는 보통의 인정"
  },
  {
    "id": "idiom-53d8e10897c6",
    "word": "인지위덕",
    "hanja": "忍之爲德",
    "meaning": "참는 것이 덕이 됨"
  },
  {
    "id": "idiom-8b3d011d64a9",
    "word": "인추자자",
    "hanja": "引錐自刺",
    "meaning": "공부하다가 잠이 오면 송곳으로 자기 몸을 찔러 잠을 깨게 하는 것"
  },
  {
    "id": "idiom-bd581b981706",
    "word": "인친위보",
    "hanja": "人親爲寶",
    "meaning": "부모를 위함을 재보로 여김"
  },
  {
    "id": "idiom-81986e29f0ab",
    "word": "일각천금",
    "hanja": "一刻千金",
    "meaning": "일각이 천금이다 는 뜻. 즉, 극히 짧은 시각도 귀하고 소중하기가 천금과 같음을 일컬음"
  },
  {
    "id": "idiom-ddd072bcc140",
    "word": "일거양득",
    "hanja": "一擧兩得",
    "meaning": "한 가지 일을 해서 두 가지 이익을 얻음."
  },
  {
    "id": "idiom-1ac62cadeffa",
    "word": "일고작기",
    "hanja": "一鼓作氣",
    "meaning": "단숨에 해치우다 처음의 기세로 끝장을 내다"
  },
  {
    "id": "idiom-20bbcec829fd",
    "word": "일구월심",
    "hanja": "日久月心",
    "meaning": "날이 오래고 달이 깊어 간다. 날이 갈수록 바라는 마음이 더 간절하다"
  },
  {
    "id": "idiom-989019a5480b",
    "word": "일구지학",
    "hanja": "一丘之狢",
    "meaning": "같은 부류여서 차이가 없는 것 같은 산언덕에서 자란 담비와 같이 모습이 모두 똑같다고 비유"
  },
  {
    "id": "idiom-ce4b3bf01c87",
    "word": "일국삼공",
    "hanja": "一國三公",
    "meaning": "많은 사람들이 저마다 구구한 의견을 제시함"
  },
  {
    "id": "idiom-461d75459550",
    "word": "일궤십기",
    "hanja": "一饋十起",
    "meaning": "한 끼 식사에 열 번 일어서기 즉 위정자가 백성들을 위하여 수고로움을 아끼지 않음"
  },
  {
    "id": "idiom-e382ee2eee56",
    "word": "일기당천",
    "hanja": "一騎當千",
    "meaning": "한명의 군사가 천을 당해냄, 한 사람이 천 사람을 당해낼 정도로 무예가 아주 뛰어남을 비유"
  },
  {
    "id": "idiom-b5ace1efcce2",
    "word": "일년지계",
    "hanja": "一年之計",
    "meaning": "한 해 동안의 계획"
  },
  {
    "id": "idiom-77c379d96ee4",
    "word": "일도양단",
    "hanja": "一刀兩斷",
    "meaning": "한칼로 쳐서 둘에 냄. 머뭇거리지 않고 일이나 행동을 선뜻 결정함의 비유"
  },
  {
    "id": "idiom-a6f02008d4bd",
    "word": "일룡일사",
    "hanja": "一龍一蛇",
    "meaning": "어느 때는 용이 되어 하늘로 올라가고 어느 때는 뱀이 되어 못에 숨는다"
  },
  {
    "id": "idiom-c08aca9882c5",
    "word": "일망무제",
    "hanja": "一望無際",
    "meaning": "아득하게 멀고 넓어서 끝이 없음"
  },
  {
    "id": "idiom-980739f59f51",
    "word": "일망타진",
    "hanja": "一網打盡",
    "meaning": "한번 그물을 쳐서 다 잡아들임"
  },
  {
    "id": "idiom-02d0a701af7d",
    "word": "일맥상통",
    "hanja": "一脈相通",
    "meaning": "생각·성질·처지 등이 어느 면에서 한 가지로 서로 통함"
  },
  {
    "id": "idiom-5c5470adc5d2",
    "word": "일면여구",
    "hanja": "一面如舊",
    "meaning": "단 한 번 만나 사귀어 옛 친구처럼 친해짐"
  },
  {
    "id": "idiom-d85234fc889d",
    "word": "일명경인",
    "hanja": "一鳴驚人",
    "meaning": "평소에 묵묵히 있던 사람이 갑자기 사람을 놀라게 할 만한 일을 해내는 것을 말함"
  },
  {
    "id": "idiom-ae319b794488",
    "word": "일모도궁",
    "hanja": "日暮途窮",
    "meaning": "날은 저물고 갈 길은 막힘. 앞으로 살아갈 날이 얼마 남지 않았음"
  },
  {
    "id": "idiom-632db8a2ddea",
    "word": "일모도원",
    "hanja": "日暮途遠",
    "meaning": "해는 저물고 갈 길은 멀다. 몸은 쇠약한데 뜻은 커 앞으로 할 일이 까마득하게 많다"
  },
  {
    "id": "idiom-ce92e9b69d07",
    "word": "일목난지",
    "hanja": "一木難支",
    "meaning": "큰 집이 무너지는 것을 나무 기둥 하나로 떠받치지 못하듯 손을 쓸 수 없음"
  },
  {
    "id": "idiom-f4989b119216",
    "word": "일목요연",
    "hanja": "一目瞭然",
    "meaning": "첫눈에도 똑똑하게 알 수 있음"
  },
  {
    "id": "idiom-0e2a63c04cf7",
    "word": "일문일답",
    "hanja": "一問一答",
    "meaning": "한 가지 물음에 한 가지 대답을 함"
  },
  {
    "id": "idiom-c9cead8fdcf4",
    "word": "일반천금",
    "hanja": "一飯千金",
    "meaning": "한 그릇의 밥이 천금의 가치가 있음을 말함"
  },
  {
    "id": "idiom-f051f88901ab",
    "word": "일벌백계",
    "hanja": "一罰百戒",
    "meaning": "한사람의 악인을 처벌함으로써 다른 백 사람이 죄를 범하지 않도록 경계하는 것"
  },
  {
    "id": "idiom-1a94db7a94fe",
    "word": "일보불양",
    "hanja": "一步不讓",
    "meaning": "남에게 한 걸음도 양보하지 않음"
  },
  {
    "id": "idiom-abbefd45363a",
    "word": "일부일처",
    "hanja": "一夫一妻",
    "meaning": "한 남편에 한 아내만 있음"
  },
  {
    "id": "idiom-35d24b3f6e06",
    "word": "일사불란",
    "hanja": "一絲不亂",
    "meaning": "질서 정연하여 조금도 흔들림이 없음"
  },
  {
    "id": "idiom-eb4784747efc",
    "word": "일사천리",
    "hanja": "一瀉千里",
    "meaning": "조금도 거침없이 빨리 진행됨"
  },
  {
    "id": "idiom-a77b021b0635",
    "word": "일석이조",
    "hanja": "一石二鳥",
    "meaning": "한 번의 행동으로 두 가지 성과를 얻음."
  },
  {
    "id": "idiom-8af448e50665",
    "word": "일수백확",
    "hanja": "一樹百穫",
    "meaning": "나무 한 그루를 심어서 백 개의 열매를 수확한다. 인물을 양성하는 보람을 말함"
  },
  {
    "id": "idiom-091cf3aff5cc",
    "word": "일시동인",
    "hanja": "一視同仁",
    "meaning": "모두를 평등하게 보아 똑같이 사랑함"
  },
  {
    "id": "idiom-246d416a360c",
    "word": "일신시담",
    "hanja": "一身是膽",
    "meaning": "온몸이 쓸개라는 뜻. 당양, 사두진, 봉명산 등에서 용맹을 떨친 조운의 대담함을 일컫는 말"
  },
  {
    "id": "idiom-0d507d1ff29c",
    "word": "일심동체",
    "hanja": "一心同體",
    "meaning": "한 마음 한 몸. 곧 굳은 결속"
  },
  {
    "id": "idiom-f633c923a85f",
    "word": "일어탁수",
    "hanja": "一魚濁水",
    "meaning": "한 마리의 고기가 물을 흐린다. 한사람의 잘못이 여러 사람에게 해가됨 (=一魚混全川)"
  },
  {
    "id": "idiom-c2a10acb0cc8",
    "word": "일언반구",
    "hanja": "一言半句",
    "meaning": "극히 짧은 말"
  },
  {
    "id": "idiom-c0db6a2b0889",
    "word": "일언반사",
    "hanja": "一言半辭",
    "meaning": "한 마디나 반 마디의 말"
  },
  {
    "id": "idiom-6bc31012b912",
    "word": "일언지하",
    "hanja": "一言之下",
    "meaning": "말 한마디로 끊음. 한마디로 딱 잘라 말함"
  },
  {
    "id": "idiom-1646b6dd8ad9",
    "word": "일엽지추",
    "hanja": "一葉知秋",
    "meaning": "사물의 일단을 앎으로써 대세를 미루어 안다는 말 (=一葉落天下知秋)"
  },
  {
    "id": "idiom-ca42078fe832",
    "word": "일엽편주",
    "hanja": "一葉片舟",
    "meaning": "한 조각 작은 배"
  },
  {
    "id": "idiom-5ad17fafa140",
    "word": "일의대수",
    "hanja": "一衣帶水",
    "meaning": "간격이 매우 좁음"
  },
  {
    "id": "idiom-0fdbab117b0a",
    "word": "일이관지",
    "hanja": "一以貫之",
    "meaning": "하나로써 그것을 꿰뚫었다. 처음부터 끝까지 변하지 않다. 또는 막힘없이 끝까지 밀고 나간다"
  },
  {
    "id": "idiom-3f02280a9853",
    "word": "일인일기",
    "hanja": "一人一技",
    "meaning": "한 사람이 한 가지의 전문적인 기술을 가지는 일"
  },
  {
    "id": "idiom-640b0dd3aabe",
    "word": "일일삼추",
    "hanja": "一日三秋",
    "meaning": "하루가 세 번의 가을과 같다는 뜻으로, 마음이 몹시 지루하거나 기다림을 일컬음. (=一日如三秋)"
  },
  {
    "id": "idiom-b5bf2dd926f1",
    "word": "일자무식",
    "hanja": "一字無識",
    "meaning": "글자 한자도 알지 못함"
  },
  {
    "id": "idiom-ea3438a69f3e",
    "word": "일자천금",
    "hanja": "一字千金",
    "meaning": "아주 빼어난 글이나 시문"
  },
  {
    "id": "idiom-89a973e12a8e",
    "word": "일장일단",
    "hanja": "一長一短",
    "meaning": "장점이 있으면 단점도 있다고 하는 것"
  },
  {
    "id": "idiom-47b89599f68b",
    "word": "일장일이",
    "hanja": "一張一弛",
    "meaning": "사람이나 물건을 적당히 부리고 적당히 쉬게 함"
  },
  {
    "id": "idiom-e0ec2769983a",
    "word": "일장춘몽",
    "hanja": "一場春夢",
    "meaning": "한바탕 허무한 봄 꿈"
  },
  {
    "id": "idiom-f1e5d0670aac",
    "word": "일전불사",
    "hanja": "一戰不辭",
    "meaning": "한바탕 싸움을 사양하지 않겠다는 뜻으로 싸움에 대한 강한 의지를 나타냄"
  },
  {
    "id": "idiom-cb130b4e689f",
    "word": "일전불치",
    "hanja": "一錢不値",
    "meaning": "자기편에는 오만하고 무례하며 외부사람에게는 비굴하게 아첨하는 사람"
  },
  {
    "id": "idiom-afdc4f573773",
    "word": "일전쌍조",
    "hanja": "一箭雙雕",
    "meaning": "한 대의 화살로 두 마리의 새를 맞춘다는 말 (=一石二鳥)"
  },
  {
    "id": "idiom-45bd5e1b6354",
    "word": "일조일석",
    "hanja": "一朝一夕",
    "meaning": "하루아침, 하루 저녁이라는 말로, 얼마 안 되는 짧은 시간을 일컬음"
  },
  {
    "id": "idiom-7dda5f9b7b15",
    "word": "일진일퇴",
    "hanja": "一進一退",
    "meaning": "조금 나아가는가 하면 다시 물러난다. 나아갔다, 물러났다 하는 것"
  },
  {
    "id": "idiom-09ceabac6655",
    "word": "일촉즉발",
    "hanja": "一觸卽發",
    "meaning": "조금만 닿아도 곧 폭발할 것 같은 모양. 막 일이 일어날 듯하여 위험한 지경"
  },
  {
    "id": "idiom-e1324a165c9d",
    "word": "일촌광음",
    "hanja": "一寸光陰",
    "meaning": "아주 짧은 시간"
  },
  {
    "id": "idiom-0c155afc6b21",
    "word": "일취월장",
    "hanja": "日就月將",
    "meaning": "날로 발전하여 나아감"
  },
  {
    "id": "idiom-8f03f121cde5",
    "word": "일취지몽",
    "hanja": "一炊之夢",
    "meaning": "덧없는 부귀영화. 인생의 허무함을 비유하는 말"
  },
  {
    "id": "idiom-b697f47f697d",
    "word": "일파만파",
    "hanja": "一波萬波",
    "meaning": "한 사건이 그 사건에 그치지 않고 잇달아 많은 사건으로 번짐"
  },
  {
    "id": "idiom-b4ec5db73e32",
    "word": "일패도지",
    "hanja": "一敗塗地",
    "meaning": "여지없이 패배하여 다시 일어날 수가 없음"
  },
  {
    "id": "idiom-ee50bace40c6",
    "word": "일편단심",
    "hanja": "一片丹心",
    "meaning": "오로지 한곳으로 향한, 한 조각의 붉은 마음"
  },
  {
    "id": "idiom-dadfe94526cc",
    "word": "일폭십한",
    "hanja": "一暴十寒",
    "meaning": "일을 함에 있어서 꾸준한 마음이 없이 하다 말다하는 일관성 없는 태도와 행위를 비유"
  },
  {
    "id": "idiom-217586cc58ef",
    "word": "일필휘지",
    "hanja": "一筆揮之",
    "meaning": "한숨에 글씨나 그림을 죽 쓰거나 그림"
  },
  {
    "id": "idiom-29bdc1f450bd",
    "word": "일호지액",
    "hanja": "一狐之腋",
    "meaning": "한 마리의 여우 겨드랑이 밑에서 뜯어낸 희고 고운 모피라는 뜻으로 진귀한 물건을 비유한 말"
  },
  {
    "id": "idiom-37ebbd95e1f1",
    "word": "일확천금",
    "hanja": "一攫千金",
    "meaning": "힘 안 들이고 한꺼번에 많은 재물을 얻음"
  },
  {
    "id": "idiom-0378360a61f1",
    "word": "일훈일유",
    "hanja": "一薰一蕕",
    "meaning": "좋은 향기와 나쁜 냄새. (선한 것은 없어지기 쉬우나 악한 것은 떨쳐버리기 어렵다)"
  },
  {
    "id": "idiom-19cebda6437a",
    "word": "일희일비",
    "hanja": "一喜一悲",
    "meaning": "기쁜 일과 슬픈 일이 번갈아 일어남"
  },
  {
    "id": "idiom-55891df1774a",
    "word": "임갈굴정",
    "hanja": "臨渴掘井",
    "meaning": "목이 말라서야 우물을 팜. 준비 없이 일을 당하여 허둥지둥하고 애씀"
  },
  {
    "id": "idiom-5b46fef514f2",
    "word": "임기응변",
    "hanja": "臨機應變",
    "meaning": "그때그때의 일의 형편에 따라서 변통성 있게 처리함"
  },
  {
    "id": "idiom-a3279ecc5612",
    "word": "임난주병",
    "hanja": "臨難鑄兵",
    "meaning": "난리가 난 뒤에 무기를 만든다. 이미 때가 늦었음"
  },
  {
    "id": "idiom-0ea0000935aa",
    "word": "임농탈경",
    "hanja": "臨農奪耕",
    "meaning": "땅을 다 다듬고 이제 농사를 지으려 하니까 농사지을 땅을 빼앗아 간다. 오랫동안 애써 준비한 일을 못하게 빼앗는다는 말이다"
  },
  {
    "id": "idiom-902aa2af19f3",
    "word": "임시방편",
    "hanja": "臨時方便",
    "meaning": "필요에 따라 그 때 그 때 정해 일을 쉽고 편리하게 치를 수 있는 수단"
  },
  {
    "id": "idiom-ab21bb4d39d5",
    "word": "임전무퇴",
    "hanja": "臨戰無退",
    "meaning": "싸움에 임하여 물러섬이 없음"
  },
  {
    "id": "idiom-1dfe8b018c80",
    "word": "임진역장",
    "hanja": "臨陣易將",
    "meaning": "실제로 일할 때가 되어 익숙한 사람을 버리고 서투른 사람으로 바꿔 씀을 비유하여 이르는 말"
  },
  {
    "id": "idiom-7d8794a673f4",
    "word": "입신양명",
    "hanja": "立身揚名",
    "meaning": "사회적으로 인정을 받고 출세하여 이름을 세상에 드날리다"
  },
  {
    "id": "idiom-147fab33b034",
    "word": "입이저심",
    "hanja": "入耳著心",
    "meaning": "귀로 들어온 것을 마음속에 붙인다. 들은 것을 마음속에 간직하여 잊지 않는다"
  },
  {
    "id": "idiom-71068a093cda",
    "word": "입이출구",
    "hanja": "入耳出口",
    "meaning": "귀로 듣고 입으로 금방 말함. 말을 금방 옮긴다는 뜻"
  },
  {
    "id": "idiom-07bf293b66ff",
    "word": "입추지지",
    "hanja": "立錐之地",
    "meaning": "송곳 하나 세울 만한 땅. 매우 좁아서 조금도 여유가 없다"
  },
  {
    "id": "idiom-87967128a5f7",
    "word": "자가당착",
    "hanja": "自家撞着",
    "meaning": "자신의 말이나 행동이 앞뒤로 서로 맞지 않음."
  },
  {
    "id": "idiom-52f661d03dd0",
    "word": "자강불식",
    "hanja": "自强不息",
    "meaning": "스스로 힘쓰고 쉬지 아니함"
  },
  {
    "id": "idiom-41de1f26a024",
    "word": "자격지심",
    "hanja": "自激之心",
    "meaning": "제가 한 일에 대하여 스스로 미흡한 생각을 가짐"
  },
  {
    "id": "idiom-eacb5c4c64be",
    "word": "자고이래",
    "hanja": "自古以來",
    "meaning": "예로부터 지금까지"
  },
  {
    "id": "idiom-70330d241ad2",
    "word": "자괴지심",
    "hanja": "自愧之心",
    "meaning": "스스로 부끄럽게 여기는 마음"
  },
  {
    "id": "idiom-97cd7fd2289d",
    "word": "자급자족",
    "hanja": "自給自足",
    "meaning": "자기의 수요를 자기가 생산하여 충당함"
  },
  {
    "id": "idiom-b206dd68499e",
    "word": "자두연기",
    "hanja": "煮豆燃萁",
    "meaning": "콩을 볶는 데 콩깍지를 태운다. 형제끼리 서로 미워하고 들볶는 것. (=煮豆燃豆萁)"
  },
  {
    "id": "idiom-5997bb455cfa",
    "word": "자로부미",
    "hanja": "子路負米",
    "meaning": "가난하게 살면서도 효성이 지극하여 갖은 고생을 하며 부모의 봉양을 잘함. (=百里負米)"
  },
  {
    "id": "idiom-6a0caff0e3f8",
    "word": "자린고비",
    "hanja": "玼吝考妣",
    "meaning": "아니꼬울 정도로 인색하고 비정한 사람을 꼬집어 이르는 말"
  },
  {
    "id": "idiom-71c8d0da1e83",
    "word": "자막집중",
    "hanja": "子莫執中",
    "meaning": "융통성이 없고 임기응변 할 줄 모르는 사람을 일컫는 말이다"
  },
  {
    "id": "idiom-de197ad0da35",
    "word": "자모패자",
    "hanja": "慈母敗子",
    "meaning": "慈母에 敗子 있다고 한다. 과보호는 아이들을 잘못되게 만든다는 것"
  },
  {
    "id": "idiom-37ac7704c558",
    "word": "자문자답",
    "hanja": "自問自答",
    "meaning": "제가 묻고 제가 대답함"
  },
  {
    "id": "idiom-5eb36098cbdd",
    "word": "자부작족",
    "hanja": "自斧斫足",
    "meaning": "제 도끼에 제 발을 찍듯 자기 일을 자기가 망친다"
  },
  {
    "id": "idiom-e7dfc2d5229c",
    "word": "자성제인",
    "hanja": "子誠齊人",
    "meaning": "견문이 아주 좁아 하나밖에 모르고 고루한 사람"
  },
  {
    "id": "idiom-11159aec2aed",
    "word": "자수삭발",
    "hanja": "自手削髮",
    "meaning": "제 손으로 머리를 깎음. 하기 어려운 일을 남의 힘을 빌지 않고 제 힘으로 처리한다는 뜻이다"
  },
  {
    "id": "idiom-e5c7f6034a52",
    "word": "자수성가",
    "hanja": "自手成家",
    "meaning": "물려받은 재산이 없는 사람이 자신의 힘으로 한 살림을 이룩함"
  },
  {
    "id": "idiom-0f6ddf0a49bf",
    "word": "자승자박",
    "hanja": "自繩自縛",
    "meaning": "자신이 한 말이나 행동 때문에 스스로 곤란해짐."
  },
  {
    "id": "idiom-0fbdece2efb7",
    "word": "자아도취",
    "hanja": "自我陶醉",
    "meaning": "자기가 어떤 것에 끄려 취하다시피 함"
  },
  {
    "id": "idiom-483aa0e184c3",
    "word": "자아성찰",
    "hanja": "自我省察",
    "meaning": "자기의 마음을 반성하여 살핌"
  },
  {
    "id": "idiom-5b88936a5f04",
    "word": "자업자득",
    "hanja": "自業自得",
    "meaning": "자기가 저지른 일의 과보를 자기 자신이 받는 일. 나쁜 결과를 받는 경우에 사용된다"
  },
  {
    "id": "idiom-6c908bec344a",
    "word": "자연도태",
    "hanja": "自然淘汰",
    "meaning": "자연적으로 환경에 맞는 것은 있게 되고 그렇지 못한 것은 없어짐"
  },
  {
    "id": "idiom-8b0d9e45e87e",
    "word": "자작지얼",
    "hanja": "自作之孼",
    "meaning": "자기가 저지른 일로 인해 생기게 된 재앙. 자승자박 (自繩自縛)"
  },
  {
    "id": "idiom-88b386fcdd75",
    "word": "자중지란",
    "hanja": "自中之亂",
    "meaning": "같은 패 안에서 일어나는 싸움"
  },
  {
    "id": "idiom-a3ea94dca4d5",
    "word": "자초지종",
    "hanja": "自初至終",
    "meaning": "처음부터 끝까지의 동안이나 일"
  },
  {
    "id": "idiom-d4e8ea16e941",
    "word": "자포자기",
    "hanja": "自暴自棄",
    "meaning": "스스로 자신을 학대하고 돌보지 아니함"
  },
  {
    "id": "idiom-50e965af72b3",
    "word": "자행자지",
    "hanja": "自行自止",
    "meaning": "자기 마음대로 하고 싶으면 하고 하기 싫으면 하지 않음"
  },
  {
    "id": "idiom-f2966ce81086",
    "word": "자화자찬",
    "hanja": "自畵自讚",
    "meaning": "자기가 그린그림을 칭찬한다는 말로 자기의 행위를 칭찬함"
  },
  {
    "id": "idiom-f715aa3a0a44",
    "word": "작법자폐",
    "hanja": "作法自斃",
    "meaning": "자기가 만든 법에 자기가 죽다"
  },
  {
    "id": "idiom-628861b29028",
    "word": "작사도방",
    "hanja": "作舍道傍",
    "meaning": "길 곁에서 집짓기란 의미로, 길에 많은 사람들의 이견 때문에 집 짓는 일에 진척이 없는 모습"
  },
  {
    "id": "idiom-a25125e2ac58",
    "word": "작수성례",
    "hanja": "酌水成禮",
    "meaning": "물을 떠 놓고 혼례를 행한다. 형세가 가난하여 혼례를 간략하게 지냄"
  },
  {
    "id": "idiom-cca07fe58b8e",
    "word": "작심삼일",
    "hanja": "作心三日",
    "meaning": "한번 결심한 것이 사흘을 가지 않음. 곧 결심이 굳지 못함"
  },
  {
    "id": "idiom-daf5692b5dd5",
    "word": "작약지증",
    "hanja": "勺藥之贈",
    "meaning": "남녀간에 향기로운 함박꽃을 보내어 정을 더욱 두텁게 하는 것을 말한다"
  },
  {
    "id": "idiom-dc6056e18711",
    "word": "장경오훼",
    "hanja": "長勁烏喙",
    "meaning": "越王 句踐을 평한 말로, 患難은 같이 할 수 있으나 안락은 같이 누릴 수 없는 人相을 이름"
  },
  {
    "id": "idiom-e2cdecc7bfb0",
    "word": "장맥분흥",
    "hanja": "張脈憤興",
    "meaning": "사람이 격분하거나 흥분하면 혈맥의 움직임은 강한 모습을 띄게 되지만, 그 속은 마르게 됨"
  },
  {
    "id": "idiom-c7a7bd822c87",
    "word": "장삼이사",
    "hanja": "張三李四",
    "meaning": "장씨의 셋째 아들과 이씨의 넷째 아들이란 뜻 이름 없는 사람들이나 평범한 사람들의 비유"
  },
  {
    "id": "idiom-b890b9aab7e8",
    "word": "장생불사",
    "hanja": "長生不死",
    "meaning": "오랫동안 살아 죽지 아니함"
  },
  {
    "id": "idiom-87688217f6e5",
    "word": "장수선무",
    "hanja": "長袖善舞",
    "meaning": "긴 소매는 춤을 잘 춘다. 어떤 일을 함에 있어서도 조건이 좋은 사람이 유리하다"
  },
  {
    "id": "idiom-4fc00f16fb5c",
    "word": "장야지음",
    "hanja": "長夜之飮",
    "meaning": "날이 새어도 창을 가리고 불을 켜 논 채 계속하는 주연 (酒宴)을 말한다"
  },
  {
    "id": "idiom-183ed6a397b5",
    "word": "장유유서",
    "hanja": "長幼有序",
    "meaning": "어른과 아이는 차례가 있음"
  },
  {
    "id": "idiom-45a18030df79",
    "word": "장장하일",
    "hanja": "長長夏日",
    "meaning": "기나긴 여름 날"
  },
  {
    "id": "idiom-0c00d2c07a40",
    "word": "장주지몽",
    "hanja": "莊周之夢",
    "meaning": "장주라는 사람이 꿈에 나비가 되었는데, 실제 자신이 누구인지 알지 못했다는 고사"
  },
  {
    "id": "idiom-a2fbd41662e6",
    "word": "장중보옥",
    "hanja": "掌中寶玉",
    "meaning": "손에 쥔 옥. 사랑하는 자식이나 매우 귀중한 물건"
  },
  {
    "id": "idiom-8522b5a3f0b2",
    "word": "재대난용",
    "hanja": "材大難用",
    "meaning": "재목이 너무 크면 쓰이기 곤란하다. 즉, 재주 있는 사람이 쓰이지 못함을 비유하는 말"
  },
  {
    "id": "idiom-8ce1e87351ed",
    "word": "재상팔덕",
    "hanja": "宰相八德",
    "meaning": "재상이 지녀야할 충 (忠), 직 (直), 명 (明), 변 (辯), 서 (恕), 용 (容), 관 (寬), 후 (厚)의 여덟 가지 덕"
  },
  {
    "id": "idiom-5a5ec5516e98",
    "word": "재승박덕",
    "hanja": "才勝薄德",
    "meaning": "재주는 있으나 덕이 없음"
  },
  {
    "id": "idiom-18c03f4a2168",
    "word": "재자가인",
    "hanja": "才子佳人",
    "meaning": "재주가 있는 남자와 아름다운 여자"
  },
  {
    "id": "idiom-2f83fa076e62",
    "word": "쟁어자유",
    "hanja": "爭魚者濡",
    "meaning": "고기를 잡으려는 사람은 물에 젖는다. 이익을 얻으려고 다투는 사람은 언제나 고생을 면치 못한다"
  },
  {
    "id": "idiom-eed50e3506a5",
    "word": "저수하심",
    "hanja": "低首下心",
    "meaning": "머리를 낮게 하고 마음을 아래로 향하게 한다는 뜻으로, 남에게 머리 숙여 복종하는 것을 비유한다"
  },
  {
    "id": "idiom-c46345d93723",
    "word": "적구지병",
    "hanja": "適口之餠",
    "meaning": "입에 맞는 떡"
  },
  {
    "id": "idiom-bbd9195716d9",
    "word": "적반하장",
    "hanja": "賊反荷杖",
    "meaning": "잘못한 자가 도리어 뻣뻣하게 나오는 것"
  },
  {
    "id": "idiom-e5f3c7c087ac",
    "word": "적빈여세",
    "hanja": "赤貧如洗",
    "meaning": "가난하기가 마치 물로 씻은 듯하여 아무 것도 없음"
  },
  {
    "id": "idiom-71e3cd598770",
    "word": "적선여경",
    "hanja": "積善餘慶",
    "meaning": "착한 일을 많이 하면 후대에 좋은 일이 생긴다"
  },
  {
    "id": "idiom-ef4591d9ac4a",
    "word": "적소성대",
    "hanja": "積小成大",
    "meaning": "작은 것이 모여서 큰 것이 됨"
  },
  {
    "id": "idiom-b4d15f13ad70",
    "word": "적수공권",
    "hanja": "赤手空拳",
    "meaning": "맨손과 맨주먹, 즉 아무 것도 가진 것이 없다는 뜻"
  },
  {
    "id": "idiom-0a0ed28a7f5c",
    "word": "적악여앙",
    "hanja": "積惡餘殃",
    "meaning": "악한 일을 많이 하면 후대에 나쁜 일이 생긴다"
  },
  {
    "id": "idiom-49e4354353bc",
    "word": "적우침주",
    "hanja": "積羽沈舟",
    "meaning": "가벼운 새의 깃털도 많이 쌓이면 그 무게로 배를 가라앉게 함. 곧 작은 힘도 합하면 큰 힘이 된다"
  },
  {
    "id": "idiom-c3fda371a745",
    "word": "적자생존",
    "hanja": "適者生存",
    "meaning": "생물이 외계의 형편에 맞는 것은 살고 그렇지 못한 것은 전멸하는 현상"
  },
  {
    "id": "idiom-bc430d02a18c",
    "word": "적자지심",
    "hanja": "赤子之心",
    "meaning": "임금에게 충성을 다하는 백성의 마음. 갓난아이같이 거짓이 없는 마음"
  },
  {
    "id": "idiom-c5d707158588",
    "word": "적재적소",
    "hanja": "適材適所",
    "meaning": "알맞은 자리에 알맞은 인재를 등용함"
  },
  {
    "id": "idiom-e63f5a32a2e9",
    "word": "적진성산",
    "hanja": "積塵成山",
    "meaning": "티끌모아 태산"
  },
  {
    "id": "idiom-f6a9a0ce4385",
    "word": "적토성산",
    "hanja": "積土成山",
    "meaning": "흙이 쌓여 산을 이룸. 작은 것을 힘써 모아서 큰 것을 이룸을 뜻하는 말이다"
  },
  {
    "id": "idiom-0f25c04cf8bd",
    "word": "전가보도",
    "hanja": "傳家寶刀",
    "meaning": "조상 때부터 대대로 전해 내려오는 집안의 보물이라는 뜻 (=傳家之寶)"
  },
  {
    "id": "idiom-c14a940a6a83",
    "word": "전거가감",
    "hanja": "前車可鑑",
    "meaning": "앞 수레는 뒷 수레의 거울이 될 수 있다는 뜻이다"
  },
  {
    "id": "idiom-b8bd14bc5267",
    "word": "전거복철",
    "hanja": "前車覆轍",
    "meaning": "앞 수레가 엎어진 바퀴자국이란 뜻으로 앞의 실패를 거울로 삼으라는 의미"
  },
  {
    "id": "idiom-df502e1f4245",
    "word": "전거후공",
    "hanja": "前倨後恭",
    "meaning": "이전에는 거만하다가 나중에는 공손하다는 뜻으로, 상대편의 입지에 따라 대하는 태도 변함"
  },
  {
    "id": "idiom-937af979cac9",
    "word": "전광석화",
    "hanja": "電光石火",
    "meaning": "電光은 번개.石火는 부싯돌의 불꽃. 동작이 아주 민첩함의 비유"
  },
  {
    "id": "idiom-a6853e64bb35",
    "word": "전국칠웅",
    "hanja": "戰國七雄",
    "meaning": "춘추전국시대 (BC 5세기∼BC 3세기) 중국의 패권을 놓고 대립한 7대 강국"
  },
  {
    "id": "idiom-a5d08f827b80",
    "word": "전대미문",
    "hanja": "前代未聞",
    "meaning": "지금까지 들어본 일이 없는 새로운 일을 이르는 말"
  },
  {
    "id": "idiom-4d0ec8ec2f75",
    "word": "전도양양",
    "hanja": "前途洋洋",
    "meaning": "앞길이 바다와 같음. 장래가 매우 밝음"
  },
  {
    "id": "idiom-0e25727a08d8",
    "word": "전도요원",
    "hanja": "前道遼遠",
    "meaning": "앞으로 길길이 아득히 멀다. 목적한 바에 이르기에는 아직도 멀다"
  },
  {
    "id": "idiom-21e14b8bbfb7",
    "word": "전무후무",
    "hanja": "前無後無",
    "meaning": "전에도 앞으로도 없음"
  },
  {
    "id": "idiom-c853e31d74ab",
    "word": "전복후계",
    "hanja": "前覆後戒",
    "meaning": "앞 수레가 뒤집힌 자국은 뒷 수레의 좋은 경계가 된다. 앞의 실수를 경계로 삼아야 한다"
  },
  {
    "id": "idiom-1938034b30bb",
    "word": "전부습호",
    "hanja": "傳不習乎",
    "meaning": "曾子의 一日三省 중 한 가지. 배웠던 것에 대해 몸에 익도록 하지 않은 것이 있었던가?"
  },
  {
    "id": "idiom-6eb70c8a8e97",
    "word": "전원장무",
    "hanja": "田園將蕪",
    "meaning": "논밭과 동산이 황무지가 됨"
  },
  {
    "id": "idiom-3ac215e40923",
    "word": "전인미답",
    "hanja": "前人未踏",
    "meaning": "이제까지의 세상사람 그 누구도 가보지 못함. 이제까지의 세상 사람이 아무도 해보지 못함"
  },
  {
    "id": "idiom-dd52ec5a2432",
    "word": "전전긍긍",
    "hanja": "戰戰兢兢",
    "meaning": "매우 두려워하여 겁내는 모양"
  },
  {
    "id": "idiom-bac707292696",
    "word": "전전반측",
    "hanja": "輾轉反側",
    "meaning": "누워서 이리 뒤척 저리 뒤척 잠을 이루지 못함"
  },
  {
    "id": "idiom-1971cfe96509",
    "word": "전전불매",
    "hanja": "輾轉不寐",
    "meaning": "누워서 이리저리 뒤척이며 잠을 이루지 못함"
  },
  {
    "id": "idiom-e0cbbc178523",
    "word": "전정만리",
    "hanja": "前程萬里",
    "meaning": "나이가 젊어 장래가 유망함"
  },
  {
    "id": "idiom-9a0ba80b3316",
    "word": "전지전능",
    "hanja": "全知全能",
    "meaning": "무엇이나 다 알고 무엇이나 다 행할 수 있는 신의 능력"
  },
  {
    "id": "idiom-80df9b42d353",
    "word": "전첨후고",
    "hanja": "前瞻後顧",
    "meaning": "일을 당해 결단을 내리지 못하고 앞뒤만 재어 봄"
  },
  {
    "id": "idiom-c5f411a56bb1",
    "word": "전호후량",
    "hanja": "前虎後狼",
    "meaning": "앞문의 호랑이를 막으니 뒷문의 이리가 나온다 (前門据虎後門進狼의 줄임말)"
  },
  {
    "id": "idiom-0d7cbae9f5ab",
    "word": "전화위복",
    "hanja": "轉禍爲福",
    "meaning": "재앙이나 어려움을 바꾸어 복이 되게 함."
  },
  {
    "id": "idiom-b9d2d6ff3424",
    "word": "절고진락",
    "hanja": "折槁振落",
    "meaning": "고목을 자르고, 낙엽을 움직이게 한다. 매우 쉬운 일"
  },
  {
    "id": "idiom-3b310e1c2094",
    "word": "절골지통",
    "hanja": "折骨之痛",
    "meaning": "뼈가 부러지는 아픔이라는 뜻으로 매우 견디기 어려운 고통"
  },
  {
    "id": "idiom-2c70bb110f64",
    "word": "절대가인",
    "hanja": "絶代佳人",
    "meaning": "이 세상에 비할 데 없는 미인"
  },
  {
    "id": "idiom-ea5993c300d9",
    "word": "절묘호사",
    "hanja": "絶妙好辭",
    "meaning": "채옹의 딸 채염이 거주하던 남전에 적혀 있는 글귀"
  },
  {
    "id": "idiom-fb573a1e7b9e",
    "word": "절발역주",
    "hanja": "截髮易酒",
    "meaning": "손님이 왔으나 대접할 것이 없어 머리카락을 잘라 술을 사서 손님을 대접함"
  },
  {
    "id": "idiom-97a51fbb7177",
    "word": "절세가인",
    "hanja": "絶世佳人",
    "meaning": "當代에 견줄 인물이 없는 미인"
  },
  {
    "id": "idiom-dd5a167776af",
    "word": "절영지회",
    "hanja": "絶纓之會",
    "meaning": "갓의 끈을 끊고 노는 잔치라는 뜻으로, 남에게 너그러운 德을 베푸는 것을 비유함"
  },
  {
    "id": "idiom-6cea9fbc8e69",
    "word": "절장결전",
    "hanja": "截腸決戰",
    "meaning": "적의 칼에 찔려 나온 창자를 밀어 넣고 들어가지 않는 부분은 잘라내고 또다시 싸웠다는 말"
  },
  {
    "id": "idiom-11d8d12c7ac1",
    "word": "절장보단",
    "hanja": "絶長補短",
    "meaning": "긴 것을 잘라 짧은 것에 보강한다는 뜻으로, 장점으로 단점을 보충함을 일컫는 말"
  },
  {
    "id": "idiom-8c7749daec85",
    "word": "절전지훈",
    "hanja": "折箭之訓",
    "meaning": "가는 화살도 여러 개가 모이면 꺾기가 힘들 듯 여러 형제가 협력하면 어떤 어려움도 극복할 수 있다"
  },
  {
    "id": "idiom-42ba29714266",
    "word": "절차탁마",
    "hanja": "切磋琢磨",
    "meaning": "학문이나 품성을 끊임없이 배우고 갈고닦음."
  },
  {
    "id": "idiom-8da2139809fa",
    "word": "절천야차",
    "hanja": "折天夜叉",
    "meaning": "하늘을 끊는 악귀라는 뜻. 황건적 장수 하만의 별칭이다"
  },
  {
    "id": "idiom-9e313b2a6c76",
    "word": "절치부심",
    "hanja": "切齒腐心",
    "meaning": "몹시 분하여 이를 갈면서 속을 썩임"
  },
  {
    "id": "idiom-3baec5f49d16",
    "word": "절풍목우",
    "hanja": "切風沐雨",
    "meaning": "바람으로 빗을 삼아 머리를 빗고 비로 머리를 감는다 (큰일을 이루기 위해 노력함).=櫛風沐雨)"
  },
  {
    "id": "idiom-3055244b0f49",
    "word": "점입가경",
    "hanja": "漸入佳境",
    "meaning": "점점 더 재미있는 경지로 들어감"
  },
  {
    "id": "idiom-8558b2d65d62",
    "word": "정구건즐",
    "hanja": "井臼巾櫛",
    "meaning": "물 긷고 절구질하고 수건과 빗을 받드는 일이라는 뜻으로 아내나 가정주부로서 하여야 할 일"
  },
  {
    "id": "idiom-b0c00f017753",
    "word": "정문금추",
    "hanja": "頂門金椎",
    "meaning": "쇠망치로 정수리를 두들긴다는 뜻으로 정신을 바짝 차리도록 깨우침을 이르는 말"
  },
  {
    "id": "idiom-d5e64939f5c5",
    "word": "정문일침",
    "hanja": "頂門一鍼",
    "meaning": "간절하고 따끈한 충고"
  },
  {
    "id": "idiom-6f1ddd0353c0",
    "word": "정문입설",
    "hanja": "程門立雪",
    "meaning": "遊酢와 楊時가 눈 오는 밤에 스승인 程伊川을 모시고 서 있었다 (제자가 스승을 극진히 섬김)"
  },
  {
    "id": "idiom-38c56f5add18",
    "word": "정서이견",
    "hanja": "情恕理遣",
    "meaning": "잘못이 있으면 온정으로 참고 이치에 비추어 용서함"
  },
  {
    "id": "idiom-8216a249f359",
    "word": "정설불식",
    "hanja": "井渫不食",
    "meaning": "아무리 우물을 깨끗하게 해 놓아도 남이 먹지 않으려 하면 어쩔 수 없다"
  },
  {
    "id": "idiom-0bc2c615279d",
    "word": "정여노위",
    "hanja": "政如魯衛",
    "meaning": "노나라의 태조 주공과 위나라의 태조 강숙은 형제 사이인데서 온 말로 정치가 서로 비슷함"
  },
  {
    "id": "idiom-45f6b9da095a",
    "word": "정저지와",
    "hanja": "井底之蛙",
    "meaning": "우물 안 개구리. 세상물정을 너무 모름"
  },
  {
    "id": "idiom-d322ff6e0f50",
    "word": "정정당당",
    "hanja": "正正堂堂",
    "meaning": "태도나 처지가 바르고 떳떳하다"
  },
  {
    "id": "idiom-706e3bc7457a",
    "word": "정중관천",
    "hanja": "井中觀天",
    "meaning": "좌정관청"
  },
  {
    "id": "idiom-12075a75c8a4",
    "word": "정중지와",
    "hanja": "井中之蛙",
    "meaning": "우물 밑의 개구리. 소견이나 견문이 몹시 좁은 것"
  },
  {
    "id": "idiom-166f5bbd0f2c",
    "word": "제갈동지",
    "hanja": "諸葛同知",
    "meaning": "제가 스스로 가로되 동지라 한다는 뜻 (건방지며 지체는 낮은 사람을 농으로 가리키는 말)"
  },
  {
    "id": "idiom-93acd9e33a94",
    "word": "제궤의혈",
    "hanja": "堤潰蟻穴",
    "meaning": "큰 방죽도 개미구멍으로 무너진다. 사소한 결함이라도 곧 손쓰지 않으면 큰 재난을 당하게 됨"
  },
  {
    "id": "idiom-6077667a705b",
    "word": "제마멸사",
    "hanja": "制魔滅邪",
    "meaning": "마귀를 억누르고 사악함을 멸하는 것"
  },
  {
    "id": "idiom-9fe42d464a3c",
    "word": "제세지재",
    "hanja": "濟世之才",
    "meaning": "세상을 구제할 만한 뛰어난 인물"
  },
  {
    "id": "idiom-dc323775e84a",
    "word": "제자백가",
    "hanja": "諸子百家",
    "meaning": "춘추 전국시대의 학자와 학설"
  },
  {
    "id": "idiom-9775f8cec3fa",
    "word": "제포연연",
    "hanja": "綈袍戀戀",
    "meaning": "벗이 추위에 떠는 것을 보고 두껍게 짠 비단옷을 주었다. 우정이 깊음을 일컫는다"
  },
  {
    "id": "idiom-cfb5944dcc1a",
    "word": "제하분주",
    "hanja": "濟河焚舟",
    "meaning": "적을 공격하러 가면서 배를 타고 물을 건넌 후 바로 배를 태워버린다. 必死의 뜻을 나타내는 말"
  },
  {
    "id": "idiom-fb5079313a5b",
    "word": "제행무상",
    "hanja": "諸行無常",
    "meaning": "인생의 덧없음. 우주의 만물은 항상 돌고 변하여서 같은 모습으로 꽉 정돈하여 있지 아니함"
  },
  {
    "id": "idiom-da17573e9e37",
    "word": "조강지처",
    "hanja": "糟糠之妻",
    "meaning": "가난할 때부터 어려움을 같이한 아내"
  },
  {
    "id": "idiom-897eafc8c71e",
    "word": "조령모개",
    "hanja": "朝令暮改",
    "meaning": "아침에 명령을 내리고 저녁에 다시 고침"
  },
  {
    "id": "idiom-8637c4852a85",
    "word": "조명시리",
    "hanja": "朝名市利",
    "meaning": "무슨 일이든 적당한 장소에서 행하라는 말"
  },
  {
    "id": "idiom-f6cd6c052852",
    "word": "조문석사",
    "hanja": "朝聞夕死",
    "meaning": "아침에 도를 들으면 저녁에 죽어도 좋다. 짧은 인생을 값지게 살아야 한다"
  },
  {
    "id": "idiom-bf5a2e4b7485",
    "word": "조반석죽",
    "hanja": "朝飯夕粥",
    "meaning": "아침에는 밥, 저녁에는 죽. 가까스로 살아가는 가난한 삶"
  },
  {
    "id": "idiom-276762547366",
    "word": "조변석개",
    "hanja": "朝變夕改",
    "meaning": "아침저녁으로 뜯어고침 (일을 자주 뜯어고침)"
  },
  {
    "id": "idiom-c162fd26fb1d",
    "word": "조불급석",
    "hanja": "朝不及夕",
    "meaning": "형세가 급박하여 아침에 저녁일이 어떻게 될지 알지 못함을 일컫는다"
  },
  {
    "id": "idiom-bbda3e366a04",
    "word": "조불려석",
    "hanja": "朝不慮夕",
    "meaning": "아침에 저녁 일을 염두에 두지 못함을 이르는 말 그 이후 일은 생각지 않음을 이르는 말"
  },
  {
    "id": "idiom-8dabdbf1a3e4",
    "word": "조불모석",
    "hanja": "朝不謀夕",
    "meaning": "아침에 저녁의 일을 헤아리지 못한다. 당장 눈앞의 일이나 결정할 뿐이지 앞일을 생각할 겨를이 없다"
  },
  {
    "id": "idiom-c50dbf8fb8fb",
    "word": "조삼모사",
    "hanja": "朝三暮四",
    "meaning": "눈앞의 차이에만 매여 본질이 같은 줄 모름. 또는 잔꾀로 남을 속임."
  },
  {
    "id": "idiom-766402d63b4a",
    "word": "조아지사",
    "hanja": "爪牙之士",
    "meaning": "손톱과 이빨은 새나 짐승이 자기를 보호하는 무기. 즉, 국가를 보필하는 신하를 일컫는다"
  },
  {
    "id": "idiom-47bedb77c8ee",
    "word": "조운모우",
    "hanja": "朝雲暮雨",
    "meaning": "아침에는 구름이 되고 저녁에는 비가 된다. 남녀간의 애정이 깊음을 비유하는 말로 쓰인다"
  },
  {
    "id": "idiom-587df55420aa",
    "word": "조의조식",
    "hanja": "粗衣粗食",
    "meaning": "허름한 옷과 변변찮은 음식 (그런 옷을 입고 그런 음식을 먹음)"
  },
  {
    "id": "idiom-c2046a5c9a7d",
    "word": "조제모염",
    "hanja": "朝薺暮鹽",
    "meaning": "냉이와 소금만으로 끼니를 해결할 정도로 몹시 빈곤한 생활을 의미한다"
  },
  {
    "id": "idiom-71e26c9cc58b",
    "word": "조족지혈",
    "hanja": "鳥足之血",
    "meaning": "새 발의 피라는 뜻으로 물건의 적음을 나타내는 말"
  },
  {
    "id": "idiom-5db3f86c8a50",
    "word": "조진모초",
    "hanja": "朝秦暮楚",
    "meaning": "아침에는 북방의 진나라에서 저녁에는 남방의 초나라에서 거처한다는 뜻 (정처 없이 사는 것)"
  },
  {
    "id": "idiom-08e7e34317e3",
    "word": "조화무궁",
    "hanja": "造化無窮",
    "meaning": "온 세상 만물을 낳고 자라게 하고 죽게 하는 대자연의 이치는 끝이 없음"
  },
  {
    "id": "idiom-6141a417c865",
    "word": "족려괄우",
    "hanja": "鏃礪括羽",
    "meaning": "학문을 닦고 슬기를 연마하여 쓸모 있는 존재가 됨"
  },
  {
    "id": "idiom-1183a121151e",
    "word": "족탈불급",
    "hanja": "足脫不及",
    "meaning": "맨발로 뛰어도 따라가지 못한다는 뜻으로, 능력이나 재질·역량 따위가 뚜렷한 차이가 있음"
  },
  {
    "id": "idiom-8532ff8df10f",
    "word": "존망지추",
    "hanja": "存亡之秋",
    "meaning": "존재하느냐 멸망하느냐의 절박한 때"
  },
  {
    "id": "idiom-752583c6187b",
    "word": "종남첩경",
    "hanja": "終南捷徑",
    "meaning": "出世와 榮達의 지름길. 목적 달성의 지름길"
  },
  {
    "id": "idiom-6fa68f0aee49",
    "word": "종두득두",
    "hanja": "種豆得豆",
    "meaning": "원인에 따라 결과가 나옴"
  },
  {
    "id": "idiom-3d1120b7847e",
    "word": "종두지미",
    "hanja": "從頭至尾",
    "meaning": "머리부터 꼬리까지, 즉 처음부터 끝까지"
  },
  {
    "id": "idiom-b94ae5e81335",
    "word": "종무소식",
    "hanja": "終無消息",
    "meaning": "끝내 소식이 없다"
  },
  {
    "id": "idiom-65e51453a901",
    "word": "종선여등",
    "hanja": "從善如登",
    "meaning": "착한 일을 쫓아 하는 것은 산을 오르는 것과 같다. 착한 일을 하는 것이 매우 힘들다는 말"
  },
  {
    "id": "idiom-20bb6a568353",
    "word": "종선여류",
    "hanja": "從善如流",
    "meaning": "善을 쫓는 태도가 물이 흐르는 것과 같이 서슴지 않음. 서슴지 않고 착한 일을 하는 태도를 말한다"
  },
  {
    "id": "idiom-41be57258f69",
    "word": "종심소욕",
    "hanja": "從心所欲",
    "meaning": "마음에 하고 싶은 대로 함"
  },
  {
    "id": "idiom-d88a0a8322fc",
    "word": "종용유상",
    "hanja": "從容有常",
    "meaning": "얼굴에 따른다. 안색, 행동 등을 바꾸지 않고 소신대로 행함"
  },
  {
    "id": "idiom-7cc62a14ed7b",
    "word": "종횡무진",
    "hanja": "縱橫無盡",
    "meaning": "행동이 마음 내키는 대로 自由自在로 하다"
  },
  {
    "id": "idiom-7279faf98d70",
    "word": "좌고우면",
    "hanja": "左顧右眄",
    "meaning": "좌우를 자주 둘러본다. 무슨 일에 얼른 결정을 짓지 못함을 비유함"
  },
  {
    "id": "idiom-0224214b8980",
    "word": "좌불수당",
    "hanja": "坐不垂堂",
    "meaning": "마루 끝에 앉는 것은 위험하기 때문에 앉지 않는다. 위험한 일에 가까이 하지 않음을 뜻한다"
  },
  {
    "id": "idiom-f935e01b5424",
    "word": "좌불안석",
    "hanja": "坐不安席",
    "meaning": "불안. 초조. 공포 따위로 한자리에 진득하게 앉아 있지 못함"
  },
  {
    "id": "idiom-2272d524575f",
    "word": "좌식산공",
    "hanja": "坐食山空",
    "meaning": "아무리 산더미같이 많은 재산도 벌지 않고 놀고먹기만 하면 끝내는 다 없어진다는 말"
  },
  {
    "id": "idiom-73d8facbb827",
    "word": "좌정관천",
    "hanja": "坐井觀天",
    "meaning": "우물 안 개구리. 세상물정을 너무 모름"
  },
  {
    "id": "idiom-99bf3af9fe06",
    "word": "좌지우지",
    "hanja": "左之右之",
    "meaning": "제 마음대로 자유롭게 처리함 남을 마음대로 지휘함"
  },
  {
    "id": "idiom-1f729b0cca21",
    "word": "좌충우돌",
    "hanja": "左衝右突",
    "meaning": "이리저리 마구 치고 받음"
  },
  {
    "id": "idiom-3a1f75b80a5f",
    "word": "주객일체",
    "hanja": "主客一體",
    "meaning": "주체와 객체가 하나로 됨. 자아와 자연이 하나로 됨"
  },
  {
    "id": "idiom-77166b735269",
    "word": "주객전도",
    "hanja": "主客顚倒",
    "meaning": "입장이 서로 뒤바뀜"
  },
  {
    "id": "idiom-4e7672e498f0",
    "word": "주경야독",
    "hanja": "晝耕夜讀",
    "meaning": "낮에는 일하고 밤에는 공부함"
  },
  {
    "id": "idiom-859dd353477c",
    "word": "주공삼태",
    "hanja": "周公三笞",
    "meaning": "주공의 세 차례 매질이라는 뜻으로, 자식들을 엄하게 교육시키는 것을 의미한다"
  },
  {
    "id": "idiom-a0920bbfa868",
    "word": "주과포혜",
    "hanja": "酒果脯醯",
    "meaning": "술·과실·포·식혜들로만 차린 간략한 제물"
  },
  {
    "id": "idiom-9989a6e9256f",
    "word": "주마가편",
    "hanja": "走馬加鞭",
    "meaning": "달리는 말에 채찍질을 계속함자신의 위치에 만족하지 않고 계속 노력함"
  },
  {
    "id": "idiom-d0e621f31fae",
    "word": "주마간산",
    "hanja": "走馬看山",
    "meaning": "바빠서 자세히 보지 못하고 지나침"
  },
  {
    "id": "idiom-c1a0b0112b59",
    "word": "주석지신",
    "hanja": "柱石之臣",
    "meaning": "한 나라의 주춧돌이 될 만한 신하"
  },
  {
    "id": "idiom-0d50759a2c55",
    "word": "주야장천",
    "hanja": "晝夜長川",
    "meaning": "밤낮으로 쉬지 않고 늘 잇달음"
  },
  {
    "id": "idiom-4de9b71dee2f",
    "word": "주지육림",
    "hanja": "酒池肉林",
    "meaning": "호사스럽고 방탕한 술자리"
  },
  {
    "id": "idiom-d25a1b326cb0",
    "word": "죽림칠현",
    "hanja": "竹林七賢",
    "meaning": "중국 魏나라 말엽 晉나라 초기에 죽림에서 술을 마시며 淸談을 하고 지내던 일곱 선비"
  },
  {
    "id": "idiom-b191cac39a7b",
    "word": "죽마고우",
    "hanja": "竹馬故友",
    "meaning": "어릴 때부터 함께 자라 온 오랜 친구."
  },
  {
    "id": "idiom-27fe834f0b49",
    "word": "죽장망혜",
    "hanja": "竹杖芒鞋",
    "meaning": "대지팡이와 짚신 가장 간단한 보행이나 여행의 차림"
  },
  {
    "id": "idiom-2be3799e412d",
    "word": "준조절충",
    "hanja": "樽俎折衝",
    "meaning": "외교를 비롯하여 그밖에 교섭에서 유리하게 담판 또는 흥정함"
  },
  {
    "id": "idiom-1a4f21c8b39d",
    "word": "줄탁동시",
    "hanja": "啐啄同時",
    "meaning": "병아리 우는 소리를 啐, 깨뜨리는 것을 啄이라 하는데, 놓쳐서는 안 될 좋은 시기의 비유"
  },
  {
    "id": "idiom-3748c9e1ad76",
    "word": "중과부적",
    "hanja": "衆寡不敵",
    "meaning": "적은 사람으로는 많은 사람을 이기지 못함"
  },
  {
    "id": "idiom-3ab9357a7484",
    "word": "중구난방",
    "hanja": "衆口難防",
    "meaning": "여러 사람의 말을 막기 어려움"
  },
  {
    "id": "idiom-ce46e4d48bc1",
    "word": "중구삭금",
    "hanja": "衆口鑠金",
    "meaning": "여러 사람이 합해 말하면 굳은 쇠도 녹인다. 참언 (讒言)의 두려움을 말함"
  },
  {
    "id": "idiom-a35bae871dc9",
    "word": "중농주의",
    "hanja": "重農主義",
    "meaning": "국가의 부의 기초는 농업에 있다는 경제 사상"
  },
  {
    "id": "idiom-b0939dee3454",
    "word": "중상모략",
    "hanja": "中傷謀略",
    "meaning": "터무니없는 말로 헐뜯거나 남을 해치려고 속임수를 써서 일을 꾸미다"
  },
  {
    "id": "idiom-c1403eb8ff77",
    "word": "중석몰족",
    "hanja": "中石沒鏃",
    "meaning": "쏜 화살이 돌에 깊이 박혔다는 뜻으로, 정신을 집중해서 전력을 다하면 성공할 수 있음"
  },
  {
    "id": "idiom-e4d28dfbbad3",
    "word": "중언부언",
    "hanja": "重言復言",
    "meaning": "한 말을 자꾸 되풀이 함"
  },
  {
    "id": "idiom-fc3032bc97ed",
    "word": "중용지도",
    "hanja": "中庸之道",
    "meaning": "마땅하고 떳떳한 도리. 극단에 치우치지 않고 평범함"
  },
  {
    "id": "idiom-f19ac74cd4cf",
    "word": "중원축록",
    "hanja": "中原逐鹿",
    "meaning": "중원은 중국 또는 천하를 말하며 축록은 서로 경쟁한다는 말. 다투어 천하는 얻고자 함을 뜻함"
  },
  {
    "id": "idiom-fd50ce125c09",
    "word": "중인환시",
    "hanja": "衆人環視",
    "meaning": "많은 사람들이 둘러서서 봄"
  },
  {
    "id": "idiom-4cfc944c8ea1",
    "word": "중취독성",
    "hanja": "衆醉獨醒",
    "meaning": "모두 취해 있는데 홀로 깨어 있다. 혼자 깨끗한 삶을 산다는 뜻"
  },
  {
    "id": "idiom-59764913629e",
    "word": "즐풍목우",
    "hanja": "櫛風沐雨",
    "meaning": "어지러운 세상에서 어려움과 고생을 참고 견디며 일에 골몰한다는 말 (=切風沐雨)"
  },
  {
    "id": "idiom-d0125008dd3f",
    "word": "증삼살인",
    "hanja": "曾參殺人",
    "meaning": "공자의 제자 증삼이 사람을 죽이다. 터무니없는 말이라도 여러 사람이 되풀이하면 믿는다"
  },
  {
    "id": "idiom-e4ce9e63b0d1",
    "word": "지강급미",
    "hanja": "舐糠及米",
    "meaning": "겨를 핥다가 마침내 쌀까지 먹어치움, 사람의 욕심이 끝이 없는 것을 비유"
  },
  {
    "id": "idiom-c743067c4de5",
    "word": "지과필개",
    "hanja": "知過必改",
    "meaning": "잘못을 알면 반드시 고쳐라"
  },
  {
    "id": "idiom-75cfb30619e2",
    "word": "지기지우",
    "hanja": "知己之友",
    "meaning": "서로 뜻이 통하는 친한 벗"
  },
  {
    "id": "idiom-e48608b9269c",
    "word": "지난이퇴",
    "hanja": "知難而退",
    "meaning": "형세가 불리한 것을 알면 마땅히 물러서야 함"
  },
  {
    "id": "idiom-0fc31ead0564",
    "word": "지독지애",
    "hanja": "舐犢之愛",
    "meaning": "어미 소가 송아지를 핥으며 사랑한다. 부모가 자식을 사랑함에 비유하나 지나쳐 좋지 못함"
  },
  {
    "id": "idiom-4def52bf9b4f",
    "word": "지독지정",
    "hanja": "舐犢之情",
    "meaning": "어미 소가 송아지를 핥아주며 귀여워한다는 뜻으로 자녀에 대한 어버이의 사랑을 비유한 말"
  },
  {
    "id": "idiom-6d6a63424b49",
    "word": "지동지서",
    "hanja": "之東之西",
    "meaning": "동으로 갔다 서로 갔다 함. 곧, 어떤 일에 주견이 없이 갈팡질팡함을 이르는 말"
  },
  {
    "id": "idiom-3ae43808eadc",
    "word": "지란지교",
    "hanja": "芝蘭之交",
    "meaning": "芝蘭은 영지와 난초로 모두가 향초를 말한다. 따라서 벗 사이의 고상한 교제를 일컫는다"
  },
  {
    "id": "idiom-0d08345297fd",
    "word": "지록위마",
    "hanja": "指鹿爲馬",
    "meaning": "윗사람을 농락하여 권세를 마음대로 함"
  },
  {
    "id": "idiom-b7188bbd285b",
    "word": "지리멸렬",
    "hanja": "支離滅裂",
    "meaning": "통일된 체계가 없고 마구 흩어져 우왕좌왕 갈피를 잡을 수 없게 됨을 일컬음"
  },
  {
    "id": "idiom-12e17463a78c",
    "word": "지명지년",
    "hanja": "知命之年",
    "meaning": "천명을 알 수 있는 나이. 나이 쉰 살을 달리 일컫는 말"
  },
  {
    "id": "idiom-48d32b541b2a",
    "word": "지복지양",
    "hanja": "指腹之約",
    "meaning": "뱃속의 태아를 가리켜 결혼 약속을 하는 것"
  },
  {
    "id": "idiom-c5e78bb9edee",
    "word": "지상담병",
    "hanja": "紙上談兵",
    "meaning": "종이 위에서 병법을 말한다는 뜻으로, 이론에만 밝을 뿐 실제적인 지식은 없는 경우에 사용됨"
  },
  {
    "id": "idiom-fbc5ff5d9644",
    "word": "지성감천",
    "hanja": "至誠感天",
    "meaning": "지극한 정성에 하늘이 감동함"
  },
  {
    "id": "idiom-523dc75e52ca",
    "word": "지어지앙",
    "hanja": "池魚之殃",
    "meaning": "화가 엉뚱한 곳에 미침"
  },
  {
    "id": "idiom-d5d5a658222f",
    "word": "지우이신",
    "hanja": "至愚而神",
    "meaning": "백성들이 보기에는 어리석으나 실제로는 매우 신령스러운 것"
  },
  {
    "id": "idiom-1a882bcd1b4a",
    "word": "지자불언",
    "hanja": "知者不言",
    "meaning": "지자는 지식을 경솔히 드러내거나 함부로 말하지 않음"
  },
  {
    "id": "idiom-67a6570c6882",
    "word": "지자불혹",
    "hanja": "知者不惑",
    "meaning": "지자는 도리를 깊이 알므로 어떠한 경우에도 미혹되지 아니함"
  },
  {
    "id": "idiom-a612d5b2855d",
    "word": "지자요수",
    "hanja": "知者樂水",
    "meaning": "지식이 있는 사람은 막히는 데가 없으므로 거침없이 흐르는 물을 좋아함"
  },
  {
    "id": "idiom-a991c39a8635",
    "word": "지족불욕",
    "hanja": "知足不辱",
    "meaning": "분수를 지키는 이는 욕되지 아니함"
  },
  {
    "id": "idiom-af0ae598ad49",
    "word": "지족안분",
    "hanja": "知足安分",
    "meaning": "족한 줄을 알아 자기의 분수에 만족함"
  },
  {
    "id": "idiom-e0d2ecfbcc29",
    "word": "지족지부",
    "hanja": "知足知富",
    "meaning": "족한 것을 알고 현재에 만족하는 사람은 부자라는 뜻"
  },
  {
    "id": "idiom-e7496ef2ae81",
    "word": "지척지간",
    "hanja": "咫尺之間",
    "meaning": "매우 가까운 거리. (=咫尺之地)"
  },
  {
    "id": "idiom-7c41fdf3e538",
    "word": "지척지지",
    "hanja": "咫尺之地",
    "meaning": "매우 가까운 곳"
  },
  {
    "id": "idiom-065573ecff85",
    "word": "지초북행",
    "hanja": "至楚北行",
    "meaning": "초나라에 이르려고 하면서 북쪽으로 간다는 말로, 생각과 행동이 상반되는 것"
  },
  {
    "id": "idiom-cff3ffd4acca",
    "word": "지치득거",
    "hanja": "舐痔得車",
    "meaning": "똥구멍을 핥아 수레를 얻는다는 뜻으로, 미천한 일을 하여 큰 이익을 얻는 것을 말한다"
  },
  {
    "id": "idiom-8659c8dfd842",
    "word": "지피지기",
    "hanja": "知彼知己",
    "meaning": "상대와 자기의 형편을 모두 잘 앎."
  },
  {
    "id": "idiom-f4414bc73cfb",
    "word": "지행일치",
    "hanja": "知行一致",
    "meaning": "아는 것과 행함이 같아야 함. (=知行合一)"
  },
  {
    "id": "idiom-cd6d6dcf1868",
    "word": "지행합일",
    "hanja": "知行合一",
    "meaning": "참지 식은 반드시 실행이 따라야 한다는 말"
  },
  {
    "id": "idiom-dcd6073ccd50",
    "word": "지호지간",
    "hanja": "指呼之間",
    "meaning": "부르면 곧 대답할 만한 가까운 거리"
  },
  {
    "id": "idiom-bca5a58a2c1b",
    "word": "직목선벌",
    "hanja": "直木先伐",
    "meaning": "곧은 나무는 쓸모가 많기 때문에 일찍 베인다. 쓸모 있는 사람은 그만큼 혹사당하므로 일찍 쇠퇴한다"
  },
  {
    "id": "idiom-be6c02b965b4",
    "word": "진금부도",
    "hanja": "眞金不鍍",
    "meaning": "참 황금은 도금을 하지 않음. 진실한 재주가 있는 사람은 꾸밀 필요가 없음을 이름"
  },
  {
    "id": "idiom-8aa0b0dac849",
    "word": "진번하탑",
    "hanja": "陳蕃下榻",
    "meaning": "진번이 榻을 하나 만들어 두고 서유자가 오면 이것을 내려놓고 우대함 (빈객을 공대할 때 쓰는 말)"
  },
  {
    "id": "idiom-e9f70b433ef1",
    "word": "진복론천",
    "hanja": "秦宓論天",
    "meaning": "촉의 진복이 오의 사신 장온과 하늘에 대해 논한 일"
  },
  {
    "id": "idiom-4e0312911dac",
    "word": "진선진미",
    "hanja": "盡善盡美",
    "meaning": "완전무결함"
  },
  {
    "id": "idiom-74c044c3834a",
    "word": "진수성찬",
    "hanja": "珍羞盛饌",
    "meaning": "맛이 좋은 음식으로 많이 잘 차린 것을 뜻함"
  },
  {
    "id": "idiom-2e03f452094f",
    "word": "진적위산",
    "hanja": "塵積爲山",
    "meaning": "티끌이 모여 태산을 이룸"
  },
  {
    "id": "idiom-5bfea331ea35",
    "word": "진천동지",
    "hanja": "震天動地",
    "meaning": "하늘이 진동하고 땅이 흔들리다. 위엄이 천하에 떨치다"
  },
  {
    "id": "idiom-0e7968fd7511",
    "word": "진충보국",
    "hanja": "盡忠報國",
    "meaning": "충성을 다하여 나라에 보답함"
  },
  {
    "id": "idiom-f2fb96f72e6f",
    "word": "진퇴양난",
    "hanja": "進退兩難",
    "meaning": "나아갈 수도 물러설 수도 없는 궁지에 빠짐"
  },
  {
    "id": "idiom-8b2660f1184d",
    "word": "진퇴유곡",
    "hanja": "進退維谷",
    "meaning": "오지도 가지도 못할 궁지에 빠짐"
  },
  {
    "id": "idiom-40e7f4d25571",
    "word": "진합태산",
    "hanja": "塵合泰山",
    "meaning": "티끌모아태산"
  },
  {
    "id": "idiom-22e0203eb14a",
    "word": "질의응답",
    "hanja": "質疑應答",
    "meaning": "한편에서 의심나는 점을 묻고, 물음을 받은 편에서 대답하는 일"
  },
  {
    "id": "idiom-bbb55021f5e0",
    "word": "질축배척",
    "hanja": "嫉逐排斥",
    "meaning": "시기하고 미워하여 물리침"
  },
  {
    "id": "idiom-065c14280a4b",
    "word": "질풍노도",
    "hanja": "疾風怒濤",
    "meaning": "몹시 빠르게 부는 바람과 무섭게 소용돌이치는 큰 물결"
  },
  {
    "id": "idiom-b1aea07fb405",
    "word": "집사광익",
    "hanja": "集思廣益",
    "meaning": "뜻을 모아야 큰 이로움이 있다는 뜻으로, 제갈량이 동료와 부하들에게 편지를 쓸 때 이렇게 말하였다"
  },
  {
    "id": "idiom-e293688fe32a",
    "word": "집소성대",
    "hanja": "集小成大",
    "meaning": "작은 것이 모여 큰 것을 이룬다"
  },
  {
    "id": "idiom-0524fee4fc2f",
    "word": "징갱취제",
    "hanja": "懲羹吹懲",
    "meaning": "뜨거운 국에 데어서 냉채를 후후 불고 먹는다, 한 번 실패 한 후 지나치게 조심함의 비유"
  },
  {
    "id": "idiom-953356d72407",
    "word": "차계기환",
    "hanja": "借鷄騎還",
    "meaning": "닭을 빌려 타고 돌아간다는 뜻. 손님을 박대하는 것을 비꼬는 데 인용하는 말"
  },
  {
    "id": "idiom-c0086fa1715d",
    "word": "차도살인",
    "hanja": "借刀殺人",
    "meaning": "칼을 빌려 남을 죽인다는 뜻"
  },
  {
    "id": "idiom-b0b3c3b00832",
    "word": "차래지식",
    "hanja": "嗟來之食",
    "meaning": "야! 하고 부르면 와서 먹는 음식. 남을 업신여겨 무례한 태도로 주는 음식"
  },
  {
    "id": "idiom-7c39fbe08798",
    "word": "차문차답",
    "hanja": "且問且答",
    "meaning": "한편으로는 물으면서 한편으론 대답함"
  },
  {
    "id": "idiom-49e4330f67d8",
    "word": "차일피일",
    "hanja": "此日彼日",
    "meaning": "일을 핑계하고 자꾸 기한을 미루어 가는 것"
  },
  {
    "id": "idiom-20fa8a5122a8",
    "word": "차청입실",
    "hanja": "借廳入室",
    "meaning": "대청을 빌어 있다가 차츰 안방으로 들어온다. 남에게 의지하고 있다가 차차 남의 권리를 침범함"
  },
  {
    "id": "idiom-db89d3772b74",
    "word": "차청차규",
    "hanja": "借廳借閨",
    "meaning": "마루를 빌리다가 방으로 들어오다. 남에게 의지하다가 차차 그 권리를 침범하다"
  },
  {
    "id": "idiom-8aba5e1caafe",
    "word": "차호위호",
    "hanja": "借虎爲狐",
    "meaning": "호랑이의 위엄을 빌린 여우란 뜻으로 남의 권세를 빌어 뽐내는 것을 비유한 말"
  },
  {
    "id": "idiom-d3a6d929c357",
    "word": "착음경식",
    "hanja": "鑿飮耕食",
    "meaning": "우물을 파서 마시며 밭을 갈아먹는다. 는 뜻으로 천하가 태평하고 생활이 안락함을 비유함"
  },
  {
    "id": "idiom-c4ef92cb98bf",
    "word": "찬반양론",
    "hanja": "贊反兩論",
    "meaning": "찬성과 반대의 두 가지 의론"
  },
  {
    "id": "idiom-23171881369c",
    "word": "찰찰불찰",
    "hanja": "察察不察",
    "meaning": "너무 세밀하여도 실수가 있다는 말"
  },
  {
    "id": "idiom-1c862caa08d4",
    "word": "창상지변",
    "hanja": "滄桑之變",
    "meaning": "큰 변화가 있는 일"
  },
  {
    "id": "idiom-ce67426d24a3",
    "word": "창서칭상",
    "hanja": "倉舒秤象",
    "meaning": "조조의 아들 창서가 오에서 보내온 코끼리의 무게를 잰 고사를 말한다"
  },
  {
    "id": "idiom-752a0cab51d1",
    "word": "창씨고씨",
    "hanja": "創氏庫氏",
    "meaning": "중국에서 창씨와 고씨가 세습적으로 곳집을 맡아 보았다는 말로 사물이 오래도록 변치 않음"
  },
  {
    "id": "idiom-f4394c6c2432",
    "word": "창업수성",
    "hanja": "創業守成",
    "meaning": "일을 시작하기는 쉬우나 이룬 것을 지키기는 어려움 (=創業易守成難)"
  },
  {
    "id": "idiom-935640239ac8",
    "word": "창해상전",
    "hanja": "滄海桑田",
    "meaning": "푸른바 다가 뽕밭으로 변함"
  },
  {
    "id": "idiom-1dcc136f94b7",
    "word": "창해유주",
    "hanja": "滄海遺珠",
    "meaning": "세상에 알려지지 않은 賢者 또는 名作을 비유하는 말"
  },
  {
    "id": "idiom-3eda784b0c3f",
    "word": "창해일속",
    "hanja": "滄海一粟",
    "meaning": "아주 큰 물건 속에 있는 작은 물건"
  },
  {
    "id": "idiom-0e2052aa1636",
    "word": "채신지우",
    "hanja": "採薪之憂",
    "meaning": "자기 병을 겸손하게 일컫는 말. 아파서 나무를 할 수 없다는 뜻 (=負薪之憂)"
  },
  {
    "id": "idiom-6d9d128e531e",
    "word": "책기지심",
    "hanja": "責己之心",
    "meaning": "스스로 제 허물을 꾸짖는 마음"
  },
  {
    "id": "idiom-67c66dd69db7",
    "word": "책인즉명",
    "hanja": "責人則明",
    "meaning": "남을 꾸짖는 데에는 밝다. 자기의 잘못을 덮어두고 남만 나무라다"
  },
  {
    "id": "idiom-5e985e4cfaee",
    "word": "처성자옥",
    "hanja": "妻城子獄",
    "meaning": "아내의 성과 자식의 감옥에 갇혀 있다. 妻子가 있는 사람은 집안일에 완전히 얽매여서 있음을 이름"
  },
  {
    "id": "idiom-664dfce20a8b",
    "word": "척단촌장",
    "hanja": "尺短寸長",
    "meaning": "10寸이 1尺이지만, 척도 짧을 때가 있고, 촌도 길 때가 있다는 뜻"
  },
  {
    "id": "idiom-ec7f9f4f9951",
    "word": "척사위정",
    "hanja": "斥邪衛正",
    "meaning": "사악한 것을 배척하고 정의를 지키다"
  },
  {
    "id": "idiom-af1d9c6a9927",
    "word": "천계일봉",
    "hanja": "千鷄一鳳",
    "meaning": "닭 천 마리 중에 봉황이 한 마리가 있다는 뜻"
  },
  {
    "id": "idiom-f798026359fb",
    "word": "천고마비",
    "hanja": "天高馬肥",
    "meaning": "하늘은 높고 말은 살찐다. 가을을 말함"
  },
  {
    "id": "idiom-ac62c0172cbe",
    "word": "천고불후",
    "hanja": "千古不朽",
    "meaning": "영원히 썩지 않다"
  },
  {
    "id": "idiom-81b72a58de93",
    "word": "천년일청",
    "hanja": "千年一淸",
    "meaning": "黃河같은 濁流가 맑아지기를 천년 동안 바란다. 가능하지 않은 일을 바라는 것을 일컬음"
  },
  {
    "id": "idiom-d6240ff33b43",
    "word": "천도시비",
    "hanja": "天道是非",
    "meaning": "세상의 불공정을 한탄하고 하늘의 정당성을 의심하는 말이다"
  },
  {
    "id": "idiom-1983e658e1b7",
    "word": "천려일득",
    "hanja": "千慮一得",
    "meaning": "천 번 생각에 한번의 이득 (모자라는 사람이라도 많은 생각 속에는 쓸 만한 것이 반드시 있음)"
  },
  {
    "id": "idiom-df79022ffd61",
    "word": "천려일실",
    "hanja": "千慮一失",
    "meaning": "지혜로운 사람도 많은 생각가운데는 미처 생각하지 못하는 것이 있음"
  },
  {
    "id": "idiom-5e6876fecf2a",
    "word": "천무이일",
    "hanja": "天無二日",
    "meaning": "나라에는 오직 한 임금이 있을 뿐이다"
  },
  {
    "id": "idiom-4644517feb96",
    "word": "천방지축",
    "hanja": "天方地軸",
    "meaning": "함부로 덤벙거림"
  },
  {
    "id": "idiom-2de4d1d2a6d8",
    "word": "천변만화",
    "hanja": "千變萬化",
    "meaning": "천 가지 만 가지 변화"
  },
  {
    "id": "idiom-e3e7e4b2b1e6",
    "word": "천부지학",
    "hanja": "天府之學",
    "meaning": "하늘에서 비밀리에 내려오는 깊은 학문"
  },
  {
    "id": "idiom-789f479f4b00",
    "word": "천붕지통",
    "hanja": "天崩之痛",
    "meaning": "제왕이나 아버지의 상사를 당한 슬픔"
  },
  {
    "id": "idiom-b94959c430bd",
    "word": "천사만고",
    "hanja": "千思萬考",
    "meaning": "천번 만번 생각한다. 여러 가지로 생각하다"
  },
  {
    "id": "idiom-44fe48bacb3c",
    "word": "천생배필",
    "hanja": "天生配匹",
    "meaning": "하늘이 맺어 준 배필 (부부)"
  },
  {
    "id": "idiom-c3c3c8aabdd4",
    "word": "천생연분",
    "hanja": "天生緣分",
    "meaning": "하늘이 맺어 준 깊은 연분이란 뜻"
  },
  {
    "id": "idiom-a5ce892de88d",
    "word": "천석고황",
    "hanja": "泉石膏肓",
    "meaning": "산수를 사랑하는 것이 정도에 지나쳐 마치 불치병에 걸린 것같이 되었음을 이르는 말"
  },
  {
    "id": "idiom-ade48a348221",
    "word": "천선지전",
    "hanja": "天旋地轉",
    "meaning": "세상일이 크게 변함"
  },
  {
    "id": "idiom-25fe3f0b6b93",
    "word": "천신만고",
    "hanja": "千辛萬苦",
    "meaning": "온갖 고생. 무진 애를 씀"
  },
  {
    "id": "idiom-97c279cc0e4a",
    "word": "천양지차",
    "hanja": "天壤之差",
    "meaning": "하늘과 땅의 차이. 즉, 아주 차이가 심함을 이르는 말"
  },
  {
    "id": "idiom-2b5e71920770",
    "word": "천양지판",
    "hanja": "天壤之判",
    "meaning": "하늘과 땅의 차이. 곧 아주 엄청난 차이"
  },
  {
    "id": "idiom-0e07a0244459",
    "word": "천언만어",
    "hanja": "千言萬語",
    "meaning": "수많은 말"
  },
  {
    "id": "idiom-361d9e234542",
    "word": "천우신조",
    "hanja": "天佑神助",
    "meaning": "하늘과 신령이 도움. 생각지 않게 우연히 도움을 받는 것"
  },
  {
    "id": "idiom-aa4f2b16abf4",
    "word": "천의무봉",
    "hanja": "天衣無縫",
    "meaning": "문장이 훌륭하여 손 댈 곳이 없을 만큼 잘 되었음"
  },
  {
    "id": "idiom-3140490f02b0",
    "word": "천인공노",
    "hanja": "天人共怒",
    "meaning": "하늘과 땅이 함께 분노한다는 뜻. 도저히 용서 못함을 비유"
  },
  {
    "id": "idiom-cd14ca85d1a4",
    "word": "천인단애",
    "hanja": "千仞斷崖",
    "meaning": "천 길이나 되는 깎아지른 듯한 벼랑"
  },
  {
    "id": "idiom-1323f22ef6f7",
    "word": "천인만장",
    "hanja": "千引萬丈",
    "meaning": "천길 만길"
  },
  {
    "id": "idiom-7020cb4c6197",
    "word": "천자만홍",
    "hanja": "千紫萬紅",
    "meaning": "가지가지 빛깔로 만발한 꽃"
  },
  {
    "id": "idiom-f39abde282f8",
    "word": "천재일우",
    "hanja": "千載一遇",
    "meaning": "다시 얻기 어려운 좋은 기회"
  },
  {
    "id": "idiom-caa04d0935d0",
    "word": "천재지변",
    "hanja": "天災地變",
    "meaning": "하늘이나 땅에서 일어나는 재난이나 변사"
  },
  {
    "id": "idiom-73752e3c34a1",
    "word": "천정부지",
    "hanja": "天井不知",
    "meaning": "물가가 자꾸 오름을 이르는 말"
  },
  {
    "id": "idiom-bcd2c1f177cb",
    "word": "천중가절",
    "hanja": "天中佳節",
    "meaning": "오월 단오"
  },
  {
    "id": "idiom-3d0bb3b5cd36",
    "word": "천지진동",
    "hanja": "天地震動",
    "meaning": "하늘과 땅이 울려서 움직인다는 뜻으로 소리가 매우 큼을 일컫는 말"
  },
  {
    "id": "idiom-1135a02017fd",
    "word": "천진난만",
    "hanja": "天眞爛漫",
    "meaning": "가식이 없는 말과 행동"
  },
  {
    "id": "idiom-b90065bafb47",
    "word": "천차만별",
    "hanja": "千差萬別",
    "meaning": "여러 가지 사물이 모두 차이가 있고 구별이 있음"
  },
  {
    "id": "idiom-ceb974449f40",
    "word": "천편일률",
    "hanja": "千篇一律",
    "meaning": "변함없이 모든 사물이 똑같음"
  },
  {
    "id": "idiom-192196f29215",
    "word": "천학비재",
    "hanja": "淺學菲才",
    "meaning": "학문이 얕고 재주가 변변치 않음. 자신의 학식을 겸사하는 말"
  },
  {
    "id": "idiom-1e1ff020d6a7",
    "word": "천한백옥",
    "hanja": "天寒白屋",
    "meaning": "추운 날에 불을 못 때는 가난한 집을 말함"
  },
  {
    "id": "idiom-549d8cfa5a6b",
    "word": "철두철미",
    "hanja": "徹頭徹尾",
    "meaning": "머리에서 꼬리까지 투철함, 즉 처음부터 끝까지 투철함"
  },
  {
    "id": "idiom-4bcb06497014",
    "word": "철부지급",
    "hanja": "轍鮒之急",
    "meaning": "轍鮒는 수레바퀴 자국 속의 붕어로서 그 자국만큼의 물만 있어도 살 수 있는 처지이다"
  },
  {
    "id": "idiom-eb1650e4cfb5",
    "word": "철석간장",
    "hanja": "鐵石肝腸",
    "meaning": "철이나 돌 같은 간과 창자. 굳고 단단한 마음"
  },
  {
    "id": "idiom-665ef7d37b15",
    "word": "철중쟁쟁",
    "hanja": "鐵中錚錚",
    "meaning": "같은 쇠 가운데서도 유난히 맑게 쟁그랑거리는 소리가 난다. 같은 또래 중에서 뛰어난 사람"
  },
  {
    "id": "idiom-036c291ac7b0",
    "word": "철천지원",
    "hanja": "徹天之寃",
    "meaning": "하늘에서 사무치도록 크나큰 원한"
  },
  {
    "id": "idiom-9bcc81409124",
    "word": "철천지한",
    "hanja": "徹天之恨",
    "meaning": "하늘에 사무치는 그지없는 원한"
  },
  {
    "id": "idiom-c68b6dabddea",
    "word": "철환천하",
    "hanja": "轍環天下",
    "meaning": "수레 (轍)를 타고 세상 (天下)을 돌아다님 (環) (敎化를 위하여 온 세상을 돌아다님)"
  },
  {
    "id": "idiom-6b6fea40ffa4",
    "word": "청경우독",
    "hanja": "淸耕雨讀",
    "meaning": "맑을 땐 밭을 갈고 비가 올 땐 책을 읽는다. 제갈량이 융중에서 이런 생활을 하였다고 한다"
  },
  {
    "id": "idiom-7b11911ce1c8",
    "word": "청렴결백",
    "hanja": "淸廉潔白",
    "meaning": "마음이 맑고 곧아 뒤로 검은 데가 전혀 없는 것"
  },
  {
    "id": "idiom-a50e4dbab39b",
    "word": "청산유수",
    "hanja": "靑山流水",
    "meaning": "청산에 흐르는 물. 거침없이 잘하는 말에 비유"
  },
  {
    "id": "idiom-dd8410c8c7c8",
    "word": "청송백사",
    "hanja": "靑松白沙",
    "meaning": "푸른 소나무와 흰 모래. 해안의 아름다운 경치를 이르는 말"
  },
  {
    "id": "idiom-f79004661b54",
    "word": "청심과욕",
    "hanja": "淸心寡慾",
    "meaning": "마음을 깨끗이 하고 욕심을 적게 함"
  },
  {
    "id": "idiom-a0807b597975",
    "word": "청운만리",
    "hanja": "靑雲萬里",
    "meaning": "푸른 꿈은 멀고 큼"
  },
  {
    "id": "idiom-befef58e52da",
    "word": "청운지지",
    "hanja": "靑雲之志",
    "meaning": "출세하고자 하는 뜻"
  },
  {
    "id": "idiom-05a55a7e9386",
    "word": "청운추월",
    "hanja": "晴雲秋月",
    "meaning": "맑은 하늘에 비치는 가을 달. 깨끗한 마음을 비유하여 이르는 말"
  },
  {
    "id": "idiom-3a20e9215c68",
    "word": "청천백일",
    "hanja": "靑天白日",
    "meaning": "맑게 댄 대낮, 뒤가 썩 깨끗한 일, 원죄가 판명되어 무죄가 됨"
  },
  {
    "id": "idiom-b08be73188a2",
    "word": "청천벽력",
    "hanja": "靑天霹靂",
    "meaning": "생각지 않은 일"
  },
  {
    "id": "idiom-fa945adc99e5",
    "word": "청출어람",
    "hanja": "靑出於藍",
    "meaning": "제자나 뒤에 온 사람이 스승이나 앞선 사람보다 뛰어남."
  },
  {
    "id": "idiom-6cd0b61fc844",
    "word": "청풍명월",
    "hanja": "淸風明月",
    "meaning": "초가을 밤의 싱 그런 느낌. 상쾌한 밤바람과 맑고 밝은 달빛. 그리고 조용히 술을 마신다"
  },
  {
    "id": "idiom-b9369e5d5a1e",
    "word": "초근목피",
    "hanja": "草根木皮",
    "meaning": "풀뿌리와 수목의 껍질 .모두 한방약의 원료가 되는 것이 많다"
  },
  {
    "id": "idiom-6f742ead2511",
    "word": "초동급부",
    "hanja": "樵童汲婦",
    "meaning": "나무하는 아이와 물 긷는 아낙네. 보통사람"
  },
  {
    "id": "idiom-c8cd17d58ec9",
    "word": "초로인생",
    "hanja": "草路人生",
    "meaning": "풀끝의 이슬 같이 덧없는 인생"
  },
  {
    "id": "idiom-b0787e6a7207",
    "word": "초록동색",
    "hanja": "草綠同色",
    "meaning": "풀빛과 녹색은 같은 색깔이다, 명칭은 다르지만 한 가지 것이란 말로, 같은 무리끼리 어울린다"
  },
  {
    "id": "idiom-609877146e50",
    "word": "초목개병",
    "hanja": "草木皆兵",
    "meaning": "초목이 모두 적병처럼 보여서 놀랐다는 데서 나온 말"
  },
  {
    "id": "idiom-5ac1412cfcf8",
    "word": "초목구부",
    "hanja": "草木俱腐",
    "meaning": "초목과 함께 썩어 없어진다는 뜻으로 세상에 이름을 남기지 못하고 사라짐의 비유"
  },
  {
    "id": "idiom-af4be7fb285b",
    "word": "초미지급",
    "hanja": "焦眉之急",
    "meaning": "눈썹에 불이 붙음과 같이 매우 다급한 지경"
  },
  {
    "id": "idiom-e3f52f013503",
    "word": "초범입성",
    "hanja": "超凡入聖",
    "meaning": "평범한 사람의 범위를 벗어나 성인의 경지에 들어가는 것"
  },
  {
    "id": "idiom-c74e4f572f99",
    "word": "초재진용",
    "hanja": "草材晉用",
    "meaning": "초나라의 목재를 진나라가 사용한다 (자기는 그 가치를 알지 못하고 남이 그것을 이용함을 이르는 말)"
  },
  {
    "id": "idiom-c4672a4acba2",
    "word": "초지일관",
    "hanja": "初志一貫",
    "meaning": "처음 품은 뜻을 한결같이 꿰뚫음"
  },
  {
    "id": "idiom-527564693d97",
    "word": "촉견폐일",
    "hanja": "蜀犬吠日",
    "meaning": "蜀나라의 개는 해를 흔히 볼 수 없어 해만 보면 짖는다. (식견이 좁은 사람이 어진 사람을 비난)"
  },
  {
    "id": "idiom-2be1af973a01",
    "word": "촉목상심",
    "hanja": "觸目傷心",
    "meaning": "눈에 띄는 것마다 마음을 아프게 함"
  },
  {
    "id": "idiom-836908da4cfe",
    "word": "촌철살인",
    "hanja": "寸鐵殺人",
    "meaning": "짧은 말로 어떤 일의 급소를 찔러 사람을 크게 감동시킴"
  },
  {
    "id": "idiom-49b745e665c7",
    "word": "추경정용",
    "hanja": "錐輕釘聳",
    "meaning": "망치가 가벼우면 못이 위로 솟는다. 윗사람이 위엄이 없으면 아랫사람이 반항한다"
  },
  {
    "id": "idiom-5061b53382bf",
    "word": "추고마비",
    "hanja": "秋高馬肥",
    "meaning": "가을 하늘이 높으니 말은 살찐다는 뜻 (=天高馬肥)"
  },
  {
    "id": "idiom-61540b60d8c4",
    "word": "추기급인",
    "hanja": "推己及人",
    "meaning": "자신의 처지를 미루어 다른 사람의 형편을 헤아린다는 뜻이다"
  },
  {
    "id": "idiom-1e489b30679d",
    "word": "추야장장",
    "hanja": "秋夜長長",
    "meaning": "가을밤이 길고도 길다"
  },
  {
    "id": "idiom-485e0e4afbb5",
    "word": "추우강남",
    "hanja": "追友江南",
    "meaning": "친구 따라 강남 간다. 주견 없는 행동을 뜻함"
  },
  {
    "id": "idiom-24568e74b3b7",
    "word": "추원보본",
    "hanja": "追遠報本",
    "meaning": "조상의 덕을 추모하여 제사를 지내고, 자기의 태어난 근본을 잊지 않고 은혜를 갚음"
  },
  {
    "id": "idiom-b16542deba81",
    "word": "추풍낙엽",
    "hanja": "秋風落葉",
    "meaning": "시들어 떨어지거나 헤어져 흩어짐의 비유"
  },
  {
    "id": "idiom-531d8307d99a",
    "word": "춘추도외",
    "hanja": "春秋筆法",
    "meaning": "내버려두고 문제로 삼지 않음"
  },
  {
    "id": "idiom-c07160a5a797",
    "word": "춘추오패",
    "hanja": "春秋五覇",
    "meaning": "순자의 오패라 함은 齊나라 桓公, 晉나라 文公, 楚나라 莊王, 吳나라 闔閭, 越나라의 勾踐"
  },
  {
    "id": "idiom-73e266a571c8",
    "word": "춘치자명",
    "hanja": "春雉自鳴",
    "meaning": "봄철의 꿩이 스스로 운다. 시키거나 요구하지 아니하여도 제풀에 하는 것"
  },
  {
    "id": "idiom-9660b67da035",
    "word": "춘풍추우",
    "hanja": "春風秋雨",
    "meaning": "봄철에 부는 바람과 가을에 내리는 비. 곧 지나가는 세월을 가리키는 말"
  },
  {
    "id": "idiom-e2864dd5773a",
    "word": "출가외인",
    "hanja": "出嫁外人",
    "meaning": "출가한 딸은 남이나 마찬가지라는 말"
  },
  {
    "id": "idiom-4ea87e6023bc",
    "word": "출기불의",
    "hanja": "出其不意",
    "meaning": "일이 뜻밖에 일어난다는 말"
  },
  {
    "id": "idiom-a50a58beaf90",
    "word": "출몰무쌍",
    "hanja": "出沒無雙",
    "meaning": "듣고 남이 비할 데 없이 잦은 것"
  },
  {
    "id": "idiom-00a3b7b21975",
    "word": "출이반이",
    "hanja": "出爾反爾",
    "meaning": "너에게서 나온 것은 너에게로 돌아온다. 자기가 뿌린 씨는 자기가 거두게 된다"
  },
  {
    "id": "idiom-8ae9914e14d3",
    "word": "출장입상",
    "hanja": "出將入相",
    "meaning": "문무가 다 갖추어진 사람"
  },
  {
    "id": "idiom-aaf2e12d5b71",
    "word": "충불고사",
    "hanja": "忠不顧死",
    "meaning": "충은 죽음을 돌아보지 않음이라는 뜻"
  },
  {
    "id": "idiom-7f22771fa2df",
    "word": "충언역이",
    "hanja": "忠言逆耳",
    "meaning": "충고하는 말은 귀에 거슬림"
  },
  {
    "id": "idiom-f42492965dbc",
    "word": "취모구자",
    "hanja": "吹毛求疵",
    "meaning": "털을 불어 헤쳐서 그 속의 흉을 찾는다. 곧 남의 조그만 잘못을 샅샅이 찾아내는 것을 이른다"
  },
  {
    "id": "idiom-c0cd3888f04c",
    "word": "취모멱자",
    "hanja": "吹毛覓疵",
    "meaning": "털 사이를 불어가면서 흠을 찾음. 남의 결점을 억지로 낱낱이 찾아내는 것을 말한다"
  },
  {
    "id": "idiom-008a5040c68b",
    "word": "취문성뢰",
    "hanja": "聚蚊成雷",
    "meaning": "모기가 모여서 올 때는 그 소리가 뇌성과 같다는 뜻. 모기 소리를 뭇 소인의 참언에 비유한 말"
  },
  {
    "id": "idiom-f179b165bd91",
    "word": "취사선택",
    "hanja": "取捨選擇",
    "meaning": "취하고 버려 선택함"
  },
  {
    "id": "idiom-400946ca9539",
    "word": "취사이우",
    "hanja": "聚沙而雨",
    "meaning": "흙이 아니면 나무가 자랄 수 없음과 같이 일을 감당할 수 있는 사람에게 맡겨야만 이룰 수 있음"
  },
  {
    "id": "idiom-6158975c703f",
    "word": "취산십춘",
    "hanja": "聚散十春",
    "meaning": "벗끼리 만나기도 하고 헤어지기도 하여 이미 십여 년이 지남"
  },
  {
    "id": "idiom-4472d65cdbb4",
    "word": "취생몽사",
    "hanja": "醉生夢死",
    "meaning": "술에 취한 듯, 꿈을 꾸듯 살다가 죽는다. (일생을 아무 일도 하지 않고 흐리멍텅하게 보냄)"
  },
  {
    "id": "idiom-de92c3228601",
    "word": "측은지심",
    "hanja": "惻隱之心",
    "meaning": "불쌍히 여기는 마음.治絲棼之 (치사분지) 실을 급히 풀려고 하면 오히려 엉킨다. 급히 해서 오히려 엉키게 하는 것을 비유"
  },
  {
    "id": "idiom-07abb8d95f44",
    "word": "치산치수",
    "hanja": "治山治水",
    "meaning": "산과 물을 잘 다스려서 그 피해를 막음"
  },
  {
    "id": "idiom-f391e6bb6c9a",
    "word": "치인설몽",
    "hanja": "癡人說夢",
    "meaning": "바보에게 꿈 이야기를 해준다는 뜻. 어리석기 짝이 없는 짓의 비유. 상대방에게 이해되지 않음"
  },
  {
    "id": "idiom-2604091a3be0",
    "word": "치지도외",
    "hanja": "置之度外",
    "meaning": "내버려 두고 상대하지 않음"
  },
  {
    "id": "idiom-2d66152988fe",
    "word": "칠거지악",
    "hanja": "七去之惡",
    "meaning": "아내를 내쫓을 7가지 조건, 부모에 불순, 자식 못 나음, 행실, 질투, 병, 말썽, 도둑질"
  },
  {
    "id": "idiom-efc8cf7a6b73",
    "word": "칠령팔락",
    "hanja": "七零八落",
    "meaning": "나무나 풀이 산산이 어울러 떨어짐과 같이 세력이 떨어지고 연락이 끊기어 형편없이 됨"
  },
  {
    "id": "idiom-a5ba0cd4e378",
    "word": "칠보지재",
    "hanja": "七步之才",
    "meaning": "아주 뛰어난 글재주"
  },
  {
    "id": "idiom-f4060b526162",
    "word": "칠신탄탄",
    "hanja": "漆身呑炭",
    "meaning": "몸에 옻칠을 하고 불붙은 숯을 삼킨다는 뜻으로, 복수를 위하여 몸을 괴롭힘을 비유함"
  },
  {
    "id": "idiom-694b0856eb18",
    "word": "칠전팔기",
    "hanja": "七顚八起",
    "meaning": "여러 번의 실패에도 굽히지 아니하고 다시 일어남"
  },
  {
    "id": "idiom-ba3efb77f72e",
    "word": "칠전팔도",
    "hanja": "七顚八倒",
    "meaning": "어려운 고비를 많이 겪음"
  },
  {
    "id": "idiom-510a797e4c6a",
    "word": "칠종칠금",
    "hanja": "七縱七擒",
    "meaning": "제갈 공명의 전술로 일곱 번 놓아 주고 일곱 번 잡는다는 말로 자유자재로 운전술"
  },
  {
    "id": "idiom-09468fa541d0",
    "word": "침불안석",
    "hanja": "寢不安席",
    "meaning": "누워도 자리가 편치 않음 (제갈량의 출사표에 나오는 말)"
  },
  {
    "id": "idiom-bb494e3850d6",
    "word": "침소봉대",
    "hanja": "針小棒大",
    "meaning": "과장해서 말함"
  },
  {
    "id": "idiom-16d4c8bb4e94",
    "word": "침어낙안",
    "hanja": "沈魚落雁",
    "meaning": "고기를 물 속으로 가라앉게 하고 기러기를 땅으로 떨어지게 할 만큼 아름다운 여자"
  },
  {
    "id": "idiom-907c19771b0b",
    "word": "쾌도난마",
    "hanja": "快刀亂麻",
    "meaning": "뒤얽힌 삼베의 실을 잘 드는 칼로 단번에 자르듯이 사물을 명쾌하게 처리하는 것"
  },
  {
    "id": "idiom-1cae92ff1408",
    "word": "쾌독파차",
    "hanja": "快犢破車",
    "meaning": "성질이 거센 송아지는 이따금 제가 끄는 수레를 파괴하나 자라서는 반드시 장쾌한 소가 된다"
  },
  {
    "id": "idiom-f307a289e0e1",
    "word": "쾌락불퇴",
    "hanja": "快樂不退",
    "meaning": "쾌락은 물러나지 않는다. 즉, 쾌락은 한번 빠지면 오래 지속되어 도중에 그치지 않음을 일컬음"
  },
  {
    "id": "idiom-ced5af89f797",
    "word": "쾌인쾌사",
    "hanja": "快人快事",
    "meaning": "쾌활한 사람의 시원스러운 행동"
  },
  {
    "id": "idiom-9292ea7aa66a",
    "word": "타력본원",
    "hanja": "他力本願",
    "meaning": "타인에게 의지하여 일을 성취하려는 일"
  },
  {
    "id": "idiom-9b3d3713c848",
    "word": "타면자건",
    "hanja": "唾面自乾",
    "meaning": "남이 내 얼굴에 침을 뱉으면 저절로 마를 때까지 기다린다 (처세에는 인내가 필요함을 강조)"
  },
  {
    "id": "idiom-660549dfe25f",
    "word": "타산지석",
    "hanja": "他山之石",
    "meaning": "다른 사람의 잘못도 자신을 고치는 데 도움이 됨."
  },
  {
    "id": "idiom-2078a8701d77",
    "word": "타상하설",
    "hanja": "他尙何說",
    "meaning": "한 가지 일을 보면 다른 일도 알 수 있다는 말"
  },
  {
    "id": "idiom-228985555f5f",
    "word": "타초경사",
    "hanja": "打艸驚巳",
    "meaning": "풀을 두들겨서 벰을 놀라게 한다는 말로, 생각 없이 한 일이 뜻밖의 결과를 낳는 것을 뜻한다"
  },
  {
    "id": "idiom-80ae6a9075d0",
    "word": "탁상공론",
    "hanja": "卓上空論",
    "meaning": "실현성이 희박한 공상론"
  },
  {
    "id": "idiom-5de628474ee4",
    "word": "탄금주적",
    "hanja": "彈琴走賊",
    "meaning": "거문고를 울려 적을 쫓아낸다는 뜻"
  },
  {
    "id": "idiom-470ed273c06e",
    "word": "탄주지어",
    "hanja": "呑舟之魚",
    "meaning": "배를 통째로 삼킬 만큼 큰 물고기 (큰 인물이나 걸물)"
  },
  {
    "id": "idiom-a71031c473a3",
    "word": "탄지지간",
    "hanja": "彈指之間",
    "meaning": "손가락을 튀길 사이 (아주 짧은 시간)"
  },
  {
    "id": "idiom-c6bb5b3aaf7e",
    "word": "탄탄대로",
    "hanja": "坦坦大路",
    "meaning": "평평하고 넓은 길로서 ,장래가 아무 어려움이나 괴로움이 없이 수월함을 비유"
  },
  {
    "id": "idiom-5bc5add52cfb",
    "word": "탄환지지",
    "hanja": "彈丸之地",
    "meaning": "탄환크기만한 땅이란 뜻으로 썩 좁은 땅의 비유"
  },
  {
    "id": "idiom-cce7b978254e",
    "word": "탈토지세",
    "hanja": "脫兎之勢",
    "meaning": "토끼가 울에서 뛰어나오듯 신속한 기세를 말한다"
  },
  {
    "id": "idiom-695c79b18e8f",
    "word": "탐관오리",
    "hanja": "貪官汚吏",
    "meaning": "탐욕이 많고 마음이 깨끗하지 못한 관리"
  },
  {
    "id": "idiom-b97fb53b6382",
    "word": "탐천지공",
    "hanja": "貪天之功",
    "meaning": "天然의 공을 탐내어 자신의 공인 체 한다는 의미"
  },
  {
    "id": "idiom-d3e12d9d6f5e",
    "word": "탐화봉접",
    "hanja": "探花蜂蝶",
    "meaning": "꽃을 찾는 벌과 나비. 계집을 좋아하는 사람"
  },
  {
    "id": "idiom-5602490b55f4",
    "word": "태강즉절",
    "hanja": "太剛則折",
    "meaning": "너무 강하면 부러지기 쉽다는 말"
  },
  {
    "id": "idiom-b711f03f13f1",
    "word": "태백착월",
    "hanja": "太白捉月",
    "meaning": "이백이술에 취하여 물에 비친 달을 잡으려다 익사한 일"
  },
  {
    "id": "idiom-d7389d0e06aa",
    "word": "태산북두",
    "hanja": "泰山北斗",
    "meaning": "남에게 존경을 받는 뛰어난 존재"
  },
  {
    "id": "idiom-9e81905d7870",
    "word": "태산압란",
    "hanja": "泰山壓卵",
    "meaning": "태산처럼 무거운 것으로 달걀을 누른다. 쉬운 일을 뜻한다"
  },
  {
    "id": "idiom-655d0ff800a0",
    "word": "태연자약",
    "hanja": "泰然自若",
    "meaning": "마음에 무슨 충동을 받아도 움직임이 없이 천연스러움"
  },
  {
    "id": "idiom-fbb4d8d52f9c",
    "word": "태창제미",
    "hanja": "太倉稊米",
    "meaning": "큰 곳간 안의 돌피 극히 작은 물건 하찮은 것 (=滄海一粟, 九牛一毛)"
  },
  {
    "id": "idiom-c082440f49c9",
    "word": "태평성대",
    "hanja": "太平聖代",
    "meaning": "태평스런 시절"
  },
  {
    "id": "idiom-bb9f559140ab",
    "word": "태평연월",
    "hanja": "太平烟月",
    "meaning": "세상이 평화롭고 안락한 때"
  },
  {
    "id": "idiom-6b9f3cbee2b0",
    "word": "토각귀모",
    "hanja": "兎角龜毛",
    "meaning": "토끼의 뿔과 거북의 털이란 뜻으로, 세상에 있을 수 없는 것의 비유"
  },
  {
    "id": "idiom-16c6b843e3f1",
    "word": "토매인우",
    "hanja": "土昧人遇",
    "meaning": "야만인으로 대우함"
  },
  {
    "id": "idiom-4f076c959dde",
    "word": "토미양화",
    "hanja": "土美養和",
    "meaning": "어진 임금은 人材를 잘 기른다는 뜻"
  },
  {
    "id": "idiom-3b8f4a71b480",
    "word": "토사구팽",
    "hanja": "兎死狗烹",
    "meaning": "필요할 때 이용하고 일이 끝나면 버림."
  },
  {
    "id": "idiom-14ce4f22d2c6",
    "word": "토사호비",
    "hanja": "兎死狐悲",
    "meaning": "토끼의 죽음을 여우가 슬퍼한다는 뜻으로,'같은 무리의 불행을 슬퍼한다.'는 말"
  },
  {
    "id": "idiom-f2a21a733365",
    "word": "토영삼굴",
    "hanja": "兎營三窟",
    "meaning": "토끼집은 입구가 세 개라는 말. 자신의 안전을 위하여 미리 몇 가지 술책을 마련함"
  },
  {
    "id": "idiom-4cae181f7f85",
    "word": "토우목마",
    "hanja": "土牛木馬",
    "meaning": "흙으로 만든 소와 나무로 만든 말이라는 뜻으로, 문벌이 있으나 재주가 없는 사람을 빗대는 말"
  },
  {
    "id": "idiom-fd1094962b4a",
    "word": "토주오비",
    "hanja": "兎走烏飛",
    "meaning": "달에는 토끼가 살고, 해에는 까마귀가 산다 말에서 세월이 빨리 간다"
  },
  {
    "id": "idiom-85817d432a13",
    "word": "토진간담",
    "hanja": "吐盡肝膽",
    "meaning": "솔직한 심정을 속임 없이 모두 말함"
  },
  {
    "id": "idiom-5cd079644141",
    "word": "토포악발",
    "hanja": "吐哺握發",
    "meaning": "밥을 먹거나 머리를 감을 때 손님이 오면 밥은 뱉고, 머리는 쥐고 바로 나가 마중한다는 뜻"
  },
  {
    "id": "idiom-03b1a8ff6a64",
    "word": "통관규천",
    "hanja": "通管窺天",
    "meaning": "붓 대롱을 통해서 하늘을 엿본다"
  },
  {
    "id": "idiom-9ff4f35d1095",
    "word": "통입골수",
    "hanja": "痛入骨髓",
    "meaning": "원한이 깊이 사무쳐 골수에 맺힘"
  },
  {
    "id": "idiom-4f3744f5bffc",
    "word": "투과득경",
    "hanja": "投瓜得瓊",
    "meaning": "오이를 주고 구슬을 얻다 (사소한 선물을 주고 값비싼 답례품을 받다)"
  },
  {
    "id": "idiom-c7e2261dbd45",
    "word": "투서기기",
    "hanja": "投鼠忌器",
    "meaning": "쥐를 잡으려다 그릇을 깨뜨린다. 큰일을 그르칠까 염려되어 그렇게 하지 못함"
  },
  {
    "id": "idiom-1d41ce3c3a13",
    "word": "투편단류",
    "hanja": "投鞭斷流",
    "meaning": "채찍을 던져 강의 흐름을 막는다는 뜻으로 병력에 있어서의 강대함을 비유한 말"
  },
  {
    "id": "idiom-684854c44c2b",
    "word": "투필성자",
    "hanja": "投筆成字",
    "meaning": "글씨를 잘 쓰는 사람은 붓을 아무렇게나 던져도 글씨가 잘 써짐"
  },
  {
    "id": "idiom-0e854d3aeefa",
    "word": "특립독행",
    "hanja": "特立獨行",
    "meaning": "의지하지 않고 자립하여 홀로 행한다. 남에게 굴하지 않고 소신대로 행동함"
  },
  {
    "id": "idiom-8f18ec536b59",
    "word": "파경중원",
    "hanja": "破鏡重圓",
    "meaning": "깨진 거울이 다시 둥근 모습을 되찾았다. 생이별한 부부가 다시 결합한 것"
  },
  {
    "id": "idiom-04c861093a64",
    "word": "파과지년",
    "hanja": "破瓜之年",
    "meaning": "여자의 나이 열여섯 살, 남자의 나이 예순 네 살을 이르는 말"
  },
  {
    "id": "idiom-9ee5b07198bd",
    "word": "파라척결",
    "hanja": "爬羅剔抉",
    "meaning": "손톱으로 후벼 파내듯이 남의 비밀이나 약점을 들추어냄. 숨은 인재를 널리 찾아 냄"
  },
  {
    "id": "idiom-e65a5489f24a",
    "word": "파란곡절",
    "hanja": "波瀾曲折",
    "meaning": "생활이나 일을 진행함에 있어 많은 곤란과 변화를 겪다"
  },
  {
    "id": "idiom-0362cae491dc",
    "word": "파란만장",
    "hanja": "波瀾萬丈",
    "meaning": "물결의 기복이 심한 것처럼 사건의 진행에도 변화가 심함"
  },
  {
    "id": "idiom-70a4598d5599",
    "word": "파란중첩",
    "hanja": "波瀾重疊",
    "meaning": "일의 진행에 있어서 온갖 변화나 난관이 많음"
  },
  {
    "id": "idiom-54559c20730a",
    "word": "파부침선",
    "hanja": "破釜沈船",
    "meaning": "밥 짓는 가마솥을 부수고 돌아갈 배도 가라앉혀, 결사의 각오로 싸움터에 나서거나 결단을 내림"
  },
  {
    "id": "idiom-6fff4830da70",
    "word": "파사현정",
    "hanja": "破邪顯正",
    "meaning": "사한 것을 버리고 정도를 드러냄"
  },
  {
    "id": "idiom-c801494e6e79",
    "word": "파안대소",
    "hanja": "破顔大笑",
    "meaning": "얼굴빛을 부드럽게 하여 웃음"
  },
  {
    "id": "idiom-01e595fc5157",
    "word": "파죽지세",
    "hanja": "破竹之勢",
    "meaning": "대나무를 쪼개듯 거침없이 나아가는 기세."
  },
  {
    "id": "idiom-2822a17f8b62",
    "word": "팔년풍진",
    "hanja": "八年風塵",
    "meaning": "여러 해 동안 고생을 함"
  },
  {
    "id": "idiom-bdb280e2648e",
    "word": "팔달지부",
    "hanja": "八達之父",
    "meaning": "사마의의 부친인 사마준의 별칭. 그의 아들 여덟의 자가 모두 '달'자 돌림이다"
  },
  {
    "id": "idiom-b65daaa9aff3",
    "word": "팔방미인",
    "hanja": "八方美人",
    "meaning": "여러 방면의 일에 두루 능통한 사람"
  },
  {
    "id": "idiom-8365d20f2811",
    "word": "패가망신",
    "hanja": "敗家亡身",
    "meaning": "가산을 모두 탕진하고 몸을 망치다"
  },
  {
    "id": "idiom-8973400d5ee7",
    "word": "패류잔화",
    "hanja": "敗柳殘花",
    "meaning": "잎 떨어진 버드나무와 시든 꽃 (아름다움을 잃은 미인, 권세를 잃은 고관대작)"
  },
  {
    "id": "idiom-7564ed231d33",
    "word": "패역무도",
    "hanja": "悖逆無道",
    "meaning": "패악하고 불순하여 사람다운 데가 없음"
  },
  {
    "id": "idiom-7e67cd1676a8",
    "word": "팽두이숙",
    "hanja": "烹頭耳熟",
    "meaning": "머리를 삶으면 귀까지 삶아진다. 중요한 것만 해결하면 나머지는 따라서 해결됨"
  },
  {
    "id": "idiom-2c96ee78a6ab",
    "word": "평사낙안",
    "hanja": "平沙落雁",
    "meaning": "평탄한 모래사장에 내려앉은 기러기. 단정하고 맵시 있게 쓴 글씨"
  },
  {
    "id": "idiom-cb2f6e2cd3a6",
    "word": "평지돌출",
    "hanja": "平地突出",
    "meaning": "변변치 못한 집안에서 뛰어난 인물이 나옴"
  },
  {
    "id": "idiom-e018395f30aa",
    "word": "평지파란",
    "hanja": "平地波瀾",
    "meaning": "평평한 땅에 파도가 일어난다. (잘되던 일을 일부러 어렵게 만들거나 또는 분쟁을 일으킬 때)"
  },
  {
    "id": "idiom-cb695b8a22f4",
    "word": "평지풍파",
    "hanja": "平地風波",
    "meaning": "평지에서 풍파가 인다. 뜻밖에 일어나는 분쟁"
  },
  {
    "id": "idiom-d44aa33b7b64",
    "word": "폐포파립",
    "hanja": "弊袍破笠",
    "meaning": "헤진 옷과 부러진 갓. 너절하고 구차한 차림새를 말함 (빈궁하여 매우 초라한 모습)"
  },
  {
    "id": "idiom-b4f00486d9d0",
    "word": "폐풍악습",
    "hanja": "弊風惡習",
    "meaning": "폐해가 되는 나쁜 풍습"
  },
  {
    "id": "idiom-27c18e3b7902",
    "word": "포두서찬",
    "hanja": "抱頭鼠竄",
    "meaning": "무서워서 달아나는 쥐처럼 몰골사납게 얼른 숨음"
  },
  {
    "id": "idiom-cbd79f5d6a4a",
    "word": "포락지형",
    "hanja": "炮烙之刑",
    "meaning": "은나라 주왕이 쓰던 형벌로 불에 달군 쇠기둥을 맨발로 걸어가게 하던 형벌"
  },
  {
    "id": "idiom-795732e12dfb",
    "word": "포류지질",
    "hanja": "蒲柳之質",
    "meaning": "물가에 서 있는 버드나무와 같이 허약한 체질, 혹은 머리가 일찍 희는 약한 체질"
  },
  {
    "id": "idiom-2c9286592689",
    "word": "포복절도",
    "hanja": "抱腹絶倒",
    "meaning": "배를 안고 몸을 가누지 못할 정도로 몹시 웃음"
  },
  {
    "id": "idiom-e033b858180d",
    "word": "포식난의",
    "hanja": "飽食暖衣",
    "meaning": "배불리 먹고 따뜻하게 입음"
  },
  {
    "id": "idiom-355652fb1e94",
    "word": "포신구화",
    "hanja": "抱薪求禍",
    "meaning": "불을 끄러 섶을 안고 불 속으로 들어간다. 해를 제거하려다 자멸함"
  },
  {
    "id": "idiom-986b18c501a2",
    "word": "포의지교",
    "hanja": "布衣之交",
    "meaning": "가난할 때 사귄 교분. 벼슬하지 않을 때의 사귐"
  },
  {
    "id": "idiom-1a92c667f577",
    "word": "포정해우",
    "hanja": "庖丁解牛",
    "meaning": "포정은 요리를 잘하던 사람이고, 해우는 살코기와 뼈를 구분하는 것 (기술이 매우 뛰어난 것)"
  },
  {
    "id": "idiom-978632ad6291",
    "word": "포호빙하",
    "hanja": "咆虎馮河",
    "meaning": "맨손으로 범에게 덤비고 걸어서 황하를 건넌다. (죽음을 두려워하지 않는 무모한 용기에 비유)"
  },
  {
    "id": "idiom-b1975ff0fc4b",
    "word": "표리부동",
    "hanja": "表裏不同",
    "meaning": "마음이 음흉 맞아서 겉과 속이 다름"
  },
  {
    "id": "idiom-4f78ae44b10b",
    "word": "풍기문란",
    "hanja": "風紀紊亂",
    "meaning": "풍속, 풍습에 대한 규율이 어지러운 것. 특히 남녀 교제 의 절도 의 어지러움을 말함"
  },
  {
    "id": "idiom-e5b7630bd6c6",
    "word": "풍비박산",
    "hanja": "風飛雹散",
    "meaning": "사방으로 날아 흩어짐. 풍지박산은 잘못된 표현"
  },
  {
    "id": "idiom-c05cd5ea70b2",
    "word": "풍성학려",
    "hanja": "風聲鶴唳",
    "meaning": "바람소리와 학의 울음소리만 들어도 겁먹거나 긴장되어 있을 때는 별것 아닌 것에도 쩔쩔매게 된다"
  },
  {
    "id": "idiom-07407de04aca",
    "word": "풍수지탄",
    "hanja": "風樹之嘆",
    "meaning": "바람과 나무의 탄식이란 말로, 효도를 다 하지 못한 자식의 슬픔"
  },
  {
    "id": "idiom-b7dda4cf6d7a",
    "word": "풍운어수",
    "hanja": "風雲魚水",
    "meaning": "바람과 구름, 물고기와 물 (임금과 신하의 아주 가까운 사이)"
  },
  {
    "id": "idiom-b80b814fbeb6",
    "word": "풍운지회",
    "hanja": "風雲之會",
    "meaning": "밝은 임금과 어진 신하가 서로 만남을 말함 (또는 豪傑이 때를 만나 뜻을 이룸을 뜻한다.)"
  },
  {
    "id": "idiom-e709320fba29",
    "word": "풍월주인",
    "hanja": "風月主人",
    "meaning": "맑은 바람과 밝은 달을 벗하여 노는 한가한 사람. 자연 풍경을 좋아하는 사람"
  },
  {
    "id": "idiom-8c332749330d",
    "word": "풍전등화",
    "hanja": "風前燈火",
    "meaning": "바람 앞의 등불이란 말로, 상황이 오래 견디지 못하고 매우 위급한 형태에 놓여 있음을 가리키는 말"
  },
  {
    "id": "idiom-ba2909967f0f",
    "word": "풍찬노숙",
    "hanja": "風餐露宿",
    "meaning": "바람과 이슬을 무릅쓰고 한데서 먹고 잠. 큰일을 이루려는 사람의 고초를 겪는 모양"
  },
  {
    "id": "idiom-0cb6195a81e4",
    "word": "피골상접",
    "hanja": "皮骨相接",
    "meaning": "살가죽과 뼈가 맞붙을 정도로 몹시 마르다"
  },
  {
    "id": "idiom-1dc0d9e3f82d",
    "word": "피발좌임",
    "hanja": "被髮左衽",
    "meaning": "머리를 풀고 옷을 왼쪽으로 여민다 (미개한 나라의 야만스런 풍습)"
  },
  {
    "id": "idiom-c74c85dce6df",
    "word": "피육지견",
    "hanja": "皮肉之見",
    "meaning": "거죽과 살만 보고 뼈를 보지 못한 것처럼 사물의 실체를 깨닫지 못한 천박한 견해"
  },
  {
    "id": "idiom-9c517f1e7ab9",
    "word": "피장봉호",
    "hanja": "避獐逢虎",
    "meaning": "노루를 피하다 범을 만난다 (작은 해를 피하려다 큰 화를 당함)"
  },
  {
    "id": "idiom-917cbf1b7785",
    "word": "피해망상",
    "hanja": "被害妄想",
    "meaning": "남이 자기에게 해를 입힌다고 생각하는 일"
  },
  {
    "id": "idiom-83ca4a20ab11",
    "word": "필부무죄",
    "hanja": "疋夫無罪",
    "meaning": "착한 사람일지라도 그 신분에 어울리지 않는 물건을 갖고 있으면 재앙을 부르게 된다는 역설적인 뜻"
  },
  {
    "id": "idiom-b2339db823cc",
    "word": "필부지용",
    "hanja": "匹夫之勇",
    "meaning": "소인이 깊은 생각 없이 혈기만 믿고 대드는 용기. 즉 앞뒤 분별없이 마구 행동하는 것"
  },
  {
    "id": "idiom-081b74d233c2",
    "word": "필부필부",
    "hanja": "匹夫匹婦",
    "meaning": "평범한 남녀를 가리키는 말"
  },
  {
    "id": "idiom-0dd5ed6c18de",
    "word": "필유곡절",
    "hanja": "必有曲折",
    "meaning": "반드시 어떠한 까닭이 있음"
  },
  {
    "id": "idiom-81be09bb9b57",
    "word": "하갈동구",
    "hanja": "夏葛冬裘",
    "meaning": "여름에는 베옷과 겨울에는 가죽옷. 일이 격에 맞음"
  },
  {
    "id": "idiom-be968351d72c",
    "word": "하대명년",
    "hanja": "何待明年",
    "meaning": "기다리기가 매우 지루함"
  },
  {
    "id": "idiom-7628b33cb7fe",
    "word": "하도낙서",
    "hanja": "河圖洛書",
    "meaning": "주역의 팔괘와 書經중 洪範九疇의 바탕이 되었다는 상형도 (구하기 힘든 어려운 옛 도서)"
  },
  {
    "id": "idiom-430f55fed581",
    "word": "하로동선",
    "hanja": "夏爐冬扇",
    "meaning": "여름의 화로와 겨울의 부채. 곧 격이나 철에 맞지 않거나 쓸데없는 사물을 비유하는 말"
  },
  {
    "id": "idiom-174c0638f098",
    "word": "하석상대",
    "hanja": "下石上臺",
    "meaning": "아랫돌 빼서 윗돌 괴고 윗돌 빼서 아랫돌 괴기. 임시변통으로 이리 저리 둘러맞춤"
  },
  {
    "id": "idiom-3f750dd75ba9",
    "word": "하우불이",
    "hanja": "下愚不移",
    "meaning": "어리석고 못난 사람의 버릇은 고치지 못함"
  },
  {
    "id": "idiom-2ba2d48c2691",
    "word": "하의상달",
    "hanja": "下意上達",
    "meaning": "아래의 뜻이 위에 도달한다는 뜻으로, 일반인들의 심정이 윗사람들에게 통하는 것을 의미 함"
  },
  {
    "id": "idiom-58d8d1a1597c",
    "word": "하필성문",
    "hanja": "下筆成文",
    "meaning": "붓만 들면 名文이라는 뜻. (言出爲論 下筆成文원어)"
  },
  {
    "id": "idiom-64fea7bbbee6",
    "word": "하학상달",
    "hanja": "下學上達",
    "meaning": "낮고 쉬운 것부터 배워 깊고 어려운 것을 깨달음"
  },
  {
    "id": "idiom-2cfa4f508b42",
    "word": "하한기언",
    "hanja": "河漢其言",
    "meaning": "뜻이 심원하여 용이하게 헤아리기 어려움"
  },
  {
    "id": "idiom-3ac8944c43eb",
    "word": "하해지택",
    "hanja": "河海之澤",
    "meaning": "강이나 바다처럼 넓고 큰 혜택"
  },
  {
    "id": "idiom-8639d0920f52",
    "word": "학구소붕",
    "hanja": "鷽鳩笑鵬",
    "meaning": "작은 비둘기가 큰 붕새를 보고 웃는다. 되지 못한 소인이 위인의 업적과 행위를 비웃는다는 뜻"
  },
  {
    "id": "idiom-6ac22283af25",
    "word": "학수고대",
    "hanja": "鶴首苦待",
    "meaning": "학의 목처럼 목을 길게 늘여 몹시 기다린다는 뜻"
  },
  {
    "id": "idiom-9ee81c982466",
    "word": "학여불급",
    "hanja": "學如不及",
    "meaning": "학업을 언제나 모자란 듯이 여김"
  },
  {
    "id": "idiom-f02169e88a27",
    "word": "학이지지",
    "hanja": "學而知之",
    "meaning": "배워서 앎"
  },
  {
    "id": "idiom-0ac1a4f87af6",
    "word": "학철부어",
    "hanja": "涸轍鮒魚",
    "meaning": "매우 위급한 경우에 처했거나 몹시 고단하고 옹색함"
  },
  {
    "id": "idiom-a9002912fdf7",
    "word": "한강투석",
    "hanja": "漢江投石",
    "meaning": "한강에 돌 던지기.즉, 아무리 애를 써도 보람 없고 쓸모없는 일이라는 뜻"
  },
  {
    "id": "idiom-4638a22b45f6",
    "word": "한단지몽",
    "hanja": "邯鄲之夢",
    "meaning": "사람의 일생에 '부귀란 헛되고 덧없다'는 뜻 한단에서 여옹이 낮잠을 자면서 꾼 꿈에 유래"
  },
  {
    "id": "idiom-a701d73e07c0",
    "word": "한단지보",
    "hanja": "邯鄲之步",
    "meaning": "본분을 잊고 억지로 남의 흉내를 내면 실패한다. 자기 것을 잃음을 비유"
  },
  {
    "id": "idiom-5afd67991b6b",
    "word": "한불조지",
    "hanja": "恨不早知",
    "meaning": "일의 기틀을 일찍 알지 못한 것을 뉘우침"
  },
  {
    "id": "idiom-81a907fd6d70",
    "word": "한우충동",
    "hanja": "汗牛充棟",
    "meaning": "책을 실은 수레를 끄는 소가 흘리는 땀이 많다는 뜻으로, 책이 많다는 뜻"
  },
  {
    "id": "idiom-cd799566cc52",
    "word": "한운야학",
    "hanja": "閑雲野鶴",
    "meaning": "한가로운 구름 아래 노니는 들의 학. 벼슬과 어지러운 세상을 버리고 강호에 묻혀 사는 사람"
  },
  {
    "id": "idiom-f6211197d6c4",
    "word": "한중진미",
    "hanja": "閒中眞味",
    "meaning": "한가한 가운데 깃드는 참된 멋"
  },
  {
    "id": "idiom-8c5fcf1c9c40",
    "word": "한출첨배",
    "hanja": "汗出沾背",
    "meaning": "땀이 등에 밴다. 몹시 민망하고 창피함"
  },
  {
    "id": "idiom-31812a79811c",
    "word": "한화휴제",
    "hanja": "閑話休題",
    "meaning": "쓸데없는 이야기는 그만둔다는 뜻으로, 한동안 본론에서 벗어났다가 다시 본론으로 돌아감을 이름"
  },
  {
    "id": "idiom-acd075a6791c",
    "word": "할고담복",
    "hanja": "割股啖腹",
    "meaning": "공복을 채우기 위해 제 허벅살을 뜯어먹는다. 한 때의 곤란만 면하려는 어리석은 잔꾀 (=割股充腹)"
  },
  {
    "id": "idiom-bb1d3cc1cd81",
    "word": "할반지통",
    "hanja": "割半之痛",
    "meaning": "몸의 반쪽을 베어 내는 고통, 형제자매가 죽은 슬픔"
  },
  {
    "id": "idiom-468df53603f2",
    "word": "할수기포",
    "hanja": "割鬚棄袍",
    "meaning": "수염을 자르고 도포를 버린다는 뜻"
  },
  {
    "id": "idiom-69bf971a522d",
    "word": "함구무언",
    "hanja": "緘口無言",
    "meaning": "입을 다물고 아무런 말이 없음"
  },
  {
    "id": "idiom-307185f87226",
    "word": "함분축원",
    "hanja": "含憤蓄怨",
    "meaning": "분함과 원한을 품음"
  },
  {
    "id": "idiom-890d2fc52532",
    "word": "함사사영",
    "hanja": "含沙射影",
    "meaning": "모래를 머금어 그림자를 쏜다는 말 (암암리에 사람을 해치는 것을 비유한 말)"
  },
  {
    "id": "idiom-20d5917faedc",
    "word": "함포고복",
    "hanja": "含哺鼓腹",
    "meaning": "배불리 먹고 즐겁게 지냄"
  },
  {
    "id": "idiom-df4d482962ec",
    "word": "함흥차사",
    "hanja": "咸興差使",
    "meaning": "太祖가 禪位하고 함흥에 은퇴해있을 때, 태종이 보낸 사신을 죽이거나 잡아가두어 돌려보내지 않음"
  },
  {
    "id": "idiom-eedbb735d7d4",
    "word": "합종연횡",
    "hanja": "合縱連橫",
    "meaning": "攻守동맹의 뜻, 남북으로 합류하고 동서로 연합한다는 뜻으로, 강적에 대항하기 위한 권모술수의 전략"
  },
  {
    "id": "idiom-7edc05dcf7af",
    "word": "항려지년",
    "hanja": "伉儷之年",
    "meaning": "장가들고 시집갈 나이"
  },
  {
    "id": "idiom-9c92eff50d4f",
    "word": "항룡유회",
    "hanja": "亢龍有悔",
    "meaning": "적정한 선에서 만족할줄 모르고 무작정 밀고 나가다가 오히려 실패를 가져오게 됨을 비유"
  },
  {
    "id": "idiom-84be3b75dc3d",
    "word": "항산항심",
    "hanja": "恒産恒心",
    "meaning": "재산이 있어야 마음의 여유가 생김"
  },
  {
    "id": "idiom-bef04045731f",
    "word": "해로동혈",
    "hanja": "偕老同穴",
    "meaning": "부부의 금실이 좋아서 함께 늙고 함께 묻힘"
  },
  {
    "id": "idiom-d76c4005dcc1",
    "word": "해불양수",
    "hanja": "海不讓水",
    "meaning": "바다는 모든 물을 사양하지 않는다 (=河海不擇細流)"
  },
  {
    "id": "idiom-e6285c0fd60c",
    "word": "해시지와",
    "hanja": "亥豕之訛",
    "meaning": "亥자와 豕자는 字體가 비슷하여 혼동하기가 쉽다는 뜻 책을 간행할 때 비슷한 글자는 잘못 쓰기 쉽다"
  },
  {
    "id": "idiom-b4ed68a08016",
    "word": "해어지화",
    "hanja": "解語之花",
    "meaning": "말을 알아듣는 꽃이란 뜻으로, 미인을 이르는 말"
  },
  {
    "id": "idiom-64ae44aefa04",
    "word": "해옹호구",
    "hanja": "海翁好鷗",
    "meaning": "바다 노인이 갈매기를 좋아한다는 말로, 사람에게 野心이 있으면 새도 그것을 알고 가까이하지 않음"
  },
  {
    "id": "idiom-2ca631adca02",
    "word": "해의추식",
    "hanja": "解衣推食",
    "meaning": "옷을 벗어주고 음식을 밀어준다. 남에게 은혜를 베푸는 것"
  },
  {
    "id": "idiom-8648a3755eb5",
    "word": "행불유경",
    "hanja": "行不由徑",
    "meaning": "지름길이나 뒤안길을 가지 않고 큰 길을 걷는다는 말로, 정정당당히 일함"
  },
  {
    "id": "idiom-d6cb712fc4d9",
    "word": "행시주육",
    "hanja": "行尸走肉",
    "meaning": "송장의 움직임과 같이 형태만 있고 아무 소용이 없다는 뜻. 무식한 사람을 멸시하는 말로 쓰인다"
  },
  {
    "id": "idiom-6b2770498bac",
    "word": "행운유수",
    "hanja": "行雲流水",
    "meaning": "떠나가는 구름과 흐르는 물"
  },
  {
    "id": "idiom-eae5f5e56878",
    "word": "행장진퇴",
    "hanja": "行藏進退",
    "meaning": "지식인이 時勢에 응하여 벼슬에 나아가기도 하고 물러설 줄도 아는 처신의 신중함"
  },
  {
    "id": "idiom-5d2001821a12",
    "word": "향우지탄",
    "hanja": "向隅之歎",
    "meaning": "많은 사람들이 다 즐거워하나 자기만은 구석을 향하여 한탄한다. 좋은 때를 만나지 못하여 한탄함"
  },
  {
    "id": "idiom-3be10942bc61",
    "word": "허례허식",
    "hanja": "虛禮虛飾",
    "meaning": "예절, 법식 등을 겉으로만 꾸며 번드레하게 하는 일"
  },
  {
    "id": "idiom-877c4bf513a5",
    "word": "허무맹랑",
    "hanja": "虛無孟浪",
    "meaning": "터무니없이 허황되고 실상이 없음"
  },
  {
    "id": "idiom-635b1645f7d0",
    "word": "허심탄회",
    "hanja": "虛心坦懷",
    "meaning": "마음속에 아무런 사념 없이 품은 생각을 터놓고 말함"
  },
  {
    "id": "idiom-2a5cb9373e83",
    "word": "허유괘표",
    "hanja": "許由掛瓢",
    "meaning": "속세를 떠나 청렴하게 살아가는 모양"
  },
  {
    "id": "idiom-146bfa6227dd",
    "word": "허장성세",
    "hanja": "虛張聲勢",
    "meaning": "실속이 없으면서 허세만 떠벌림"
  },
  {
    "id": "idiom-5b3d96bb52cf",
    "word": "허허실실",
    "hanja": "虛虛實實",
    "meaning": "서로 꾀나 재주를 다하여 적의 실을 피하고 허를 서로 타서 싸움"
  },
  {
    "id": "idiom-dc573b34a3a9",
    "word": "현두자고",
    "hanja": "懸頭刺股",
    "meaning": "머리를 노끈으로 묶어 높이 걸어 잠을 깨우고 또 허벅다리를 찔러 잠을 깨운다. 학업에 매우 힘씀"
  },
  {
    "id": "idiom-c920090768df",
    "word": "현모양처",
    "hanja": "賢母良妻",
    "meaning": "어진 어머니 이면서 또한 착한 아내"
  },
  {
    "id": "idiom-29cb8de5ff7c",
    "word": "현하구변",
    "hanja": "懸河口辯",
    "meaning": "흐르는 물과 같이 거침없이 술술 나오는 말"
  },
  {
    "id": "idiom-33d179957561",
    "word": "현하웅변",
    "hanja": "懸河雄辯",
    "meaning": "현하구변과 같은 뜻"
  },
  {
    "id": "idiom-773876b1cc7b",
    "word": "현하지변",
    "hanja": "懸河之辨",
    "meaning": "흐르는 물과 같은 연설. 매우 유창한 말솜씨"
  },
  {
    "id": "idiom-feec99f01f46",
    "word": "혈혈단신",
    "hanja": "孑孑單身",
    "meaning": "지할 때가 없는 외로운 홀몸"
  },
  {
    "id": "idiom-3bd277e395c1",
    "word": "형설지공",
    "hanja": "螢雪之功",
    "meaning": "애써 공부한 보람"
  },
  {
    "id": "idiom-af1bada0cb6b",
    "word": "형제혁장",
    "hanja": "兄弟鬩墻",
    "meaning": "형제가 담장 안에서 싸운다. 同族相爭을 말한다"
  },
  {
    "id": "idiom-6565062c901a",
    "word": "형창설안",
    "hanja": "螢窓雪案",
    "meaning": "어려운 가운데서도 학문에 힘씀을 비유한 말"
  },
  {
    "id": "idiom-9f3dcc81ef76",
    "word": "혜분난비",
    "hanja": "惠焚蘭悲",
    "meaning": "혜초가 불에 타면 난초가 슬퍼한다는 뜻으로 벗의 불행을 슬퍼함"
  },
  {
    "id": "idiom-239a22b2e263",
    "word": "혜전탈우",
    "hanja": "蹊田奪牛",
    "meaning": "남의 소가 내 밭을 짓밟았다고 그 소를 빼앗다. 가벼운 죄에 대한 처벌이 혹독하다는 뜻"
  },
  {
    "id": "idiom-8724385bf561",
    "word": "호가호위",
    "hanja": "狐假虎威",
    "meaning": "남의 권세를 빌려 위세를 부림."
  },
  {
    "id": "idiom-06da9f98b437",
    "word": "호각지세",
    "hanja": "互角之勢",
    "meaning": "서로 비슷비슷한 威勢"
  },
  {
    "id": "idiom-7149032571fa",
    "word": "호계삼소",
    "hanja": "虎溪三笑",
    "meaning": "학문이나 예술에 열중하여 道程이 먼 것을 잊음 (중국 고사에서 취제한 동양화의 화제)"
  },
  {
    "id": "idiom-a0bd35382021",
    "word": "호구고수",
    "hanja": "狐裘羔袖",
    "meaning": "값비싼 호구 (호백구)에 염소가죽으로 소매를 단다. (전체적으로 좋으나 한군데 결점이 있음)"
  },
  {
    "id": "idiom-4829b85aedc1",
    "word": "호구지계",
    "hanja": "狐丘之戒",
    "meaning": "호구의 경계라는 말로, 다른 사람으로부터 원망을 사는 일이 없도록 하라는 경계를 뜻한다"
  },
  {
    "id": "idiom-2fb7c4d0e389",
    "word": "호구지책",
    "hanja": "糊口之策",
    "meaning": "가난한 살림에서 겨우 먹고 살아가는 방책"
  },
  {
    "id": "idiom-0083109f526b",
    "word": "호기택환",
    "hanja": "虎飢擇宦",
    "meaning": "굶주린 호랑이는 고자도 마다하지 않는다. 일이 위급할 때는 무슨 일이든 분별 선택하지 못한다"
  },
  {
    "id": "idiom-7c2d8b813a9a",
    "word": "호노한복",
    "hanja": "豪奴悍僕",
    "meaning": "고분고분하지 않고 드센 종"
  },
  {
    "id": "idiom-406f1336b870",
    "word": "호모부가",
    "hanja": "毫毛斧柯",
    "meaning": "수목을 어릴 때 베지 않으면 마침내 도끼를 사용하는 노력이 필요하게 된다. (禍는 미세할 예방하라)"
  },
  {
    "id": "idiom-870ca9895a69",
    "word": "호복기사",
    "hanja": "胡服騎射",
    "meaning": "호복 (胡腹:유목 기마족의 복장)을 입고 기사를 초청한다. (어떤 일에 착수할 만전의 태세를 갖추는 것)"
  },
  {
    "id": "idiom-490d0dc6f44e",
    "word": "호부견자",
    "hanja": "虎父犬子",
    "meaning": "호랑이 아비에 개아들 (나라를 세운 유비에 비하여 그 나라를 주색으로 망쳐버린 아들 유선을 비교)"
  },
  {
    "id": "idiom-f509d7ae9f1a",
    "word": "호사다마",
    "hanja": "好事多魔",
    "meaning": "좋은 일에는 흔히 장애물이 들기 쉬움"
  },
  {
    "id": "idiom-d0b2e1936160",
    "word": "호사유피",
    "hanja": "豹死留皮",
    "meaning": "범은 죽어서 가죽을 남"
  },
  {
    "id": "idiom-9541187ed369",
    "word": "호시탐탐",
    "hanja": "虎視耽耽",
    "meaning": "범이 먹이를 노려봄. 기회를 노려보고 있는 모양"
  },
  {
    "id": "idiom-72c2e8d15c23",
    "word": "호언장담",
    "hanja": "豪言壯談",
    "meaning": "실지 이상으로 보태어서 허풍 쳐 하는 말"
  },
  {
    "id": "idiom-c7588808391e",
    "word": "호연지기",
    "hanja": "浩然之氣",
    "meaning": "도의에 근거를 두고 굽히지 않고 흔들리지 않는 바르고 큰마음"
  },
  {
    "id": "idiom-bff46e344082",
    "word": "호유기미",
    "hanja": "狐濡其尾",
    "meaning": "처음에는 쉬워도 나중에는 곤경에 빠짐, 준비가 없으면 일을 추진할 수 없음"
  },
  {
    "id": "idiom-ca6eb6dc5eaa",
    "word": "호의현상",
    "hanja": "縞衣玄裳",
    "meaning": "흰 옷과 검은 치마. 소동파의 적벽부에 나오는 말로 학과 같은 깨끗함"
  },
  {
    "id": "idiom-9abc395bdea5",
    "word": "호의호식",
    "hanja": "好衣好食",
    "meaning": "잘 입고 잘 먹음"
  },
  {
    "id": "idiom-f1ae01032081",
    "word": "호접지몽",
    "hanja": "胡蝶之夢",
    "meaning": "물아 (物我)의 구별을 잊음 (나비가 되어 즐기는데, 나비가 장자인지 장자가 나비인지 분간하지 못함)"
  },
  {
    "id": "idiom-3d1381181b61",
    "word": "호중천지",
    "hanja": "壺中天地",
    "meaning": "항아리 속의 하늘이라는 뜻으로 술에 취하여 세속을 잊어버리는 즐거움을 이르는 말"
  },
  {
    "id": "idiom-00d188cecd56",
    "word": "호천고지",
    "hanja": "呼天叩地",
    "meaning": "매우 애통하여 하늘을 부르며 땅을 침"
  },
  {
    "id": "idiom-4515b153959d",
    "word": "호천망극",
    "hanja": "昊天罔極",
    "meaning": "끝없는 하늘과 같이 부모의 은공이 끝이 없음"
  },
  {
    "id": "idiom-8250f67db34b",
    "word": "호치단순",
    "hanja": "皓齒丹脣",
    "meaning": "아름다운 여자의 붉은 입술과 흰 이를 말한다"
  },
  {
    "id": "idiom-2acfdb1889df",
    "word": "호형호제",
    "hanja": "呼兄呼弟",
    "meaning": "서로 형. 아우라 부를 정도로 가까운 친구사이"
  },
  {
    "id": "idiom-ae0aed401a67",
    "word": "호호선생",
    "hanja": "好好先生",
    "meaning": "무엇이던지 '좋네, 좋아'라고 답하는 사마휘의 별명. (우유부단하다는 말 들으나, 남의 원망은 안 산다)"
  },
  {
    "id": "idiom-75d6a7a8bd0f",
    "word": "혹세무민",
    "hanja": "惑世誣民",
    "meaning": "세상을 어지럽히고 백성을 속이는 것"
  },
  {
    "id": "idiom-1151492000f7",
    "word": "혼비백산",
    "hanja": "魂飛魄散",
    "meaning": "혼이 날아서 흩어졌다 함은 매우 크게 놀랐다는 뜻"
  },
  {
    "id": "idiom-039a05ca4728",
    "word": "혼승백강",
    "hanja": "魂昇魄降",
    "meaning": "죽은 사람의 영혼은 하늘로 올라가고 시체는 땅으로 내려감"
  },
  {
    "id": "idiom-b4d34e61e0ea",
    "word": "혼야애걸",
    "hanja": "昏夜哀乞",
    "meaning": "깊은 밤, 사람 없는 틈을 타서 권세 있는 사람에게 애걸하는 일"
  },
  {
    "id": "idiom-29d37aba527b",
    "word": "혼연일체",
    "hanja": "渾然一體",
    "meaning": "조그만 차별이나 작은 균열도 없이 한 몸이 됨"
  },
  {
    "id": "idiom-52069b5bcab3",
    "word": "혼연일치",
    "hanja": "渾然一致",
    "meaning": "차별 없이 서로 합치함"
  },
  {
    "id": "idiom-a281e9e5e560",
    "word": "혼정신성",
    "hanja": "昏定晨省",
    "meaning": "자식이 부모님께 아침저녁으로 잠자리를 보살펴드리는 것"
  },
  {
    "id": "idiom-fce9522b6805",
    "word": "홀현홀몰",
    "hanja": "忽顯忽沒",
    "meaning": "문득 나타났다가 홀연 없어짐"
  },
  {
    "id": "idiom-4d13ca3be9c0",
    "word": "홍로점설",
    "hanja": "紅爐點雪",
    "meaning": "뜨거운 불길 위에 한 점 눈을 뿌리면 순식간에 녹듯이 마음이 탁 트여 맑음을 일컫는 말"
  },
  {
    "id": "idiom-c9b9f3fbdb31",
    "word": "홍문연회",
    "hanja": "鴻門燕會",
    "meaning": "초나라와 한나라가 천하를 두고 다툴 때 항우와 유방이 참석했던 연회 (겉과 속이 다른 짓을 일음)"
  },
  {
    "id": "idiom-96f85e5d8186",
    "word": "홍익인간",
    "hanja": "弘益人間",
    "meaning": "널리 인간 세계를 이롭게 함. 단군의 건국이념이다"
  },
  {
    "id": "idiom-55869083125f",
    "word": "화광동진",
    "hanja": "和光同塵",
    "meaning": "和光은 빛을 부드럽게, 同塵은 세상 사람들과 함께 (자기의 智德의 빛을 싸 감추고 드러내지 않음)"
  },
  {
    "id": "idiom-6216763735c0",
    "word": "화광충천",
    "hanja": "火光衝天",
    "meaning": "불길이 하늘을 찌를 듯이 맹렬함 (불기둥, 구름기둥)"
  },
  {
    "id": "idiom-0faa7d7f5412",
    "word": "화룡점정",
    "hanja": "畫龍點睛",
    "meaning": "마지막으로 중요한 부분을 더해 일을 완성함."
  },
  {
    "id": "idiom-189399addd3d",
    "word": "화복무문",
    "hanja": "禍福無門",
    "meaning": "악한 일을 하면 그것은 화가 들어오는 문이 되고, 착한 일을 하면 그것이 복이 들어오는 문이다"
  },
  {
    "id": "idiom-6dd6f2c408bf",
    "word": "화사첨족",
    "hanja": "畵蛇添足",
    "meaning": "뱀을 그리고 발을 더한다. 쓸데없는 일을 함"
  },
  {
    "id": "idiom-666bda7ab12b",
    "word": "화서지몽",
    "hanja": "華胥之夢",
    "meaning": "좋은 꿈이나 낮잠"
  },
  {
    "id": "idiom-4d4df9044bd8",
    "word": "화씨지벽",
    "hanja": "和氏之璧",
    "meaning": "천하에서 가장 이름난 옥"
  },
  {
    "id": "idiom-2e39c1613780",
    "word": "화용월태",
    "hanja": "花容月態",
    "meaning": "아름다운 여자의 고운 容態를 이르는 말"
  },
  {
    "id": "idiom-b2460e1ef252",
    "word": "화이부동",
    "hanja": "和而不同",
    "meaning": "남과 화목하게 지내지만 자기의 중심과 원칙을 잃지 않음"
  },
  {
    "id": "idiom-ee8e00e111c5",
    "word": "화이부실",
    "hanja": "華而不實",
    "meaning": "사람이나 사물이 겉으로는 좋아 보이지만 알맹이가 없음을 비유한 말"
  },
  {
    "id": "idiom-8fd080c27b64",
    "word": "화재적악",
    "hanja": "禍在積惡",
    "meaning": "禍의 근원은 惡을 쌓는 데 있다"
  },
  {
    "id": "idiom-9255c44c75af",
    "word": "화종구생",
    "hanja": "禍從口生",
    "meaning": "화는 입으로부터 생긴다. 말을 조심하라"
  },
  {
    "id": "idiom-4e4252d736a3",
    "word": "화중군자",
    "hanja": "花中君子",
    "meaning": "꽃 중의 군자라는 뜻. 곧, 연꽃을 달리 일컫는 말"
  },
  {
    "id": "idiom-6be1ad387502",
    "word": "화중지병",
    "hanja": "畵中之餠",
    "meaning": "그림의 떡. 곧 실속 없는 말에 비유하는 말"
  },
  {
    "id": "idiom-553b787c629c",
    "word": "화풍난양",
    "hanja": "和風暖陽",
    "meaning": "화창한 바람과 따뜻한 햇볕, 곧 좋은 날씨"
  },
  {
    "id": "idiom-68df584630e5",
    "word": "화호유구",
    "hanja": "畵虎類狗",
    "meaning": "호랑이를 그리려다가 개를 그렸다. 서투른 솜씨로 어려운 일을 하려다가 도리어 잘못됨"
  },
  {
    "id": "idiom-73f632c7cf83",
    "word": "환골탈태",
    "hanja": "換骨奪胎",
    "meaning": "모습이나 수준이 몰라볼 만큼 새롭게 달라짐."
  },
  {
    "id": "idiom-49cbc750660a",
    "word": "환과고독",
    "hanja": "鰥寡孤獨",
    "meaning": "홀아비, 홀어미, 어리고 어버이 없는 아이, 늙고 자식 없는 사람. 외롭고 의지할 곳 없는 처지의 사람"
  },
  {
    "id": "idiom-9b0169e8766e",
    "word": "환부작신",
    "hanja": "換腐作新",
    "meaning": "낡은 것을 바꾸어 새 것으로 만듦"
  },
  {
    "id": "idiom-7ac7059b8eec",
    "word": "환호작약",
    "hanja": "歡呼雀躍",
    "meaning": "기뻐서 소리치며 날뜀"
  },
  {
    "id": "idiom-891d614c9634",
    "word": "황견유부",
    "hanja": "黃絹幼婦",
    "meaning": "絶妙라는 뜻의 은어"
  },
  {
    "id": "idiom-e19c24275f7b",
    "word": "황구소아",
    "hanja": "黃口小兒",
    "meaning": "어린아이라는 뜻. 참새 새끼의 황색 주둥이에서 연유"
  },
  {
    "id": "idiom-61b5aef5af33",
    "word": "황당무계",
    "hanja": "荒唐無稽",
    "meaning": "말이나 행동이 허황되어 믿을 수가 없음"
  },
  {
    "id": "idiom-f205dc9722b7",
    "word": "회계지치",
    "hanja": "會稽之恥",
    "meaning": "춘추시대 越王 勾踐이 吳王 夫差와 會稽山에서 싸워 포로로 잡혔다가 굴욕적인 강화를 하고 풀려남"
  },
  {
    "id": "idiom-80852bc6fea9",
    "word": "회귤고사",
    "hanja": "懷橘故事",
    "meaning": "오의 육적이 원술의 초청을 받아 잔치에 참가하였을 때, 모친을 생각하여 귤을 품어 달아났다는 고사"
  },
  {
    "id": "idiom-10b401fb70ee",
    "word": "회벽유죄",
    "hanja": "懷璧有罪",
    "meaning": "옥을 지니고 있는 것이 죄가 된다. 분수에 맞지 않는 것을 가지고 있으면 재앙이 온다"
  },
  {
    "id": "idiom-d604a53bbfea",
    "word": "회사후소",
    "hanja": "繪事後素",
    "meaning": "그림 그리는 일은 흰 바탕이 있은 이후에 한다는 말로, 본질이 있은 연후에 꾸밈이 있음을 말한다"
  },
  {
    "id": "idiom-9e475ac321c5",
    "word": "회자인구",
    "hanja": "膾炙人口",
    "meaning": "널리 사람들에게 알려져 입에 오르내리고 찬양을 받음"
  },
  {
    "id": "idiom-b35dfcb55373",
    "word": "회자정리",
    "hanja": "會者定離",
    "meaning": "만나면 반드시 헤어지게 마련임"
  },
  {
    "id": "idiom-ef78c50f5af4",
    "word": "회총시위",
    "hanja": "懷寵尸位",
    "meaning": "임금의 총애를 믿고 물러가야 할 때에 물러가지 않고 벼슬자리만 헛되이 차지함을 가리키는 말"
  },
  {
    "id": "idiom-d6df31effd2d",
    "word": "획지위뢰",
    "hanja": "劃地爲牢",
    "meaning": "감옥 대신 땅에다 금을 그어놓고 죄인을 그 안에 가두어도 도망하지 않는다는 뜻 (태평한 시대)"
  },
  {
    "id": "idiom-ba73e176ac2d",
    "word": "횡설수설",
    "hanja": "橫說竪說",
    "meaning": "조리가 없는 함부로 지껄임"
  },
  {
    "id": "idiom-c6bdadbfe5f0",
    "word": "후목분장",
    "hanja": "朽木糞牆",
    "meaning": "썩은 나무에 조각하거나 부패한 벽토에 흙칠을 하여도 소용이 없다는 뜻. (혼란한 세상을 비유)"
  },
  {
    "id": "idiom-83c07e71c9e5",
    "word": "후생가외",
    "hanja": "後生可畏",
    "meaning": "젊은 후배들은 두려워할 만함"
  },
  {
    "id": "idiom-bf2eea21e71b",
    "word": "후안무치",
    "hanja": "厚顔無恥",
    "meaning": "낯가죽이 두꺼워 부끄러운 줄을 모름"
  },
  {
    "id": "idiom-28b48837a2bd",
    "word": "후회막급",
    "hanja": "後悔莫及",
    "meaning": "일이 잘못된 뒤라 아무리 뉘우쳐도 어찌할 수 없다"
  },
  {
    "id": "idiom-04e0bd604e9a",
    "word": "흉유성죽",
    "hanja": "胸有成竹",
    "meaning": "여가가 대 (竹)를 그리고자 할 때, 마음속에는 이미 成竹이 있다. (착수하기 전에 충분한 복안이 있음)"
  },
  {
    "id": "idiom-9cef4f7788c6",
    "word": "흉중생진",
    "hanja": "胸中生塵",
    "meaning": "가슴에 먼지가 생긴다. 사람을 잊지 않고 생각은 오래 하면서 만나지 못함을 일컫는 말이다"
  },
  {
    "id": "idiom-492ee7cc50e8",
    "word": "흥망성쇠",
    "hanja": "興亡盛衰",
    "meaning": "흥하고 망함과 번성함과 쇠약함"
  },
  {
    "id": "idiom-35913d637cd2",
    "word": "흥미진진",
    "hanja": "興味津津",
    "meaning": "흥미가 넘칠 만큼 많다"
  },
  {
    "id": "idiom-84de38d65ad3",
    "word": "흥진비래",
    "hanja": "興盡悲來",
    "meaning": "즐거운 일이 다하면 슬픔이 옴. 흥망과 성쇠가 엇바뀜을 일컫는 말"
  },
  {
    "id": "idiom-37bb6e290145",
    "word": "희노애락",
    "hanja": "喜怒哀樂",
    "meaning": "기쁨과 노여움과 슬픔과 즐거움. 곧 사람의 온갖 감정"
  },
  {
    "id": "idiom-84a35e43d837",
    "word": "희불승애",
    "hanja": "喜不勝哀",
    "meaning": "기쁨은 슬픔을 이길 수 없다"
  },
  {
    "id": "idiom-f1047b1b1fac",
    "word": "희색만면",
    "hanja": "喜色滿面",
    "meaning": "기쁜 빛이 얼굴에 가득함"
  },
  {
    "id": "idiom-a99322a4718a",
    "word": "희희낙락",
    "hanja": "喜喜樂樂",
    "meaning": "매우 기쁘고 즐거워함"
  }
];
